"use strict"


//level1
let lev1 = {
    mul: "তিপিটক (মূল)", 
    att: "অট্ঠকথা", 
    tik: "টীকা", 
    ann: "অন্যান্য"
}

//level2
let mul = {
    vinmul: "ৰিনযপিটক", 
    sutmul: "সুত্তপিটক", 
    abhmul: "অভিধম্মপিটক"
}
let att = {
    vinatt: "ৰিনযপিটক (অট্ঠকথা)", 
    sutatt: "সুত্তপিটক (অট্ঠকথা)", 
    abhatt: "অভিধম্মপিটক (অট্ঠকথা)"
}
let tik = {
    vintik: "ৰিনযপিটক (টীকা)", 
    suttik: "সুত্তপিটক (টীকা)", 
    abhtik: "অভিধম্মপিটক (টীকা)"
}
let ann = {
    vismag: "ৰিসুদ্ধিমগ্গ", 
    sangpu: "সঙ্গাযন-পুচ্ছ ৰিসজ্জনা", 
    ledisa: "লেডী সেযাডো গন্থ-সঙ্গহো",
    budvan: "বুদ্ধ-ৰন্দনা গন্থ সঙ্গহো",
    vangsa: "ৰংস গন্থ সঙ্গহো",
    vyakrn: "ব্যাকরণ গন্থ সঙ্গহো",
    nitiga: "নীতি গন্থ সঙ্গহো",
    pakinn: "পকিণ্ণক গন্থ সঙ্গহো",
    sihala: "সিহল় গন্থ সঙ্গহো"
}

//level3mul
let vinmul = {
    mul1v01par: "পারাজিকপাল়ি",
    mul1v02pac: "পাচিত্তিযপাল়ি",
    mul1v03mah: "মহাৰগ্গপাল়ি",
    mul1v04cul: "চূল়ৰগ্গপাল়ি",
    mul1v05par: "পরিৰারপাল়ি"
}
let sutmul = {
    digmul: "দীঘনিকায",
    majmul: "মজ্ঝিমনিকায",
    sammul: "সংযুত্তনিকায",
    angmul: "অঙ্গুত্তরনিকায",
    khumul: "খুদ্দকনিকায"
}
let abhmul = {
    mul7a01dha: "ধম্মসঙ্গণীপাল়ি",
    mul7a02vib: "ৰিভঙ্গপাল়ি",
    mul7a03dha: "ধাতুকথাপাল়ি",
    mul7a04pug: "পুগ্গলপঞ্ঞত্তিপাল়ি",
    mul7a05kat: "কথাৰত্থুপাল়ি",
    mul7a06yam01: "যমকপাল়ি-১",
    mul7a07yam02: "যমকপাল়ি-২",
    mul7a08yam03: "যমকপাল়ি-৩",
    mul7a09pat01:"পট্ঠানপাল়ি-১",
    mul7a10pat02: "পট্ঠানপাল়ি-২",
    mul7a11pat03: "পট্ঠানপাল়ি-৩",
    mul7a12pat04: "পট্ঠানপাল়ি-৪",
    mul7a13pat05: "পট্ঠানপাল়ি-৫"
}

//level3att
let vinatt = {
    att1v01par: "পারাজিককণ্ড-অট্ঠকথা",
    att1v02pac: "পাচিত্তিয-অট্ঠকথা",
    att1v03mah: "মহাৰগ্গ-অট্ঠকথা",
    att1v04cul: "চূল়ৰগ্গ-অট্ঠকথা",
    att1v05par: "পরিৰার-অট্ঠকথা"
}
let sutatt = {
    digatt: "দীঘনিকায-অট্ঠকথা",
    majatt: "মজ্ঝিমনিকায-অট্ঠকথা",
    samatt: "সংযুত্তনিকায-অট্ঠকথা",
    angatt: "অঙ্গুত্তরনিকায-অট্ঠকথা",
    khuatt: "খুদ্দকনিকায-অট্ঠকথা"
}
let abhatt = {
    att7a01dha: "ধম্মসঙ্গণি-অট্ঠকথা",
    att7a02vib: "সম্মোহৰিনোদনী-অট্ঠকথা",
    att7a03dha: "ধাতুকথা-অট্ঠকথা",
    att7a04pug: "পুগ্গলপঞ্ঞত্তি-অট্ঠকথা",
    att7a05kat: "কথাৰত্থু-অট্ঠকথা",
    att7a06yam: "যমকপ্পকরণ-অট্ঠকথা",
    att7a07pat: "পট্ঠানপ্পকরণ-অট্ঠকথা"
}

//level3tik
let vintik = {
    tik1v01sar01: "সারত্থদীপনী-টীকা-১",
    tik1v02sar02: "সারত্থদীপনী-টীকা-২",
    tik1v03sar03: "সারত্থদীপনী-টীকা-৩",
    tik1v04dve: "দ্বেমাতিকাপাল়ি",
    tik1v05kan: "কঙ্খাৰিতরণী-অট্ঠকথা",
    tik1v06vsa: "ৰিনযসঙ্গহ-অট্ঠকথা",
    tik1v07vaj: "ৰজিরবুদ্ধি-টীকা",
    tik1v08vim: "ৰিমতিৰিনোদনী-টীকা",
    tik1v09vlt: "ৰিনযালঙ্কার-টীকা",
    tik1v10kap: "কঙ্খাৰিতরণীপুরাণ-টীকা",
    tik1v11vuv: "ৰিনযৰিনিচ্ছয-উত্তরৰিনিচ্ছয",
    tik1v12vvt: "ৰিনযৰিনিচ্ছয-টীকা",
    tik1v13pdi: "পাচিত্যাদিযোজনাপাল়ি",
    tik1v14kmu: "খুদ্দসিক্খা-মূলসিক্খা"
}
let suttik = {
    digtik: "দীঘনিকায-টীকা",
    majtik: "মজ্ঝিমনিকায-টীকা",
    samtik: "সংযুত্তনিকায-টীকা",
    angtik: "অঙ্গুত্তরনিকায-টীকা",
    khutik: "খুদ্দকনিকায-টীকা"
}
let abhtik = {
    tik7a01dmt: "ধম্মসঙ্গণি-মূলটীকা",
    tik7a02vmt: "ৰিভঙ্গ-মূলটীকা",
    tik7a03pmt: "পঞ্চপকরণ-মূলটীকা",
    tik7a04dat: "ধম্মসঙ্গণী-অনুটীকা",
    tik7a05pat: "পঞ্চপকরণ-অনুটীকা",
    tik7a06anp: "অভিধম্মাৰতারো-নামরূপপরিচ্ছেদো",
    tik7a07asn: "অভিধম্মত্থসঙ্গহো",
    tik7a08apu: "অভিধম্মাৰতার-পুরাণটীকা",
    tik7a09ama: "অভিধম্মমাতিকাপাল়ি"
}

//level3ann
let vismag = {
    ann1v01vis01: "ৰিসুদ্ধিমগ্গ-১",
    ann1v02vis02: "ৰিসুদ্ধিমগ্গ-২",
    ann1v03vmt01: "ৰিসুদ্ধিমগ্গ-মহাটীকা-১",
    ann1v04vmt02: "ৰিসুদ্ধিমগ্গ-মহাটীকা-২",
    ann1v05vnk: "ৰিসুদ্ধিমগ্গ নিদানকথা"}
let sangpu = {
    ann2s01dig: "দীঘনিকায (পু-ৰি)",
    ann2s02maj: "মজ্ঝিমনিকায (পু-ৰি)",
    ann2s03san: "সংযুত্তনিকায (পু-ৰি)",
    ann2s04ang: "অঙ্গুত্তরনিকায (পু-ৰি)",
    ann2s05vin: "ৰিনযপিটক (পু-ৰি)",
    ann2s06abh: "অভিধম্মপিটক (পু-ৰি)",
    ann2s07att: "অট্ঠকথা (পু-ৰি)"}
let ledisa = {
    ann3l01nir: "নিরুত্তিদীপনী",
    ann3l02par: "পরমত্থদীপনী সঙ্গহমহাটীকাপাঠ",
    ann3l03anu: "অনুদীপনীপাঠ",
    ann3l04pat: "পট্ঠানুদ্দেস দীপনীপাঠ"}
let budvan = {
    ann4b01nam: "নমক্কারটীকা",
    ann4b02mah: "মহাপণামপাঠ",
    ann4b03lak: "লক্খণাতো বুদ্ধথোমনাগাথা",
    ann4b04sut: "সুতৰন্দনা",
    ann4b05kam: "কমলাঞ্জলি",
    ann4b06jin: "জিনালঙ্কার",
    ann4b07paj: "পজ্জমধু",
    ann4b08bud: "বুদ্ধগুণগাথাৰলী"}
let vangsa = {
    ann5b01cul: "চূল়গন্থৰংস",
    ann5b02mah: "মহাৰংস",
    ann5b03sas: "সাসনৰংস"}
let vyakrn = {
    ann6v01kac: "কচ্চাযনব্যাকরণং",
    ann6v02mog: "মোগ্গল্লানব্যাকরণং",
    ann6v03sad: "সদ্দনীতিপ্পকরণং",
    ann6v04pad: "পদরূপসিদ্ধি",
    ann6v05mpn: "মোগল্লানপঞ্চিকা",
    ann6v06pay: "পযোগসিদ্ধিপাঠ",
    ann6v07vut: "ৰুত্তোদযপাঠ",
    ann6v08adp: "অভিধানপ্পদীপিকাপাঠ",
    ann6v09adt: "অভিধানপ্পদীপিকাটীকা",
    ann6v10sup: "সুবোধালঙ্কারপাঠ",
    ann6v11sut: "সুবোধালঙ্কারটীকা",
    ann6v12val: "বালাৰতার গণ্ঠিপদত্থৰিনিচ্ছযসার"}
let nitiga = {
    ann7n01lok: "লোকনীতি",
    ann7n02sut: "সুত্তন্তনীতি",
    ann7n03sur: "সূরস্সতিনীতি",
    ann7n04mah: "মহারহনীতি",
    ann7n05dha: "ধম্মনীতি",
    ann7n06kav: "কৰিদপ্পণনীতি",
    ann7n07nit: "নীতিমঞ্জরী",
    ann7n08nar: "নরদক্খদীপনী",
    ann7n09cat: "চতুরারক্খদীপনী",
    ann7n10can: "চাণক্যনীতি"}
let pakinn = {
    ann8p01ras: "রসৰাহিনী",
    ann8p02sim: "সীমৰিসোধনীপাঠ",
    ann8p03ves: "ৰেস্সন্তরগীতি"}
let sihala = {
    ann9s01mog: "মোগ্গল্লান ৰুত্তিৰিৰরণপঞ্চিকা",
    ann9s02thu: "থূপৰংস",
    ann9s03dat: "দাঠাৰংস",
    ann9s04dha: "ধাতুপাঠৰিলাসিনিযা",
    ann9s05dht: "ধাতুৰংস",
    ann9s06hat: "হত্থৰনগল্লৰিহারৰংস",
    ann9s07jin: "জিনচরিতয",
    ann9s08jvd: "জিনৰংসদীপং",
    ann9s09tel: "তেলকটাহগাথা",
    ann9s10mil: "মিলিদটীকা",
    ann9s11pad: "পদমঞ্জরী",
    ann9s12psd: "পদসাধনং",
    ann9s13sad: "সদ্দবিন্দুপকরণং",
    ann9s14kdm: "কচ্চাযনধাতুমঞ্জুসা",
    ann9s15sam: "সামন্তকূটৰণ্ণনা"
}

//level4-mula
//vinaya mula books
let mul1v01par = {
    mul1v01par01: "ৰেরঞ্জকণ্ডং",
    mul1v01par02: "১. পারাজিককণ্ডং",
    mul1v01par03: "২. সঙ্ঘাদিসেসকণ্ডং",
    mul1v01par04: "৩. অনিযতকণ্ডং",
    mul1v01par05: "৪. নিস্সগ্গিযকণ্ডং"
}
let mul1v02pac = {
    mul1v02pac01: "৫. পাচিত্তিযকণ্ডং",
    mul1v02pac02: "৬. পাটিদেসনীযকণ্ডং",
    mul1v02pac03: "৭. সেখিযকণ্ডং",
    mul1v02pac04: "৮. অধিকরণসমথা",
    mul1v02pac05: "১. পারাজিককণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac06: "২. সঙ্ঘাদিসেসকণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac07: "৩. নিস্সগ্গিযকণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac08: "৪. পাচিত্তিযকণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac09: "৫. পাটিদেসনীযকণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac10: "৬. সেখিযকণ্ডং (ভিক্খুনীৰিভঙ্গো)",
    mul1v02pac11: "৭. অধিকরণসমথা (ভিক্খুনীৰিভঙ্গো)"
}
let mul1v03mah = {
    mul1v03mah01: "১. মহাখন্ধকো",
    mul1v03mah02: "২. উপোসথক্খন্ধকো",
    mul1v03mah03: "৩. ৰস্সূপনাযিকক্খন্ধকো",
    mul1v03mah04: "৪. পৰারণাক্খন্ধকো",
    mul1v03mah05: "৫. চম্মক্খন্ধকো",
    mul1v03mah06: "৬. ভেসজ্জক্খন্ধকো",
    mul1v03mah07: "৭. কথিনক্খন্ধকো",
    mul1v03mah08: "৮. চীৰরক্খন্ধকো",
    mul1v03mah09: "৯. চম্পেয্যক্খন্ধকো",
    mul1v03mah10: "১০. কোসম্বকক্খন্ধকো"
}
let mul1v04cul = {
    mul1v04cul01: "১. কম্মক্খন্ধকং",
    mul1v04cul02: "২. পারিৰাসিকক্খন্ধকং",
    mul1v04cul03: "৩. সমুচ্চযক্খন্ধকং",
    mul1v04cul04: "৪. সমথক্খন্ধকং",
    mul1v04cul05: "৫. খুদ্দকৰত্থুক্খন্ধকং",
    mul1v04cul06: "৬. সেনাসনক্খন্ধকং",
    mul1v04cul07: "৭. সঙ্ঘভেদকক্খন্ধকং",
    mul1v04cul08: "৮. ৰত্তক্খন্ধকং",
    mul1v04cul09: "৯. পাতিমোক্খট্ঠপনক্খন্ধকং",
    mul1v04cul10: "১০. ভিক্খুনিক্খন্ধকং",
    mul1v04cul11: "১১. পঞ্চসতিকক্খন্ধকং",
    mul1v04cul12: "১২. সত্তসতিকক্খন্ধকং"
}
let mul1v05par = {
    mul1v05par01: "সোল়সমহাৰারো",
    mul1v05par02: "সমুট্ঠানসীসসঙ্খেপো",
    mul1v05par03: "অন্তরপেয্যালং",
    mul1v05par04: "খন্ধকপুচ্ছাৰারো",
    mul1v05par05: "একুত্তরিকনযো",
    mul1v05par06: "উপোসথাদিপুচ্ছাৰিস্সজ্জনা",
    mul1v05par07: "গাথাসঙ্গণিকং",
    mul1v05par08: "অধিকরণভেদো",
    mul1v05par09: "অপরগাথাসঙ্গণিকং",
    mul1v05par10: "চোদনাকণ্ডং",
    mul1v05par11: "চূল়সঙ্গামো",
    mul1v05par12: "মহাসঙ্গামো",
    mul1v05par13: "কথিনভেদো",
    mul1v05par14: "উপালিপঞ্চকং",
    mul1v05par15: "অত্থাপত্তিসমুট্ঠানং",
    mul1v05par16: "দুতিযগাথাসঙ্গণিকং",
    mul1v05par17: "সেদমোচনগাথা",
    mul1v05par18: "পঞ্চৰগ্গো"
}

//sutta mula nikayas
let digmul= {
    mul2d01sil:"সীলক্খন্ধৰগ্গপাল়ি",
    mul2d02mah: "মহাৰগ্গপাল়ি",
    mul2d03pat: "পাথিকৰগ্গপাল়ি"
}
let majmul= {
    mul3m01mul: "মূলপণ্ণাসপাল়ি",
    mul3m02maj: "মজ্ঝিমপণ্ণাসপাল়ি",
    mul3m03upa: "উপরিপণ্ণাসপাল়ি"
}
let sammul= {
    mul4s01sag: "সগাথাৰগ্গপাল়ি",
    mul4s02nid: "নিদানৰগ্গপাল়ি",
    mul4s03kha: "খন্ধৰগ্গপাল়ি",
    mul4s04sal: "সল়াযতনৰগ্গপাল়ি",
    mul4s05mah: "মহাৰগ্গপাল়ি"
}
let angmul= {
    mul5a01eka: "এককনিপাতপাল়ি",
    mul5a02duk: "দুকনিপাতপাল়ি",
    mul5a03tik: "তিকনিপাতপাল়ি",
    mul5a04cat: "চতুক্কনিপাতপাল়ি",
    mul5a05pan: "পঞ্চকনিপাতপাল়ি",
    mul5a06cha: "ছক্কনিপাতপাল়ি",
    mul5a07sat: "সত্তকনিপাতপাল়ি",
    mul5a08att: "অট্ঠকাদিনিপাতপাল়ি",
    mul5a09nav: "নৰকনিপাতপাল়ি",
    mul5a10das: "দসকনিপাতপাল়ি",
    mul5a11eka: "একাদসকনিপাতপাল়ি"
}
let khumul= {
    mul6k01khu: "খুদ্দকপাঠপাল়ি",
    mul6k02dha: "ধম্মপদপাল়ি",
    mul6k03uda: "উদানপাল়ি",
    mul6k04iti: "ইতিৰুত্তকপাল়ি",
    mul6k05sut: "সুত্তনিপাতপাল়ি",
    mul6k06vim: "ৰিমানৰত্থুপাল়ি",
    mul6k07pet: "পেতৰত্থুপাল়ি",
    mul6k08the: "থেরগাথাপাল়ি",
    mul6k09the: "থেরীগাথাপাল়ি",
    mul6k10apa01: "অপদানপাল়ি-১",
    mul6k11apa02: "অপদানপাল়ি-২",
    mul6k12bud: "বুদ্ধৰংসপাল়ি",
    mul6k13car: "চরিযাপিটকপাল়ি",
    mul6k14jat01: "জাতকপাল়ি-১",
    mul6k15jat02: "জাতকপাল়ি-২",
    mul6k16mah: "মহানিদ্দেসপাল়ি",
    mul6k17cul: "চূল়নিদ্দেসপাল়ি",
    mul6k18pat: "পটিসম্ভিদামগ্গপাল়ি",
    mul6k19net: "নেত্তিপ্পকরণপাল়ি",
    mul6k20mil: "মিলিন্দপঞ্হপাল়ি",
    mul6k21pet: "পেটকোপদেসপাল়ি"
}

//abhidhamma mula books
let mul7a01dha ={
    mul7a01dha01: "মাতিকা",
    mul7a01dha02: "১. চিত্তুপ্পাদকণ্ডং",
    mul7a01dha03: "২. রূপকণ্ডং",
    mul7a01dha04: "৩. নিক্খেপকণ্ডং",
    mul7a01dha05: "৪. অট্ঠকথাকণ্ডং"
}
let mul7a02vib = {
    mul7a02vib01: "১. খন্ধৰিভঙ্গো",
    mul7a02vib02: "২. আযতনৰিভঙ্গো",
    mul7a02vib03: "৩. ধাতুৰিভঙ্গো",
    mul7a02vib04: "৪. সচ্চৰিভঙ্গো",
    mul7a02vib05: "৫. ইন্দ্রিযৰিভঙ্গো",
    mul7a02vib06: "৬. পটিচ্চসমুপ্পাদৰিভঙ্গো",
    mul7a02vib07: "৭. সতিপট্ঠানৰিভঙ্গো",
    mul7a02vib08: "৮. সম্মপ্পধানৰিভঙ্গো",
    mul7a02vib09: "৯. ইদ্ধিপাদৰিভঙ্গো",
    mul7a02vib10: "১০. বোজ্ঝঙ্গৰিভঙ্গো",
    mul7a02vib11: "১১. মগ্গঙ্গৰিভঙ্গো",
    mul7a02vib12: "১২. ঝানৰিভঙ্গো",
    mul7a02vib13: "১৩. অপ্পমঞ্ঞাৰিভঙ্গো",
    mul7a02vib14: "১৪. সিক্খাপদৰিভঙ্গো",
    mul7a02vib15: "১৫. পটিসম্ভিদাৰিভঙ্গো",
    mul7a02vib16: "১৬. ঞাণৰিভঙ্গো",
    mul7a02vib17: "১৭. খুদ্দকৰত্থুৰিভঙ্গো",
    mul7a02vib18: "১৮. ধম্মহদযৰিভঙ্গো"
}
let mul7a03dha = {
    mul7a03dha01: "উদ্দেসো",
    mul7a03dha02: "১. পঠমনযো",
    mul7a03dha03: "২. দুতিযনযো",
    mul7a03dha04: "৩. ততিযনযো",
    mul7a03dha05: "৪. চতুত্থনযো",
    mul7a03dha06: "৫. পঞ্চমনযো",
    mul7a03dha07: "৬. ছট্ঠনযো",
    mul7a03dha08: "৭. সত্তমনযো",
    mul7a03dha09: "৮. অট্ঠমনযো",
    mul7a03dha10: "৯. নৰমনযো",
    mul7a03dha11: "১০. দসমনযো",
    mul7a03dha12: "১১. একাদসমনযো",
    mul7a03dha13: "১২. দ্বাদসমনযো",
    mul7a03dha14: "১৩. তেরসমনযো",
    mul7a03dha15: "১৪. চুদ্দসমনযো"
}
let mul7a04pug = {
    mul7a04pug01: "মাতিকা",
    mul7a04pug02: "নিদ্দেসো"
}
let mul7a05kat = {
    mul7a05kat01: "১. পুগ্গলকথা",
    mul7a05kat02: "২. পরিহানিকথা",
    mul7a05kat03: "৩. ব্রহ্মচরিযকথা",
    mul7a05kat04: "৪. জহতিকথা",
    mul7a05kat05: "৫. সব্বমত্থীতিকথা",
    mul7a05kat06: "৬. অতীতক্খন্ধাদিকথা",
    mul7a05kat07: "৭. একচ্চং অত্থীতিকথা",
    mul7a05kat08: "৮. সতিপট্ঠানকথা",
    mul7a05kat09: "৯. হেৰত্থিকথা",
    mul7a05kat10: "২. দুতিযৰগ্গো",
    mul7a05kat11: "৩. ততিযৰগ্গো",
    mul7a05kat12: "৪. চতুত্থৰগ্গো",
    mul7a05kat13: "৫. পঞ্চমৰগ্গো",
    mul7a05kat14: "৬. ছট্ঠৰগ্গো",
    mul7a05kat15: "৭. সত্তমৰগ্গো",
    mul7a05kat16: "৮. অট্ঠমৰগ্গো",
    mul7a05kat17: "৯. নৰমৰগ্গো",
    mul7a05kat18: "১০. দসমৰগ্গো",
    mul7a05kat19: "১১. একাদসমৰগ্গো",
    mul7a05kat20: "১২. দ্বাদসমৰগ্গো",
    mul7a05kat21: "১৩. তেরসমৰগ্গো",
    mul7a05kat22: "১৪. চুদ্দসমৰগ্গো",
    mul7a05kat23: "১৫. পন্নরসমৰগ্গো",
    mul7a05kat24: "১৬. সোল়সমৰগ্গো",
    mul7a05kat25: "১৭. সত্তরসমৰগ্গো",
    mul7a05kat26: "১৮. অট্ঠারসমৰগ্গো",
    mul7a05kat27: "১৯. একূনৰীসতিমৰগ্গো",
    mul7a05kat28: "২০. ৰীসতিমৰগ্গো",
    mul7a05kat29: "২১. একৰীসতিমৰগ্গো",
    mul7a05kat30: "২২. বাৰীসতিমৰগ্গো",
    mul7a05kat31: "২৩. তেৰীসতিমৰগ্গো"
}
let mul7a06yam01 = {
    mul7a06yam0101: "১. মূলযমকং",
    mul7a06yam0102: "২. খন্ধযমকং",
    mul7a06yam0103: "৩. আযতনযমকং",
    mul7a06yam0104: "৪. ধাতুযমকং",
    mul7a06yam0105: "৫. সচ্চযমকং"
}
let mul7a07yam02 = {
    mul7a07yam0201: "৬. সঙ্খারযমকং",
    mul7a07yam0202: "৭. অনুসযযমকং",
    mul7a07yam0203: "৮. চিত্তযমকং"
}
let mul7a08yam03 = {
    mul7a08yam0301: "৯. ধম্মযমকং",
    mul7a08yam0302: "১০. ইন্দ্রিযযমকং"
}
let mul7a09pat01 = {
    mul7a09pat0101: "(১) পচ্চযুদ্দেসো",
    mul7a09pat0102: "(২) পচ্চযনিদ্দেসো",
    mul7a09pat0103: "৩. পুচ্ছাৰারো",
    mul7a09pat0104: "১. কুসলত্তিকং",
    mul7a09pat0105: "২. ৰেদনাত্তিকং",
    mul7a09pat0106: "৩. ৰিপাকত্তিকং",
    mul7a09pat0107: "৪. উপাদিন্নত্তিকং",
    mul7a09pat0108: "৫. সংকিলিট্ঠত্তিকং"
}
let mul7a10pat02 = {
    mul7a10pat0201: "৬. ৰিতক্কত্তিকং",
    mul7a10pat0202: "৭. পীতিত্তিকং",
    mul7a10pat0203: "৮. দস্সনেনপহাতব্বত্তিকং",
    mul7a10pat0204: "৯. দস্সনেনপহাতব্বহেতুকত্তিকং",
    mul7a10pat0205: "১০. আচযগামিত্তিকং",
    mul7a10pat0206: "১১. সেক্খত্তিকং",
    mul7a10pat0207: "১২. পরিত্তত্তিকং",
    mul7a10pat0208: "১৩. পরিত্তারম্মণত্তিকং",
    mul7a10pat0209: "১৪. হীনত্তিকং",
    mul7a10pat0210: "১৫. মিচ্ছত্তনিযতত্তিকং",
    mul7a10pat0211: "১৬. মগ্গারম্মণত্তিকং",
    mul7a10pat0212: "১৭. উপ্পন্নত্তিকং",
    mul7a10pat0213: "১৮. অতীতত্তিকং",
    mul7a10pat0214: "১৯. অতীতারম্মণত্তিকং",
    mul7a10pat0215: "২০. অজ্ঝত্তত্তিকং",
    mul7a10pat0216: "২১. অজ্ঝত্তারম্মণত্তিকং",
    mul7a10pat0217: "২২. সনিদস্সনসপ্পটিঘত্তিকং"
}
let mul7a11pat03 = {
    mul7a11pat0301: "১. হেতুগোচ্ছকং",
    mul7a11pat0302: "২. চূল়ন্তরদুকং",
    mul7a11pat0303: "৩. আসৰগোচ্ছকং",
    mul7a11pat0304: "৪. সঞ্ঞোজনগোচ্ছকং",
    mul7a11pat0305: "৫. গন্থগোচ্ছকং",
    mul7a11pat0306: "৬-৭. ওঘযোগগোচ্ছকং",
    mul7a11pat0307: "৮. নীৰরণগোচ্ছকং",
    mul7a11pat0308: "৯. পরামাসগোচ্ছকং",
    mul7a11pat0309: "১০. মহন্তরদুকং",
    mul7a11pat0310: "১১. উপাদানগোচ্ছকং"
}
let mul7a12pat04 = {
    mul7a12pat0401: "১২. কিলেসগোচ্ছকং",
    mul7a12pat0402: "১-১ হেতুদুক-কুসলত্তিকং",
    mul7a12pat0403: "২-১. সহেতুকদুক-কুসলত্তিকং",
    mul7a12pat0404: "৭-১. সপ্পচ্চযদুক-কুসলত্তিকং",
    mul7a12pat0405: "১৪-১. আসৰদুক-কুসলত্তিকং",
    mul7a12pat0406: "২০-১. সঞ্ঞোজনদুক-কুসলত্তিকং",
    mul7a12pat0407: "২৬-১. গন্থদুক-কুসলত্তিকং",
    mul7a12pat0408: "৪৪-১. নীৰরণদুক-কুসলত্তিকং",
    mul7a12pat0409: "৫০-১. পরামাসদুক-কুসলত্তিকং",
    mul7a12pat0410: "৫৫-১. সারম্মণদুক-কুসলত্তিকং",
    mul7a12pat0411: "৬৯-১. উপাদানদুক-কুসলত্তিকং",
    mul7a12pat0412: "৭৫-১. কিলেসদুক-কুসলত্তিকং",
    mul7a12pat0413: "৮৩-১. দস্সনেনপহাতব্বদুক-কুসলত্তিকং",
    mul7a12pat0414: "১০০-২. সরণদুক-ৰেদনাত্তিকং",
    mul7a12pat0415: "১-১. কুসলত্তিক-হেতুদুকং",
    mul7a12pat0416: "১-৭. কুসলত্তিক-সপ্পচ্চযদুকং",
    mul7a12pat0417: "১-১৪. কুসলত্তিক-আসৰদুকং",
    mul7a12pat0418: "১-৫৫. কুসলত্তিক-সারম্মণদুকং",
    mul7a12pat0419: "১-৭৫. কুসলত্তিক-কিলেসদুকং",
    mul7a12pat0420: "১-৮৩. কুসলত্তিক-দস্সনেনপহাতব্বদুকং",
    mul7a12pat0421: "১-৯৯. কুসলত্তিক-সউত্তরদুকং"
}
let mul7a13pat05 = {
    mul7a13pat0501: "ধম্মানুলোমে তিকতিকপট্ঠানং",
    mul7a13pat0502: "ধম্মানুলোমে দুকদুকপট্ঠানং",
    mul7a13pat0503: "ধম্মপচ্চনীযে তিকপট্ঠানং",
    mul7a13pat0504: "ধম্মপচ্চনীযে দুকপট্ঠানং",
    mul7a13pat0505: "ধম্মপচ্চনীযে দুকতিকপট্ঠানং",
    mul7a13pat0506: "ধম্মপচ্চনীযে তিকদুকপট্ঠানং",
    mul7a13pat0507: "ধম্মপচ্চনীযে তিকতিকপট্ঠানং",
    mul7a13pat0508: "ধম্মপচ্চনীযে দুকদুকপট্ঠানং",
    mul7a13pat0509: "ধম্মানুলোমপচ্চনীযে তিকপট্ঠানং",
    mul7a13pat0510: "ধম্মানুলোমপচ্চনীযে দুকপট্ঠানং",
    mul7a13pat0511: "ধম্মানুলোমপচ্চনীযে দুকতিকপট্ঠানং",
    mul7a13pat0512: "ধম্মানুলোমপচ্চনীযে তিকদুকপট্ঠানং",
    mul7a13pat0513: "ধম্মানুলোমপচ্চনীযে তিকতিকপট্ঠানং",
    mul7a13pat0514: "ধম্মানুলোমপচ্চনীযে দুকদুকপট্ঠানং",
    mul7a13pat0515: "ধম্মপচ্চনীযানুলোমে তিকপট্ঠানং",
    mul7a13pat0516: "ধম্মপচ্চনীযানুলোমে দুকপট্ঠানং",
    mul7a13pat0517: "ধম্মপচ্চনীযানুলোমে দুকতিকপট্ঠানং",
    mul7a13pat0518: "ধম্মপচ্চনীযানুলোমে তিকদুকপট্ঠানং",
    mul7a13pat0519: "ধম্মপচ্চনীযানুলোমে তিকতিকপট্ঠানং",
    mul7a13pat0520: "ধম্মপচ্চনীযানুলোমে দুকদুকপট্ঠানং"
}

//level4-atthakatha
//vinaya atthakatha books
let att1v01par = {
    att1v01par01: "গন্থারম্ভকথা",
    att1v01par02: "ৰেরঞ্জকণ্ডৰণ্ণনা",
    att1v01par03: "১. পারাজিককণ্ডং",
    att1v01par04: "২. সঙ্ঘাদিসেসকণ্ডং",
    att1v01par05: "৩. অনিযতকণ্ডং",
    att1v01par06: "৪. নিস্সগ্গিযকণ্ডং"
}
let att1v02pac = {
    att1v02pac01: "৫. পাচিত্তিযকণ্ডং",
    att1v02pac02: "৬. পাটিদেসনীযকণ্ডং",
    att1v02pac03: "৭. সেখিযকণ্ডং",
    att1v02pac04: "৮. সত্তাধিকরণসমথা",
    att1v02pac05: "১. পারাজিককণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    att1v02pac06: "২. সঙ্ঘাদিসেসকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    att1v02pac07: "৩. নিস্সগ্গিযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    att1v02pac08: "৪. পাচিত্তিযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    att1v02pac09: "৫. পাটিদেসনীযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)"
}
let att1v03mah = {
    att1v03mah01: "১. মহাখন্ধকং",
    att1v03mah02: "২. উপোসথক্খন্ধকং",
    att1v03mah03: "৩. ৰস্সূপনাযিকক্খন্ধকং",
    att1v03mah04: "৪. পৰারণাক্খন্ধকং",
    att1v03mah05: "৫. চম্মক্খন্ধকং",
    att1v03mah06: "৬. ভেসজ্জক্খন্ধকং",
    att1v03mah07: "৭. কথিনক্খন্ধকং",
    att1v03mah08: "৮. চীৰরক্খন্ধকং",
    att1v03mah09: "৯. চম্পেয্যক্খন্ধকং",
    att1v03mah10: "১০. কোসম্বকক্খন্ধকং"
}
let att1v04cul = {
    att1v04cul01: "১. কম্মক্খন্ধকং",
    att1v04cul02: "২. পারিৰাসিকক্খন্ধকং",
    att1v04cul03: "৩. সমুচ্চযক্খন্ধকং",
    att1v04cul04: "৪. সমথক্খন্ধকং",
    att1v04cul05: "৫. খুদ্দকৰত্থুক্খন্ধকং",
    att1v04cul06: "৬. সেনাসনক্খন্ধকং",
    att1v04cul07: "৭. সঙ্ঘভেদকক্খন্ধকং",
    att1v04cul08: "৮. ৰত্তক্খন্ধকং",
    att1v04cul09: "৯. পাতিমোক্খট্ঠপনক্খন্ধকং",
    att1v04cul10: "১০. ভিক্খুনিক্খন্ধকং",
    att1v04cul11: "১১. পঞ্চসতিকক্খন্ধকং",
    att1v04cul12: "১২. সত্তসতিকক্খন্ধকং"
}
let att1v05par = {
    att1v05par01: "সোল়সমহাৰারো",
    att1v05par02: "সমুট্ঠানসীসৰণ্ণনা",
    att1v05par03: "অন্তরপেয্যালং",
    att1v05par04: "খন্ধকপুচ্ছাৰারো",
    att1v05par05: "একুত্তরিকনযো",
    att1v05par06: "উপোসথাদিপুচ্ছাৰিস্সজ্জনা",
    att1v05par07: "পঠমগাথাসঙ্গণিকং",
    att1v05par08: "অধিকরণভেদং",
    att1v05par09: "দুতিযগাথাসঙ্গণিকং",
    att1v05par10: "চোদনাকণ্ডং",
    att1v05par11: "চূল়সঙ্গামো",
    att1v05par12: "মহাসঙ্গামো",
    att1v05par13: "কথিনভেদং",
    att1v05par14: "উপালিপঞ্চকং",
    att1v05par15: "আপত্তিসমুট্ঠানৰণ্ণনা",
    att1v05par16: "অপরদুতিযগাথাসঙ্গণিকং",
    att1v05par17: "সেদমোচনগাথা",
    att1v05par18: "পঞ্চৰগ্গো"
}

//sutta atthakatha nikayas
let digatt = {
    att2d01sil:"সীলক্খন্ধৰগ্গ-অট্ঠকথা",
    att2d02mah: "মহাৰগ্গ-অট্ঠকথা",
    att2d03pat: "পাথিকৰগ্গ-অট্ঠকথা"
}
let majatt = {
    att3m01mul: "মূলপণ্ণাস-অট্ঠকথা",
    att3m02maj: "মজ্ঝিমপণ্ণাস-অট্ঠকথা",
    att3m03upa: "উপরিপণ্ণাস-অট্ঠকথা"
}
let samatt = {
    att4s01sag: "সগাথাৰগ্গ-অট্ঠকথা",
    att4s02nid: "নিদানৰগ্গ-অট্ঠকথা",
    att4s03kha: "খন্ধৰগ্গ-অট্ঠকথা",
    att4s04sal: "সল়াযতনৰগ্গ-অট্ঠকথা",
    att4s05mah: "মহাৰগ্গ-অট্ঠকথা"
}
let angatt = {
    att5a01eka: "এককনিপাত-অট্ঠকথা",
    att5a02duk: "দুকনিপাত-অট্ঠকথা",
    att5a03tik: "তিকনিপাত-অট্ঠকথা",
    att5a04cat: "চতুক্কনিপাত-অট্ঠকথা",
    att5a05pan: "পঞ্চকনিপাত-অট্ঠকথা",
    att5a06cha: "ছক্কনিপাত-অট্ঠকথা",
    att5a07sat: "সত্তকনিপাত-অট্ঠকথা",
    att5a08att: "অট্ঠকনিপাত-অট্ঠকথা",
    att5a09nav: "নৰকনিপাত-অট্ঠকথা",
    att5a10das: "দসকনিপাত-অট্ঠকথা",
    att5a11eka: "একাদসকনিপাত-অট্ঠকথা"
}
let khuatt = {
    att6k01khu: "খুদ্দকপাঠ-অট্ঠকথা",
    att6k02dha: "ধম্মপদ-অট্ঠকথা",
    att6k03uda: "উদান-অট্ঠকথা",
    att6k04iti: "ইতিৰুত্তক-অট্ঠকথা",
    att6k05sut: "সুত্তনিপাত-অট্ঠকথা",
    att6k06vim: "ৰিমানৰত্থু-অট্ঠকথা",
    att6k07pet: "পেতৰত্থু-অট্ঠকথা",
    att6k08the: "থেরগাথা-অট্ঠকথা",
    att6k09the: "থেরীগাথা-অট্ঠকথা",
    att6k10apa: "অপদান-অট্ঠকথা",
    att6k11bud: "বুদ্ধৰংস-অট্ঠকথা",
    att6k12car: "চরিযাপিটক-অট্ঠকথা",
    att6k13jat01: "জাতক-অট্ঠকথা-১",
    att6k14jat02: "জাতক-অট্ঠকথা-২",
    att6k15jat03: "জাতক-অট্ঠকথা-৩",
    att6k16jat04: "জাতক-অট্ঠকথা-৪",
    att6k17jat05: "জাতক-অট্ঠকথা-৫",
    att6k18jat06: "জাতক-অট্ঠকথা-৬",
    att6k19jat07: "জাতক-অট্ঠকথা-৭",
    att6k20mah: "মহানিদ্দেস-অট্ঠকথা",
    att6k21cul: "চূল়নিদ্দেস-অট্ঠকথা",
    att6k22pat: "পটিসম্ভিদামগ্গ-অট্ঠকথা",
    att6k23net: "নেত্তিপ্পকরণ-অট্ঠকথা"
}
    
//abhidhamma atthakatha books
let att7a01dha = {
    att7a01dha01: "গন্থারম্ভকথা",
    att7a01dha02: "১. চিত্তুপ্পাদকণ্ডো",
    att7a01dha03: "তিকমাতিকাপদৰণ্ণনা",
    att7a01dha04: "দুকমাতিকাপদৰণ্ণনা",
    att7a01dha05: "কামাৰচরকুসলপদভাজনীযং",
    att7a01dha06: "২. রূপকণ্ডো",
    att7a01dha07: "৩. নিক্খেপকণ্ডো",
    att7a01dha08: "৪. অট্ঠকথাকণ্ডো"
}
let att7a02vib = {
    att7a02vib01: "১. খন্ধৰিভঙ্গো",
    att7a02vib02: "২. আযতনৰিভঙ্গো",
    att7a02vib03: "৩. ধাতুৰিভঙ্গো",
    att7a02vib04: "৪. সচ্চৰিভঙ্গো",
    att7a02vib05: "৫. ইন্দ্রিযৰিভঙ্গো",
    att7a02vib06: "৬. পটিচ্চসমুপ্পাদৰিভঙ্গো",
    att7a02vib07: "৭. সতিপট্ঠানৰিভঙ্গো",
    att7a02vib08: "৮. সম্মপ্পধানৰিভঙ্গো",
    att7a02vib09: "৯. ইদ্ধিপাদৰিভঙ্গো",
    att7a02vib10: "১০. বোজ্ঝঙ্গৰিভঙ্গো",
    att7a02vib11: "১১. মগ্গঙ্গৰিভঙ্গো",
    att7a02vib12: "১২. ঝানৰিভঙ্গো",
    att7a02vib13: "১৩. অপ্পমঞ্ঞাৰিভঙ্গো",
    att7a02vib14: "১৪. সিক্খাপদৰিভঙ্গো",
    att7a02vib15: "১৫. পটিসম্ভিদাৰিভঙ্গো",
    att7a02vib16: "১৬. ঞাণৰিভঙ্গো",
    att7a02vib17: "১৭. খুদ্দকৰত্থুৰিভঙ্গো",
    att7a02vib18: "১৮. ধম্মহদযৰিভঙ্গো"
}
let att7a03dha = {
    att7a03dha01: "ধাতুকথা-অট্ঠকথা",
    att7a03dha02: "১. মাতিকাৰণ্ণনা",
    att7a03dha03: "২. নিদ্দেসৰণ্ণনা"
}
let att7a04pug = {
    att7a04pug01: "পুগ্গলপঞ্ঞত্তি-অট্ঠকথা",
    att7a04pug02: "১. মাতিকাৰণ্ণনা",
    att7a04pug03: "২. নিদ্দেসৰণ্ণনা"
}
let att7a05kat = {
    att7a05kat01: "কথাৰত্থু-অট্ঠকথা",
    att7a05kat02: "নিদানকথা",
    att7a05kat03: "১. পুগ্গলকথা",
    att7a05kat04: "২. পরিহানিকথা",
    att7a05kat05: "৩. ব্রহ্মচরিযকথা",
    att7a05kat06: "৪. জহতিকথা",
    att7a05kat07: "৫. সব্বমত্থীতিকথা",
    att7a05kat08: "৬. অতীতক্খন্ধাদিকথা",
    att7a05kat09: "৭. একচ্চংঅত্থীতিকথা",
    att7a05kat10: "৮. সতিপট্ঠানকথাৰণ্ণনা",
    att7a05kat11: "৯. হেৰত্থিকথাৰণ্ণনা",
    att7a05kat12: "২. দুতিযৰগ্গো",
    att7a05kat13: "৩. ততিযৰগ্গো",
    att7a05kat14: "৪. চতুত্থৰগ্গো",
    att7a05kat15: "৫. পঞ্চমৰগ্গো",
    att7a05kat16: "৬. ছট্ঠৰগ্গো",
    att7a05kat17: "৭. সত্তমৰগ্গো",
    att7a05kat18: "৮. অট্ঠমৰগ্গো",
    att7a05kat19: "৯. নৰমৰগ্গো",
    att7a05kat20: "১০. দসমৰগ্গো",
    att7a05kat21: "১১. একাদসমৰগ্গো",
    att7a05kat22: "১২. দ্বাদসমৰগ্গো",
    att7a05kat23: "১৩. তেরসমৰগ্গো",
    att7a05kat24: "১৪. চুদ্দসমৰগ্গো",
    att7a05kat25: "১৫. পন্নরসমৰগ্গো",
    att7a05kat26: "১৬. সোল়সমৰগ্গো",
    att7a05kat27: "১৭. সত্তরসমৰগ্গো",
    att7a05kat28: "১৮. অট্ঠারসমৰগ্গো",
    att7a05kat29: "১৯. একূনৰীসতিমৰগ্গো",
    att7a05kat30: "২০. ৰীসতিমৰগ্গো",
    att7a05kat31: "২১. একৰীসতিমৰগ্গো",
    att7a05kat32: "২২. বাৰীসতিমৰগ্গো",
    att7a05kat33: "২৩. তেৰীসতিমৰগ্গো"
}
let att7a06yam = {
    att7a06yam01: "যমকপ্পকরণ-অট্ঠকথা",
    att7a06yam02: "১. মূলযমকং",
    att7a06yam03: "২. খন্ধযমকং",
    att7a06yam04: "৩. আযতনযমকং",
    att7a06yam05: "৪. ধাতুযমকং",
    att7a06yam06: "৫. সচ্চযমকং",
    att7a06yam07: "৬. সঙ্খারযমকং",
    att7a06yam08: "৭. অনুসযযমকং",
    att7a06yam09: "৮. চিত্তযমকং",
    att7a06yam10: "৯. ধম্মযমকং",
    att7a06yam11: "১০. ইন্দ্রিযযমকং"
}
let att7a07pat = {
    att7a07pat01: "পট্ঠানপ্পকরণ-অট্ঠকথা",
    att7a07pat02: "পচ্চযুদ্দেসৰণ্ণনা",
    att7a07pat03: "পচ্চযনিদ্দেসো",
    att7a07pat04: "১. কুসলত্তিকৰণ্ণনা",
    att7a07pat05: "২. ৰেদনাত্তিকৰণ্ণনা",
    att7a07pat06: "৩. ৰিপাকত্তিকৰণ্ণনা",
    att7a07pat07: "৪. উপাদিন্নত্তিকৰণ্ণনা",
    att7a07pat08: "৫-২২. সঙ্কিলিট্ঠত্তিকাদিৰণ্ণনা",
    att7a07pat09: "২. দুকপট্ঠানৰণ্ণনা",
    att7a07pat10: "৩. দুকতিকপট্ঠানৰণ্ণনা",
    att7a07pat11: "৪. তিকদুকপট্ঠানৰণ্ণনা",
    att7a07pat12: "৫. তিকতিকপট্ঠানৰণ্ণনা",
    att7a07pat13: "৬. দুকদুকপট্ঠানৰণ্ণনা",
    att7a07pat14: "৭-১২. পচ্চনীযপট্ঠানৰণ্ণনা",
    att7a07pat15: "১৩-১৮. অনুলোমপচ্চনীযপট্ঠানৰণ্ণনা",
    att7a07pat16: "১৯-২৪. পচ্চনীযানুলোমপট্ঠানৰণ্ণনা"
}

//level4-tika
//vinaya tika books
let tik1v01sar01 = {
    tik1v01sar0101: "গন্থারম্ভকথা",
    tik1v01sar0102: "ৰেরঞ্জকণ্ডৰণ্ণনা"
}
let tik1v02sar02 = {
    tik1v02sar0201: "১. পারাজিককণ্ডং",
    tik1v02sar0202: "২. সঙ্ঘাদিসেসকণ্ডং",
    tik1v02sar0203: "৩. অনিযতকণ্ডং",
    tik1v02sar0204: "৪. নিস্সগ্গিযকণ্ডং"
}
let tik1v03sar03 = {
    tik1v03sar0301: "৫. পাচিত্তিযকণ্ডং",
    tik1v03sar0302: "৬. পাটিদেসনীযকণ্ডং",
    tik1v03sar0303: "৭. সেখিযকণ্ডং",
    tik1v03sar0304: "১. পারাজিককণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    tik1v03sar0305: "২. সঙ্ঘাদিসেসকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    tik1v03sar0306: "৩. নিস্সগ্গিযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    tik1v03sar0307: "৪. পাচিত্তিযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    tik1v03sar0308: "৫. পাটিদেসনীযকণ্ডং (ভিক্খুনীৰিভঙ্গৰণ্ণনা)",
    tik1v03sar0309: "মহাৰগ্গ-টীকা",
    tik1v03sar0310: "১. মহাখন্ধকং",
    tik1v03sar0311: "২. উপোসথক্খন্ধকং",
    tik1v03sar0312: "৩. ৰস্সূপনাযিকক্খন্ধকং",
    tik1v03sar0313: "৪. পৰারণাক্খন্ধকং",
    tik1v03sar0314: "৫. চম্মক্খন্ধকং",
    tik1v03sar0315: "৬. ভেসজ্জক্খন্ধকং",
    tik1v03sar0316: "৭. কথিনক্খন্ধকং",
    tik1v03sar0317: "৮. চীৰরক্খন্ধকং",
    tik1v03sar0318: "৯. চম্পেয্যক্খন্ধকং",
    tik1v03sar0319: "১০. কোসম্বকক্খন্ধকং",
    tik1v03sar0320: "চূল়ৰগ্গ-টীকা",
    tik1v03sar0321: "১. কম্মক্খন্ধকং",
    tik1v03sar0322: "২. পারিৰাসিকক্খন্ধকং",
    tik1v03sar0323: "৩. সমুচ্চযক্খন্ধকং",
    tik1v03sar0324: "৪. সমথক্খন্ধকং",
    tik1v03sar0325: "৫. খুদ্দকৰত্থুক্খন্ধকং",
    tik1v03sar0326: "৬. সেনাসনক্খন্ধকং",
    tik1v03sar0327: "৭. সঙ্ঘভেদকক্খন্ধকং",
    tik1v03sar0328: "৮. ৰত্তক্খন্ধকং",
    tik1v03sar0329: "৯. পাতিমোক্খট্ঠপনক্খন্ধকং",
    tik1v03sar0330: "১০. ভিক্খুনিক্খন্ধকং",
    tik1v03sar0331: "১১. পঞ্চসতিকক্খন্ধকং",
    tik1v03sar0332: "১২. সত্তসতিকক্খন্ধকং",
    tik1v03sar0333: "পরিৰার-টীকা",
    tik1v03sar0334: "সোল়সমহাৰারো",
    tik1v03sar0335: "সমুট্ঠানসীসৰণ্ণনা",
    tik1v03sar0336: "অন্তরপেয্যালং",
    tik1v03sar0337: "একুত্তরিকনযো",
    tik1v03sar0338: "উপোসথাদিপুচ্ছাৰিস্সজ্জনাৰণ্ণনা",
    tik1v03sar0339: "পঠমগাথাসঙ্গণিকং",
    tik1v03sar0340: "অধিকরণভেদৰণ্ণনা",
    tik1v03sar0341: "দুতিযগাথাসঙ্গণিকৰণ্ণনা",
    tik1v03sar0342: "সঙ্গামদ্বযৰণ্ণনা",
    tik1v03sar0343: "কথিনভেদৰণ্ণনা",
    tik1v03sar0344: "উপালিপঞ্চকৰণ্ণনা",
    tik1v03sar0345: "সমুট্ঠানৰণ্ণনা",
    tik1v03sar0346: "অপরদুতিযগাথাসঙ্গণিকং",
    tik1v03sar0347: "সেদমোচনগাথা",
    tik1v03sar0348: "পঞ্চৰগ্গো"
}
let tik1v04dve = {
    tik1v04dve01: "ভিক্খুপাতিমোক্খপাল়ি",
    tik1v04dve02: "ভিক্খুনীপাতিমোক্খপাল়ি"
}
let tik1v05kan = {
    tik1v05kan01: "কঙ্খাৰিতরণী-অট্ঠকথা",
    tik1v05kan02: "নিদানৰণ্ণনা",
    tik1v05kan03: "পারাজিককণ্ডো",
    tik1v05kan04: "সঙ্ঘাদিসেসকণ্ডো",
    tik1v05kan05: "অনিযতকণ্ডো",
    tik1v05kan06: "নিস্সগ্গিযকণ্ডো",
    tik1v05kan07: "পাচিত্তিযকণ্ডো",
    tik1v05kan08: "পাটিদেসনীযকণ্ডো",
    tik1v05kan09: "সেখিযকণ্ডো",
    tik1v05kan10: "ভিক্খুনীপাতিমোক্খৰণ্ণনা",
    tik1v05kan11: "পারাজিককণ্ডো",
    tik1v05kan12: "সঙ্ঘাদিসেসকণ্ডো",
    tik1v05kan13: "নিস্সগ্গিযকণ্ডো",
    tik1v05kan14: "পাচিত্তিযকণ্ডো",
    tik1v05kan15: "পাটিদেসনীযকণ্ডো"
}
let tik1v06vsa = {
    tik1v06vsa01: "গন্থারম্ভকথা",
    tik1v06vsa02: "১. দিৰাসেয্যৰিনিচ্ছযকথা",
    tik1v06vsa03: "২. পরিক্খারৰিনিচ্ছযকথা",
    tik1v06vsa04: "৩. ভেসজ্জাদিকরণৰিনিচ্ছযকথা",
    tik1v06vsa05: "৪. ৰিঞ্ঞত্তিৰিনিচ্ছযকথা",
    tik1v06vsa06: "৫. কুলসঙ্গহৰিনিচ্ছযকথা",
    tik1v06vsa07: "৬. মচ্ছমংসৰিনিচ্ছযকথা",
    tik1v06vsa08: "৭. অনামাসৰিনিচ্ছযকথা",
    tik1v06vsa09: "৮. অধিট্ঠানৰিকপ্পনৰিনিচ্ছযকথা",
    tik1v06vsa10: "৯. চীৰরৰিপ্পৰাসৰিনিচ্ছযকথা",
    tik1v06vsa11: "১০. ভণ্ডপটিসামনৰিনিচ্ছযকথা",
    tik1v06vsa12: "১১. কযৰিক্কযসমাপত্তিৰিনিচ্ছযকথা",
    tik1v06vsa13: "১২. রূপিযাদিপটিগ্গহণৰিনিচ্ছযকথা",
    tik1v06vsa14: "১৩. দানলক্খণাদিৰিনিচ্ছযকথা",
    tik1v06vsa15: "১৪. পথৰীখণনৰিনিচ্ছযকথা",
    tik1v06vsa16: "১৫. ভূতগামৰিনিচ্ছযকথা",
    tik1v06vsa17: "১৬. সহসেয্যৰিনিচ্ছযকথা",
    tik1v06vsa18: "১৭. পটিপজ্জিতব্বৰিনিচ্ছযকথা",
    tik1v06vsa19: "১৮. কালিকৰিনিচ্ছযকথা",
    tik1v06vsa20: "১৯. কপ্পিযভূমিৰিনিচ্ছযকথা",
    tik1v06vsa21: "২০. পটিগ্গহণৰিনিচ্ছযকথা",
    tik1v06vsa22: "২১. পৰারণাৰিনিচ্ছযকথা",
    tik1v06vsa23: "২২. পব্বজ্জাৰিনিচ্ছযকথা",
    tik1v06vsa24: "২৩. নিস্সযৰিনিচ্ছযকথা",
    tik1v06vsa25: "২৪. সীমাৰিনিচ্ছযকথা",
    tik1v06vsa26: "২৫. উপোসথপৰারণাৰিনিচ্ছযকথা",
    tik1v06vsa27: "২৬. ৰস্সূপনাযিকৰিনিচ্ছযকথা",
    tik1v06vsa28: "২৭. উপজ্ঝাযাদিৰত্তৰিনিচ্ছযকথা",
    tik1v06vsa29: "২৮. চতুপচ্চযভাজনীযৰিনিচ্ছযকথা",
    tik1v06vsa30: "২৯. কথিনত্থারৰিনিচ্ছযকথা",
    tik1v06vsa31: "৩০. গরুভণ্ডৰিনিচ্ছযকথা",
    tik1v06vsa32: "৩১. চোদনাদিৰিনিচ্ছযকথা",
    tik1v06vsa33: "৩২. গরুকাপত্তিৰুট্ঠানৰিনিচ্ছযকথা",
    tik1v06vsa34: "৩৩. কম্মাকম্মৰিনিচ্ছযকথা",
    tik1v06vsa35: "৩৪. পকিণ্ণকৰিনিচ্ছযকথা"
}
let tik1v07vaj = {
    tik1v07vaj01: "গন্থারম্ভকথা",
    tik1v07vaj02: "পারাজিকৰণ্ণনা",
    tik1v07vaj03: "পাচিত্তিযৰণ্ণনা",
    tik1v07vaj04: "মহাৰগ্গৰণ্ণনা",
    tik1v07vaj05: "চূল়ৰগ্গৰণ্ণনা",
    tik1v07vaj06: "পরিৰারৰণ্ণনা"
}
let tik1v08vim = {
    tik1v08vim01: "গন্থারম্ভকথা",
    tik1v08vim02: "ৰেরঞ্জকণ্ডৰণ্ণনা",
    tik1v08vim03: "১. পারাজিককণ্ডো",
    tik1v08vim04: "২. সঙ্ঘাদিসেসকণ্ডো",
    tik1v08vim05: "৩. অনিযতকণ্ডো",
    tik1v08vim06: "৪. নিস্সগ্গিযকণ্ডো",
    tik1v08vim07: "৫. পাচিত্তিযকণ্ডং", 
    tik1v08vim08: "৬. পাটিদেসনীযকণ্ডং",
    tik1v08vim09: "৭. সেখিযকণ্ডং",
    tik1v08vim10: "ভিক্খুনীৰিভঙ্গৰণ্ণনা",
    tik1v08vim11: "১. পারাজিককণ্ডং",
    tik1v08vim12: "২. সঙ্ঘাদিসেসকণ্ডং",
    tik1v08vim13: "৩. নিস্সগ্গিযকণ্ডং ",
    tik1v08vim14: "৪. পাচিত্তিযকণ্ডং",
    tik1v08vim15: "৫. পাটিদেসনীযকণ্ডং",
    tik1v08vim16: "মহাৰগ্গৰণ্ণনা",
    tik1v08vim17: "১. মহাখন্ধকো",
    tik1v08vim18: "২. উপোসথক্খন্ধকো",
    tik1v08vim19: "৩. ৰস্সূপনাযিকক্খন্ধকো",
    tik1v08vim20: "৪. পৰারণাক্খন্ধকো",
    tik1v08vim21: "৫. চম্মক্খন্ধকো",
    tik1v08vim22: "৬. ভেসজ্জক্খন্ধকো",
    tik1v08vim23: "৭. কথিনক্খন্ধকো",
    tik1v08vim24: "৮. চীৰরক্খন্ধকো",
    tik1v08vim25: "৯. চম্পেয্যক্খন্ধকো",
    tik1v08vim26: "১০. কোসম্বকক্খন্ধকো",
    tik1v08vim27: "চূল়ৰগ্গৰণ্ণনা",
    tik1v08vim28: "১. কম্মক্খন্ধকো",
    tik1v08vim29: "২. পারিৰাসিকক্খন্ধকো",
    tik1v08vim30: "৩. সমুচ্চযক্খন্ধকো",
    tik1v08vim31: "৪. সমথক্খন্ধকো",
    tik1v08vim32: "৫. খুদ্দকৰত্থুক্খন্ধকো",
    tik1v08vim33: "৬. সেনাসনক্খন্ধকো",
    tik1v08vim34: "৭. সঙ্ঘভেদকক্খন্ধকো",
    tik1v08vim35: "৮. ৰত্তক্খন্ধকো",
    tik1v08vim36: "৯. পাতিমোক্খট্ঠপনক্খন্ধকো",
    tik1v08vim37: "১০. ভিক্খুনিক্খন্ধকো",
    tik1v08vim38: "১১. পঞ্চসতিকক্খন্ধকো",
    tik1v08vim39: "১২. সত্তসতিকক্খন্ধকো",
    tik1v08vim40: "পরিৰারৰণ্ণনা",
    tik1v08vim41: "পঞ্ঞত্তিৰারৰণ্ণনা",
    tik1v08vim42: "সমুট্ঠানসীসৰণ্ণনা",
    tik1v08vim43: "অন্তরপেয্যালং",
    tik1v08vim44: "সমথভেদং",
    tik1v08vim45: "খন্ধকপুচ্ছাৰারো",
    tik1v08vim46: "একুত্তরিকনযং",
    tik1v08vim47: "উপোসথাদিপুচ্ছাৰিস্সজ্জনাৰণ্ণনা",
    tik1v08vim48: "পঠমগাথাসঙ্গণিকং",
    tik1v08vim49: "অধিকরণভেদং",
    tik1v08vim50: "চোদনাকণ্ডং",
    tik1v08vim51: "চূল়সঙ্গামং",
    tik1v08vim52: "মহাসঙ্গামং",
    tik1v08vim53: "কথিনভেদং",
    tik1v08vim54: "উপালিপঞ্চকং",
    tik1v08vim55: "অপরদুতিযগাথাসঙ্গণিকং",
    tik1v08vim56: "সেদমোচনগাথা",
    tik1v08vim57: "পঞ্চৰগ্গো"
}
let tik1v09vlt = {
    tik1v09vlt01: "গন্থারম্ভকথা",
    tik1v09vlt02: "১. দিৰাসেয্যৰিনিচ্ছযকথা",
    tik1v09vlt03: "২. পরিক্খারৰিনিচ্ছযকথা",
    tik1v09vlt04: "৩. ভেসজ্জাদিকরণৰিনিচ্ছযকথা",
    tik1v09vlt05: "৪. ৰিঞ্ঞত্তিৰিনিচ্ছযকথা",
    tik1v09vlt06: "৫. কুলসঙ্গহৰিনিচ্ছযকথা",
    tik1v09vlt07: "৬. মচ্ছমংসৰিনিচ্ছযকথা",
    tik1v09vlt08: "৭. অনামাসৰিনিচ্ছযকথা",
    tik1v09vlt09: "৮. অধিট্ঠানৰিকপ্পনৰিনিচ্ছযকথা",
    tik1v09vlt10: "৯. চীৰরৰিপ্পৰাসৰিনিচ্ছযকথা",
    tik1v09vlt11: "১০. ভণ্ডপটিসামনৰিনিচ্ছযকথা",
    tik1v09vlt12: "১১. কযৰিক্কযসমাপত্তিৰিনিচ্ছযকথা",
    tik1v09vlt13: "১২. রূপিযাদিপটিগ্গহণৰিনিচ্ছযকথা",
    tik1v09vlt14: "১৩. দানলক্খণাদিৰিনিচ্ছযকথা",
    tik1v09vlt15: "১৪. পথৰীখণনৰিনিচ্ছযকথা",
    tik1v09vlt16: "১৫. ভূতগামৰিনিচ্ছযকথা",
    tik1v09vlt17: "১৬. সহসেয্যৰিনিচ্ছযকথা",
    tik1v09vlt18: "১৭. পটিপজ্জিতব্বৰিনিচ্ছযকথা",
    tik1v09vlt19: "১৮. কালিকৰিনিচ্ছযকথা",
    tik1v09vlt20: "১৯. কপ্পিযভূমিৰিনিচ্ছযকথা",
    tik1v09vlt21: "২০. পটিগ্গহণৰিনিচ্ছযকথা",
    tik1v09vlt22: "২১. পৰারণাৰিনিচ্ছযকথা",
    tik1v09vlt23: "২২. পব্বজ্জাৰিনিচ্ছযকথা",
    tik1v09vlt24: "২৩. নিস্সযৰিনিচ্ছযকথা",
    tik1v09vlt25: "২৪. সীমাৰিনিচ্ছযকথা",
    tik1v09vlt26: "২৫. উপোসথপৰারণাৰিনিচ্ছযকথা",
    tik1v09vlt27: "২৬. ৰস্সূপনাযিকৰিনিচ্ছযকথা",
    tik1v09vlt28: "২৭. উপজ্ঝাযাদিৰত্তৰিনিচ্ছযকথা",
    tik1v09vlt29: "২৮. চতুপচ্চযভাজনীযৰিনিচ্ছযকথা",
    tik1v09vlt30: "২৯. কথিনত্থারৰিনিচ্ছযকথা",
    tik1v09vlt31: "৩০. গরুভণ্ডৰিনিচ্ছযকথা",
    tik1v09vlt32: "৩১. চোদনাদিৰিনিচ্ছযকথা",
    tik1v09vlt33: "৩২. গরুকাপত্তিৰুট্ঠানৰিনিচ্ছযকথা",
    tik1v09vlt34: "৩৩. কম্মাকম্মৰিনিচ্ছযকথা",
    tik1v09vlt35: "৩৪. পকিণ্ণকৰিনিচ্ছযকথা",
    tik1v09vlt36: "নিগমনকথা"
}
let tik1v10kap = {
    tik1v10kap01: "গন্থারম্ভকথা",
    tik1v10kap02: "পারাজিককণ্ডং",
    tik1v10kap03: "সঙ্ঘাদিসেসকণ্ডং",
    tik1v10kap04: "অনিযতকণ্ডং",
    tik1v10kap05: "নিস্সগ্গিযকণ্ডং",
    tik1v10kap06: "পাচিত্তিযকণ্ডং",
    tik1v10kap07: "পাটিদেসনীযকণ্ডং",
    tik1v10kap08: "সেখিযকণ্ডং",
    tik1v10kap09: "ভিক্খুনীপাতিমোক্খৰণ্ণনা",
    tik1v10kap10: "পারাজিককণ্ডং",
    tik1v10kap11: "সঙ্ঘাদিসেসকণ্ডং",
    tik1v10kap12: "নিস্সগ্গিযকণ্ডং",
    tik1v10kap13: "পাচিত্তিযকণ্ডং",
    tik1v10kap14: "পারাজিককণ্ডং",
    tik1v10kap15: "সঙ্ঘাদিসেসকণ্ডং",
    tik1v10kap16: "অনিযতকণ্ডং",
    tik1v10kap17: "নিস্সগ্গিযকণ্ডং",
    tik1v10kap18: "পাচিত্তিযকণ্ডং",
    tik1v10kap19: "পাটিদেসনীযকণ্ডং",
    tik1v10kap20: "সেখিযকণ্ডং",
    tik1v10kap21: "ভিক্খুনীপাতিমোক্খৰণ্ণনা",
    tik1v10kap22: "পারাজিককণ্ডং",
    tik1v10kap23: "সঙ্ঘাদিসেসকণ্ডং",
    tik1v10kap24: "নিস্সগ্গিযকণ্ডং",
    tik1v10kap25: "পাচিত্তিযকণ্ডং",
    tik1v10kap26: "পাটিদেসনীযকণ্ডং"
}
let tik1v11vuv = {
    tik1v11vuv01: "ৰিনযৰিনিচ্ছযো",
    tik1v11vuv02: "ভিক্খুৰিভঙ্গো",
    tik1v11vuv03: "ভিক্খুনীৰিভঙ্গো",
    tik1v11vuv04: "মহাৰগ্গো",
    tik1v11vuv05: "চূল়ৰগ্গো",
    tik1v11vuv06: "উত্তরৰিনিচ্ছযো",
    tik1v11vuv07: "মহাৰিভঙ্গসঙ্গহকথা",
    tik1v11vuv08: "ভিক্খুনীৰিভঙ্গো"
}
let tik1v12vvt = {
    tik1v12vvt01: "গন্থারম্ভকথা",
    tik1v12vvt02: "ভিক্খুৰিভঙ্গো",
    tik1v12vvt03: "পারাজিককথা",
    tik1v12vvt04: "সঙ্ঘাদিসেসকথাৰণ্ণনা",
    tik1v12vvt05: "অনিযতকথাৰণ্ণনা",
    tik1v12vvt06: "নিস্সগ্গিযকথাৰণ্ণনা",
    tik1v12vvt07: "পাচিত্তিযকথাৰণ্ণনা",
    tik1v12vvt08: "পাটিদেসনীযকথাৰণ্ণনা",
    tik1v12vvt09: "সেখিযকথাৰণ্ণনা",
    tik1v12vvt10: "ভিক্খুনিৰিভঙ্গো",
    tik1v12vvt11: "পারাজিককথাৰণ্ণনা",
    tik1v12vvt12: "সঙ্ঘাদিসেসকথাৰণ্ণনা",
    tik1v12vvt13: "নিস্সগ্গিযকথাৰণ্ণনা",
    tik1v12vvt14: "পাচিত্তিযকথাৰণ্ণনা",
    tik1v12vvt15: "পাটিদেসনীযকথাৰণ্ণনা",
    tik1v12vvt16: "সিক্খাকরণীযকথাৰণ্ণনা",
    tik1v12vvt17: "মহাৰগ্গো",
    tik1v12vvt18: "পব্বজ্জাকথাৰণ্ণনা",
    tik1v12vvt19: "উপোসথক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt20: "ৰস্সূপনাযিকক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt21: "পৰারণক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt22: "চম্মক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt23: "ভেসজ্জক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt24: "কথিনক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt25: "চীৰরক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt26: "চূল়ৰগ্গো",
    tik1v12vvt27: "পারিৰাসিকক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt28: "সমথক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt29: "খুদ্দকৰত্থুক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt30: "সেনাসনক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt31: "ৰত্তক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt32: "ভিক্খুনিক্খন্ধককথাৰণ্ণনা",
    tik1v12vvt33: "চতুব্বিধকম্মকথাৰণ্ণনা",
    tik1v12vvt34: "কম্মৰিপত্তিকথাৰণ্ণনা",
    tik1v12vvt35: "পকিণ্ণকৰিনিচ্ছযকথাৰণ্ণনা",
    tik1v12vvt36: "কম্মট্ঠানৰিভাৰনাৰিধানকথাৰণ্ণনা",
    tik1v12vvt37: "উত্তরৰিনিচ্ছয-টীকা",
    tik1v12vvt38: "মহাৰিভঙ্গসঙ্গহকথাৰণ্ণনা",
    tik1v12vvt39: "ভিক্খুনিৰিভঙ্গো",
    tik1v12vvt40: "চতুৰিপত্তিকথাৰণ্ণনা",
    tik1v12vvt41: "অধিকরণপচ্চযকথাৰণ্ণনা",
    tik1v12vvt42: "খন্ধকপুচ্ছাকথাৰণ্ণনা",
    tik1v12vvt43: "সমুট্ঠানসীসকথাৰণ্ণনা",
    tik1v12vvt44: "আপত্তিসমুট্ঠানকথাৰণ্ণনা",
    tik1v12vvt45: "একুত্তরনযকথাৰণ্ণনা",
    tik1v12vvt46: "সেদমোচনকথাৰণ্ণনা",
    tik1v12vvt47: "সাধারণাসাধারণকথাৰণ্ণনা",
    tik1v12vvt48: "লক্খণকথাৰণ্ণনা",
    tik1v12vvt49: "সব্বসঙ্কলননযকথাৰণ্ণনা"
}
let tik1v13pdi = {
    tik1v13pdi01: "পাচিত্তিযযোজনা",
    tik1v13pdi02: "ভিক্খুনীৰিভঙ্গো",
    tik1v13pdi03: "মহাৰগ্গযোজনা",
    tik1v13pdi04: "চূল়ৰগ্গযোজনা",
    tik1v13pdi05: "পরিৰারৰগ্গযোজনা"
}
let tik1v14kmu = {
    tik1v14kmu01: "খুদ্দসিক্খা",
    tik1v14kmu02: "খুদ্দসিক্খা-প���রাণটীকা",
    tik1v14kmu03: "খুদ্দসিক্খা-অভিনৰটীকা",
    tik1v14kmu04: "মূলসিক্খা",
    tik1v14kmu05: "মূলসিক্খা-টীকা"
}

//sutta tika nikayas
let digtik = {
    tik2d01sil:"সীলক্খন্ধৰগ্গ-টীকা",
    tik2d02mah: "মহাৰগ্গ-টীকা",
    tik2d03pat: "পাথিকৰগ্গ-টীকা",
    tik2d04sab: "সীলক্খন্ধৰগ্গ-অভিনৰটীকা"
}
let majtik = {
    tik3m01mul: "মূলপণ্ণাস-টীকা",
    tik3m02maj: "মজ্ঝিমপণ্ণাস-টীকা",
    tik3m03upa: "উপরিপণ্ণাস-টীকা"
}
let samtik = {
    tik4s01sag: "সগাথাৰগ্গ-টীকা",
    tik4s02nid: "নিদানৰগ্গ-টীকা",
    tik4s03kha: "খন্ধৰগ্গ-টীকা",
    tik4s04sal: "সল়াযতনৰগ্গ-টীকা",
    tik4s05mah: "মহাৰগ্গ-টীকা"
}
let angtik = {
    tik5a01eka: "এককনিপাত-টীকা",
    tik5a02duk: "দুকনিপাত-টীকা",
    tik5a03tik: "তিকনিপাত-টীকা",
    tik5a04cat: "চতুক্কনিপাত-টীকা",
    tik5a05pan: "পঞ্চকনিপাত-টীকা",
    tik5a06cha: "ছক্কনিপাত-টীকা",
    tik5a07sat: "সত্তকনিপাত-টীকা",
    tik5a08att: "অট্ঠকনিপাত-টীকা",
    tik5a09nav: "নৰকনিপাত-টীকা",
    tik5a10das: "দসকনিপাত-টীকা",
    tik5a11eka: "একাদসকনিপাত-টীকা"
}
let khutik = {
    tik6k01npt: "নেত্তিপ্পকরণ-টীকা",
    tik6k02nvn: "নেত্তিৰিভাৰিনী"
}

//abhidhamma tika books
let tik7a01dmt = {
    tik7a01dmt01: "ৰীসতিগাথাৰণ্ণনা",
    tik7a01dmt02: "১. চিত্তুপ্পাদকণ্ডং",
    tik7a01dmt03: "তিকমাতিকাপদৰণ্ণনা",
    tik7a01dmt04: "দুকমাতিকাপদৰণ্ণনা",
    tik7a01dmt05: "কামাৰচরকুসলপদভাজনীযৰণ্ণনা",
    tik7a01dmt06: "কামাৰচরকুসলং",
    tik7a01dmt07: "২. রূপকণ্ডং",
    tik7a01dmt08: "৩. নিক্খেপকণ্ডং",
    tik7a01dmt09: "৪. অট্ঠকথাকণ্ডং"
}
let tik7a02vmt = {
    tik7a02vmt01: "১. খন্ধৰিভঙ্গো",
    tik7a02vmt02: "২. আযতনৰিভঙ্গো",
    tik7a02vmt03: "৩. ধাতুৰিভঙ্গো",
    tik7a02vmt04: "৪. সচ্চৰিভঙ্গো",
    tik7a02vmt05: "৫. ইন্দ্রিযৰিভঙ্গো",
    tik7a02vmt06: "৬. পটিচ্চসমুপ্পাদৰিভঙ্গো",
    tik7a02vmt07: "৭. সতিপট্ঠানৰিভঙ্গো",
    tik7a02vmt08: "৮. সম্মপ্পধানৰিভঙ্গো",
    tik7a02vmt09: "৯. ইদ্ধিপাদৰিভঙ্গো",
    tik7a02vmt10: "১০. বোজ্ঝঙ্গৰিভঙ্গো",
    tik7a02vmt11: "১১. মগ্গঙ্গৰিভঙ্গো",
    tik7a02vmt12: "১২. ঝানৰিভঙ্গো",
    tik7a02vmt13: "১৩. অপ্পমঞ্ঞাৰিভঙ্গো",
    tik7a02vmt14: "১৪. সিক্খাপদৰিভঙ্গো",
    tik7a02vmt15: "১৫. পটিসম্ভিদাৰিভঙ্গো",
    tik7a02vmt16: "১৬. ঞাণৰিভঙ্গো",
    tik7a02vmt17: "১৭. খুদ্দকৰত্থুৰিভঙ্গো",
    tik7a02vmt18: "১৮. ধম্মহদযৰিভঙ্গো",
    tik7a02vmt19: "১. খন্ধৰিভঙ্গো",
    tik7a02vmt20: "২. আযতনৰিভঙ্গো",
    tik7a02vmt21: "৩. ধাতুৰিভঙ্গো",
    tik7a02vmt22: "৪. সচ্চৰিভঙ্গো",
    tik7a02vmt23: "৫. ইন্দ্রিযৰিভঙ্গো",
    tik7a02vmt24: "৬. পটিচ্চসমুপ্পাদৰিভঙ্গো",
    tik7a02vmt25: "৭. সতিপট্ঠানৰিভঙ্গো",
    tik7a02vmt26: "৮. সম্মপ্পধানৰিভঙ্গো",
    tik7a02vmt27: "৯. ইদ্ধিপাদৰিভঙ্গো",
    tik7a02vmt28: "১০. বোজ্ঝঙ্গৰিভঙ্গো",
    tik7a02vmt29: "১১. মগ্গঙ্গৰিভঙ্গো",
    tik7a02vmt30: "১২. ঝানৰিভঙ্গো",
    tik7a02vmt31: "১৩. অপ্পমঞ্ঞাৰিভঙ্গো",
    tik7a02vmt32: "১৪. সিক্খাপদৰিভঙ্গো",
    tik7a02vmt33: "১৫. পটিসম্ভিদাৰিভঙ্গো",
    tik7a02vmt34: "১৬. ঞাণৰিভঙ্গো",
    tik7a02vmt35: "১৭. খুদ্দকৰত্থুৰিভঙ্গো",
    tik7a02vmt36: "১৮. ধম্মহদযৰিভঙ্গো"
}
let tik7a03pmt = {
    tik7a03pmt01: "ধাতুকথাপকরণ-মূলটীকা",
    tik7a03pmt02: "পুগ্গলপঞ্ঞত্তিপকরণ-মূলটীকা",
    tik7a03pmt03: "কথাৰত্থুপকরণ-মূলটীকা",
    tik7a03pmt04: "যমকপকরণ-মূলটীকা",
    tik7a03pmt05: "পট্ঠানপকরণ-মূলটীকা"
}
let tik7a04dat = {
    tik7a04dat01: "ৰীসতিগাথাৰণ্ণনা",
    tik7a04dat02: "১. চিত্তুপ্পাদকণ্ডং",
    tik7a04dat03: "তিকমাতিকাপদৰণ্ণনা",
    tik7a04dat04: "দুকমাতিকাপদৰণ্ণনা",
    tik7a04dat05: "কামাৰচরকুসলপদভাজনীযৰণ্ণনা",
    tik7a04dat06: "২. রূপকণ্ডং",
    tik7a04dat07: "৩. নিক্খেপকণ্ডং",
    tik7a04dat08: "৪. অট্ঠকথাকণ্ডং"
}
let tik7a05pat = {
    tik7a05pat01: "ধাতুকথাপকরণ-অনুটীকা",
    tik7a05pat02: "পুগ্গলপঞ্ঞত্তিপকরণ-অনুটীকা",
    tik7a05pat03: "কথাৰত্থুপকরণ-অনুটীকা",
    tik7a05pat04: "যমকপকরণ-অনুটীকা",
    tik7a05pat05: "পট্ঠানপকরণ-অনুটীকা"
}
let tik7a06anp = {
    tik7a06anp01: "গন্থারম্ভকথা",
    tik7a06anp02: "১. পঠমো পরিচ্ছেদো",
    tik7a06anp03: "২. দুতিযো পরিচ্ছেদো",
    tik7a06anp04: "৩. ততিযো পরিচ্ছেদো",
    tik7a06anp05: "৪. চতুত্থো পরিচ্ছেদো",
    tik7a06anp06: "৫. পঞ্চমো পরিচ্ছেদো",
    tik7a06anp07: "৬. ছট্ঠো পরিচ্ছেদো",
    tik7a06anp08: "৭. সত্তমো পরিচ্ছেদো",
    tik7a06anp09: "৮. অট্ঠমো পরিচ্ছেদো",
    tik7a06anp10: "৯. নৰমো পরিচ্ছেদো",
    tik7a06anp11: "১০. দসমো পরিচ্ছেদো",
    tik7a06anp12: "১১. একাদসমো পরিচ্ছেদো",
    tik7a06anp13: "১২. দ্বাদসমো পরিচ্ছেদো",
    tik7a06anp14: "১৩. তেরসমো পরিচ্ছেদো",
    tik7a06anp15: "১৪. চুদ্দসমো পরিচ্ছেদো",
    tik7a06anp16: "১৫. পন্নরসমো পরিচ্ছেদো",
    tik7a06anp17: "১৬. সোল়সমো পরিচ্ছেদো",
    tik7a06anp18: "১৭. সত্তরসমো পরিচ্ছেদো",
    tik7a06anp19: "১৮. অট্ঠারসমো পরিচ্ছেদো",
    tik7a06anp20: "১৯. একূনৰীসতিমো পরিচ্ছেদো",
    tik7a06anp21: "২০. ৰীসতিমো পরিচ্ছেদো",
    tik7a06anp22: "২১. একৰীসতিমো পরিচ্ছেদো",
    tik7a06anp23: "২২. বাৰীসতিমো পরিচ্ছেদো",
    tik7a06anp24: "২৩. তেৰীসতিমো পরিচ্ছেদো",
    tik7a06anp25: "২৪. চতুৰীসতিমো পরিচ্ছেদো",
    tik7a06anp26: "নামরূপপরিচ্ছেদো",
    tik7a06anp27: "গন্থারম্ভকথা",
    tik7a06anp28: "১. পঠমো পরিচ্ছেদো",
    tik7a06anp29: "২. দুতিযো পরিচ্ছেদো",
    tik7a06anp30: "৩. ততিযো পরিচ্ছেদো",
    tik7a06anp31: "৪. চতুত্থো পরিচ্ছেদো",
    tik7a06anp32: "৫. পঞ্চমো পরিচ্ছেদো",
    tik7a06anp33: "৬. ছট্ঠো পরিচ্ছেদো",
    tik7a06anp34: "৭. সত্তমো পরিচ্ছেদো",
    tik7a06anp35: "৮. অট্ঠমো পরিচ্ছেদো",
    tik7a06anp36: "৯. নৰমো পরিচ্ছেদো",
    tik7a06anp37: "১০. দসমো পরিচ্ছেদো",
    tik7a06anp38: "১১. একাদসমো পরিচ্ছেদো",
    tik7a06anp39: "১২. দ্বাদসমো পরিচ্ছেদো",
    tik7a06anp40: "১৩. তেরসমো পরিচ্ছেদো",
    tik7a06anp41: "পরমত্থৰিনিচ্ছযো",
    tik7a06anp42: "গন্থারম্ভকথা",
    tik7a06anp43: "পঠমো পরিচ্ছেদো",
    tik7a06anp44: "দুতিযো পরিচ্ছেদো",
    tik7a06anp45: "ততিযো পরিচ্ছেদো",
    tik7a06anp46: "চতুত্থো পরিচ্ছেদো",
    tik7a06anp47: "পঞ্চমো পরিচ্ছেদো",
    tik7a06anp48: "ছট্ঠো পরিচ্ছেদো",
    tik7a06anp49: "সত্তমো পরিচ্ছেদো",
    tik7a06anp50: "অট্ঠমো পরিচ্ছেদো",
    tik7a06anp51: "নৰমো পরিচ্ছেদো",
    tik7a06anp52: "দসমো পরিচ্ছেদো",
    tik7a06anp53: "একাদসমো পরিচ্ছেদো",
    tik7a06anp54: "দ্বাদসমো পরিচ্ছেদো",
    tik7a06anp55: "তেরসমো পরিচ্ছেদো",
    tik7a06anp56: "চুদ্দসমো পরিচ্ছেদো",
    tik7a06anp57: "পন্নরসমো পরিচ্ছেদো",
    tik7a06anp58: "সোল়সমো পরিচ্ছেদো",
    tik7a06anp59: "সত্তরসমো পরিচ্ছেদো",
    tik7a06anp60: "অট্ঠারসমো পরিচ্ছেদো",
    tik7a06anp61: "একূনৰীসতিমো পরিচ্ছেদো",
    tik7a06anp62: "ৰীসতিমো পরিচ্ছেদো",
    tik7a06anp63: "একৰীসতিমো পরিচ্ছেদো",
    tik7a06anp64: "দ্বাৰীসতিমো পরিচ্ছেদো",
    tik7a06anp65: "তেৰীসতিমো পরিচ্ছেদো",
    tik7a06anp66: "চতুৰীসতিমো পরিচ্ছেদো",
    tik7a06anp67: "পঞ্চৰীসতিমো পরিচ্ছেদো",
    tik7a06anp68: "ছব্বিসতিমো পরিচ্ছেদো",
    tik7a06anp69: "সত্তৰীসতিমো পরিচ্ছেদো",
    tik7a06anp70: "অট্ঠৰীসতিমো পরিচ্ছেদো",
    tik7a06anp71: "একূনতিংসতিমো পরিচ্ছেদো",
    tik7a06anp72: "সচ্চসঙ্খেপো",
    tik7a06anp73: "গন্থারম্ভকথা",
    tik7a06anp74: "১. পঠমো পরিচ্ছেদো",
    tik7a06anp75: "২. দুতিযো পরিচ্ছেদো",
    tik7a06anp76: "৩. ততিযো পরিচ্ছেদো",
    tik7a06anp77: "৪. চতুত্থো পরিচ্ছেদো",
    tik7a06anp78: "৫. পঞ্চমো পরিচ্ছেদো"
}
let tik7a07asn = {
    tik7a07asn01: "১. চিত্তপরিচ্ছেদো",
    tik7a07asn02: "২. চেতসিকপরিচ্ছেদো",
    tik7a07asn03: "৩. পকিণ্ণকপরিচ্ছেদো",
    tik7a07asn04: "৪. ৰীথিপরিচ্ছেদো",
    tik7a07asn05: "৫. ৰীথিমুত্তপরিচ্ছেদো",
    tik7a07asn06: "৬. রূপপরিচ্ছেদো",
    tik7a07asn07: "৭. সমুচ্চযপরিচ্ছেদো",
    tik7a07asn08: "৮. পচ্চযপরিচ্ছেদো",
    tik7a07asn09: "৯. কম্মট্ঠানপরিচ্ছেদো",
    tik7a07asn10: "১. চিত্তপরিচ্ছেদৰণ্ণনা",
    tik7a07asn11: "২. চেতসিকপরিচ্ছেদৰণ্ণনা",
    tik7a07asn12: "৩. পকিণ্ণকপরিচ্ছেদৰণ্ণনা",
    tik7a07asn13: "৪. ৰীথিপরিচ্ছেদৰণ্ণনা",
    tik7a07asn14: "৫. ৰীথিমুত্তপরিচ্ছেদৰণ্ণনা",
    tik7a07asn15: "৬. রূপপরিচ্ছেদৰণ্ণনা",
    tik7a07asn16: "৭. সমুচ্চযপরিচ্ছেদৰণ্ণনা",
    tik7a07asn17: "৮. পচ্চযপরিচ্ছেদৰণ্ণনা",
    tik7a07asn18: "৯. কম্মট্ঠানপরিচ্ছেদৰণ্ণনা"
}
let tik7a08apu = {
    tik7a08apu01: "১. পঠমো পরিচ্ছেদো",
    tik7a08apu02: "২. দুতিযো পরিচ্ছেদো",
    tik7a08apu03: "৩. ততিযো পরিচ্ছেদো",
    tik7a08apu04: "৪. চতুত্থো পরিচ্ছেদো",
    tik7a08apu05: "৫. পঞ্চমো পরিচ্ছেদো",
    tik7a08apu06: "৬. ছট্ঠো পরিচ্ছেদো",
    tik7a08apu07: "৭. সত্তমো পরিচ্ছেদো",
    tik7a08apu08: "৮. অট্ঠমো পরিচ্ছেদো",
    tik7a08apu09: "৯. নৰমো পরিচ্ছেদো",
    tik7a08apu10: "১০. দসমো পরিচ্ছেদো",
    tik7a08apu11: "১১. একাদসমো পরিচ্ছেদো",
    tik7a08apu12: "১২. দ্বাদসমো পরিচ্ছেদো",
    tik7a08apu13: "১৩. তেরসমো পরিচ্ছেদো",
    tik7a08apu14: "১৪. চুদ্দসমো পরিচ্ছেদো",
    tik7a08apu15: "১৫. পন্নরসমো পরিচ্ছেদো",
    tik7a08apu16: "১৬. সোল়সমো পরিচ্ছেদো",
    tik7a08apu17: "১৭. সত্তরসমো পরিচ্ছেদো",
    tik7a08apu18: "১৮. অট্ঠারসমো পরিচ্ছেদো",
    tik7a08apu19: "১৯. একূনৰীসতিমো পরিচ্ছেদো",
    tik7a08apu20: "২০. ৰীসতিমো পরিচ্ছেদো",
    tik7a08apu21: "২১. একৰীসতিমো পরিচ্ছেদো",
    tik7a08apu22: "২২. বাৰীসতিমো পরিচ্ছেদো",
    tik7a08apu23: "২৩. তেৰীসতিমো পরিচ্ছেদো",
    tik7a08apu24: "২৪. চতুৰীসতিমো পরিচ্ছেদো",
    tik7a08apu25: "গন্থারম্ভকথাৰণ্ণনা",
    tik7a08apu26: "১. পঠমো পরিচ্ছেদো",
    tik7a08apu27: "২. দুতিযো পরিচ্ছেদো",
    tik7a08apu28: "৩. ততিযো পরিচ্ছেদো",
    tik7a08apu29: "৪. চতুত্থো পরিচ্ছেদো",
    tik7a08apu30: "৫. পঞ্চমো পরিচ্ছেদো",
    tik7a08apu31: "৬. ছট্ঠো পরিচ্ছেদো",
    tik7a08apu32: "৭. সত্তমো পরিচ্ছেদো",
    tik7a08apu33: "৮. অট্ঠমো পরিচ্ছেদো",
    tik7a08apu34: "৯. নৰমো পরিচ্ছেদো",
    tik7a08apu35: "১০. দসমো পরিচ্ছেদো",
    tik7a08apu36: "১১. একাদসমো পরিচ্ছেদো",
    tik7a08apu37: "১২. দ্বাদসমো পরিচ্ছেদো",
    tik7a08apu38: "১৩. তেরসমো পরিচ্ছেদো",
    tik7a08apu39: "১৪. চুদ্দসমো পরিচ্ছেদো",
    tik7a08apu40: "১৫. পন্নরসমো পরিচ্ছেদো",
    tik7a08apu41: "১৬. সোল়সমো পরিচ্ছেদো",
    tik7a08apu42: "১৭. সত্তরসমো পরিচ্ছেদো",
    tik7a08apu43: "১৮. অট্ঠারসমো পরিচ্ছেদো",
    tik7a08apu44: "১৯. একূনৰীসতিমো পরিচ্ছেদো",
    tik7a08apu45: "২০. ৰীসতিমো পরিচ্ছেদো",
    tik7a08apu46: "২১. একৰীসতিমো পরিচ্ছেদো",
    tik7a08apu47: "২২. বাৰীসতিমো পরিচ্ছেদো",
    tik7a08apu48: "২৩. তেৰীসতিমো পরিচ্ছেদো",
    tik7a08apu49: "২৪. চতুৰীসতিমো পরিচ্ছেদো"
}
let tik7a09ama = {
    tik7a09ama01: "১. ধম্মসঙ্গণীমাতিকা",
    tik7a09ama02: "২. ৰিভঙ্গমাতিকা",
    tik7a09ama03: "৩. ধাতুকথামাতিকা",
    tik7a09ama04: "৪. পুগ্গলপঞ্ঞত্তিমাতিকা",
    tik7a09ama05: "৫. কথাৰত্থুমাতিকা",
    tik7a09ama06: "৬. যমকমাতিকা",
    tik7a09ama07: "৭. পট্ঠানমাতিকা",
    tik7a09ama08: "১. ধম্মসঙ্গণীমাতিকা",
    tik7a09ama09: "২. ৰিভঙ্গমাতিকা",
    tik7a09ama10: "৩. ধাতুকথামাতিকা",
    tik7a09ama11: "৪. পুগ্গলপঞ্ঞত্তিমাতিকা",
    tik7a09ama12: "৫. কথাৰত্থুমাতিকা",
    tik7a09ama13: "৬. যমকমাতিকা",
    tik7a09ama14: "৭. পট্ঠানমাতিকত্থৰণ্ণনা"
}

//level4- annyanno
//visuddhimagga books
let ann1v01vis01 = {
    ann1v01vis0101: "নিদানাদিকথা",
    ann1v01vis0102: "১. সীলনিদ্দেসো",
    ann1v01vis0103: "২. ধুতঙ্গনিদ্দেসো",
    ann1v01vis0104: "৩. কম্মট্ঠানগ্গহণনিদ্দেসো",
    ann1v01vis0105: "৪. পথৰীকসিণনিদ্দেসো",
    ann1v01vis0106: "৫. সেসকসিণনিদ্দেসো",
    ann1v01vis0107: "৬. অসুভকম্মট্ঠাননিদ্দেসো",
    ann1v01vis0108: "৭. ছঅনুস্সতিনিদ্দেসো",
    ann1v01vis0109: "৮. অনুস্সতিকম্মট্ঠাননিদ্দেসো",
    ann1v01vis0110: "৯. ব্রহ্মৰিহারনিদ্দেসো",
    ann1v01vis0111: "১০. আরুপ্পনিদ্দেসো",
    ann1v01vis0112: "১১. সমাধিনিদ্দেসো"
}
let ann1v02vis02 = {
    ann1v02vis0201: "১২. ইদ্ধিৰিধনিদ্দেসো",
    ann1v02vis0202: "১৩. অভিঞ্ঞানিদ্দেসো",
    ann1v02vis0203: "১৪. খন্ধনিদ্দেসো",
    ann1v02vis0204: "১৫. আযতনধাতুনিদ্দেসো",
    ann1v02vis0205: "১৬. ইন্দ্রিযসচ্চনিদ্দেসো",
    ann1v02vis0206: "১৭. পঞ্ঞাভূমিনিদ্দেসো",
    ann1v02vis0207: "১৮. দিট্ঠিৰিসুদ্ধিনিদ্দেসো",
    ann1v02vis0208: "১৯. কঙ্খাৰিতরণৰিসুদ্ধিনিদ্দেসো",
    ann1v02vis0209: "২০. মগ্গামগ্গঞাণদস্সনৰিসুদ্ধিনিদ্দেসো",
    ann1v02vis0210: "২১. পটিপদাঞাণদস্সনৰিসুদ্ধিনিদ্দেসো",
    ann1v02vis0211: "২২. ঞাণদস্সনৰিসুদ্ধিনিদ্দেসো",
    ann1v02vis0212: "২৩. পঞ্ঞাভাৰনানিসংসনিদ্দেসো"
}
let ann1v03vmt01 = {
    ann1v03vmt0101: "নিদানাদিকথাৰণ্ণনা",
    ann1v03vmt0102: "১. সীলনিদ্দেসৰণ্ণনা",
    ann1v03vmt0103: "২. ধুতঙ্গনিদ্দেসৰণ্ণনা",
    ann1v03vmt0104: "৩. কম্মট্ঠানগ্গহণনিদ্দেসৰণ্ণনা",
    ann1v03vmt0105: "৪. পথৰীকসিণনিদ্দেসৰণ্ণনা",
    ann1v03vmt0106: "৫. সেসকসিণনিদ্দেসৰণ্ণনা",
    ann1v03vmt0107: "৬. অসুভকম্মট্ঠাননিদ্দেসৰণ্ণনা",
    ann1v03vmt0108: "৭. ছঅনুস্সতিনিদ্দেসৰণ্ণনা",
    ann1v03vmt0109: "৮. অনুস্সতিকম্মট্ঠাননিদ্দেসৰণ্ণনা",
    ann1v03vmt0110: "৯. ব্রহ্মৰিহারনিদ্দেসৰণ্ণনা",
    ann1v03vmt0111: "১০. আরুপ্পনিদ্দেসৰণ্ণনা",
    ann1v03vmt0112: "১১. সমাধিনিদ্দেসৰণ্ণনা"
}
let ann1v04vmt02 = {
    ann1v04vmt0201: "১২. ইদ্ধিৰিধনিদ্দেসৰণ্ণনা",
    ann1v04vmt0202: "১৩. অভিঞ্ঞানিদ্দেসৰণ্ণনা",
    ann1v04vmt0203: "১৪. খন্ধনিদ্দেসৰণ্ণনা",
    ann1v04vmt0204: "১৫. আযতনধাতুনিদ্দেসৰণ্ণনা",
    ann1v04vmt0205: "১৬. ইন্দ্রিযসচ্চনিদ্দেসৰণ্ণনা",
    ann1v04vmt0206: "১৭. পঞ্ঞাভূমিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0207: "১৮. দিট্ঠিৰিসুদ্ধিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0208: "১৯. কঙ্খাৰিতরণৰিসুদ্ধিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0209: "২০. মগ্গামগ্গঞাণদস্সনৰিসুদ্ধিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0210: "২১. পটিপদাঞাণদস্সনৰিসুদ্ধিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0211: "২২. ঞাণদস্সনৰিসুদ্ধিনিদ্দেসৰণ্ণনা",
    ann1v04vmt0212: "২৩. পঞ্ঞাভাৰনানিসংসনিদ্দেসৰণ্ণনা"
}
let ann1v05vnk = {
    ann1v05vnk01: "মহাৰংস-বুদ্ধঘোসকথা",
    ann1v05vnk02: "জাতিদেসৰিচারণা",
    ann1v05vnk03: "ব্রাহ্মণকুলৰিচারণা",
    ann1v05vnk04: "পতঞ্জলিৰাদৰিচারণা",
    ann1v05vnk05: "কব্বসত্থৰিচারণা",
    ann1v05vnk06: "বাহুসচ্চগুণমক্খনং",
    ann1v05vnk07: "মহাযানিকনযৰিচারণা",
    ann1v05vnk08: "সাসনপ্পৰত্তিক্কমো",
    ann1v05vnk09: "অভযগিরিনিকাযুপ্পত্তি",
    ann1v05vnk10: "ধম্মরুচিনিকাযুপ্পত্তি",
    ann1v05vnk11: "পিটকত্তযস্স পোত্থকারোপনং",
    ann1v05vnk12: "অধম্মৰাদুপ্পত্তি",
    ann1v05vnk13: "ৰেতুল্লৰাদস্স পঠমনিগ্গহো",
    ann1v05vnk14: "সাগলিযনিকাযুপ্পত্তি",
    ann1v05vnk15: "ৰেতুল্লৰাদস্স দুতিযনিগ্গহো",
    ann1v05vnk16: "ৰেতুল্লৰাদো",
    ann1v05vnk17: "মহাৰিহারনাসনং",
    ann1v05vnk18: "জেতৰনৰাসিনিকাযুপ্পত্তি",
    ann1v05vnk19: "ফাহিযমদ্ধানক্কমকথা",
    ann1v05vnk20: "মরম্মরট্ঠিকভাৰকথা",
    ann1v05vnk21: "দক্খিণইন্দিযরট্ঠিকভাৰযুত্তি",
    ann1v05vnk22: "আচরিযবুদ্ধঘোসত্থেরস্স অট্ঠুপ্পত্তি",
    ann1v05vnk23: "আযাচনকারণং",
    ann1v05vnk24: "ৰিসুদ্ধিমগ্গস্স করণং",
    ann1v05vnk25: "তন্নিস্সযো",
    ann1v05vnk26: "তক্করণপ্পকারো",
    ann1v05vnk27: "ৰিমুত্তিমগ্গপকরণং",
    ann1v05vnk28: "নিস্সযট্ঠকথাৰিভাৰনা",
    ann1v05vnk29: "পোরাণৰচনদস্সনং",
    ann1v05vnk30: "ৰিনযট্ঠকথাকরণং",
    ann1v05vnk31: "আগমট্ঠকথাকরণং",
    ann1v05vnk32: "অভিধম্মট্ঠকথাকরণং",
    ann1v05vnk33: "কঙ্খাৰিতরণীঅট্ঠকথাকরণং",
    ann1v05vnk34: "ধম্মপদট্ঠকথাকরণং",
    ann1v05vnk35: "পরমত্থজোতিকাট্ঠকথাকরণং",
    ann1v05vnk36: "জাতকট্ঠকথাকরণং",
    ann1v05vnk37: "সকললোকপত্থারকারণং"
}

//pucchavisajjana books
let ann2s01dig = {
    ann2s01dig01: "সীলক্খন্ধৰগ্গসুত্ত",
    ann2s01dig02: "ব্রহ্মজালসুত্ত",
    ann2s01dig03: "সামঞ্ঞফলসুত্ত"
}
let ann2s02maj = {
    ann2s02maj01: "মূলপণ্ণাসপাল়ি",
    ann2s02maj02: "মজ্ঝিমপণ্ণাসপাল়ি"
}
let ann2s03san = {
    ann2s03san01: "সগাথাৰগ্গপাল়ি",
    ann2s03san02: "নিদানৰগ্গপাল়ি",
    ann2s03san03: "খন্ধৰগ্গসংযুত্তপাল়ি",
    ann2s03san04: "সল়াযতনৰগ্গসংযুত্তপাল়ি",
    ann2s03san05: "মহাৰগ্গসংযুত্তপাল়ি"
}
let ann2s04ang = {
    ann2s04ang01: "অঙ্গুত্তরনিকাযে"
}
let ann2s05vin = {
    ann2s05vin01: "ৰিনযপিটক",
    ann2s05vin02: "সঙ্ঘাদিসেস সিক্খাপুচ্ছা",
    ann2s05vin03: "নিস্সগ্গিপাচিত্তিয",
    ann2s05vin04: "মহাৰগ্গপাল়ি",
    ann2s05vin05: "চূল়ৰগ্গপাল়ি"
}
let ann2s06abh = {
    ann2s06abh01: "অভিধম্মপিটক"
}
let ann2s07att = {
    ann2s07att01: "অট্ঠকথা"
}
 
//ledisayadaw books
let ann3l01nir = {
    ann3l01nir01: "১. সন্ধিকণ্ড",
    ann3l01nir02: "২. নামকণ্ড",
    ann3l01nir03: "৩. কারককণ্ড",
    ann3l01nir04: "৪. সমাসকণ্ড",
    ann3l01nir05: "৫. তদ্ধিত",
    ann3l01nir06: "৬. আখ্যাতকণ্ড",
    ann3l01nir07: "৭. কিতকণ্ড"
}
let ann3l02par = {
    ann3l02par01: "গন্থারব্ভকথা",
    ann3l02par02: "পথমগাথা-পরমত্থদীপনী",
    ann3l02par03: "দুতীযগাথা-পরমত্থদীপনী",
    ann3l02par04: "চিত্তসঙ্গহ-পরমত্থদীপনী",
    ann3l02par05: "চেতসিকসঙ্গহ পরমত্থদীপনী",
    ann3l02par06: "পকিণ্ণক সঙ্গহ পরমত্থদীপনী",
    ann3l02par07: "ৰীথি সঙ্গহ পরমত্থদীপনী",
    ann3l02par08: "ৰীথিমুত্ত সঙ্গহ পরমত্থদীপনী",
    ann3l02par09: "রূপ সঙ্গহ পরমত্থদীপনী",
    ann3l02par10: "সমুচ্চয সঙ্গহ পরমত্থদীপনী",
    ann3l02par11: "পচ্চয সঙ্গহ পরমত্থদীপনী",
    ann3l02par12: "কম্মট্ঠান সঙ্গহ পরমত্থদীপনী",
    ann3l02par13: "নিগম পরমত্থদীপনী"
}
let ann3l03anu = {
    ann3l03anu01: "১. চিত্তসঙ্গহঅনুদীপনা",
    ann3l03anu02: "২. চেতসিকসঙ্গহঅনুদীপনা",
    ann3l03anu03: "৩. পকিণ্ণকসঙ্গহঅনুদীপনা",
    ann3l03anu04: "৪. ৰীথিসঙ্গহঅনুদীপনা",
    ann3l03anu05: "৫. ৰীথিমুত্তসঙ্গহঅনুদীপনা",
    ann3l03anu06: "৬. রূপসঙ্গহঅনুদীপনা",
    ann3l03anu07: "৭. সমুচ্চযসঙ্গহঅনুদীপনা",
    ann3l03anu08: "৮. পচ্চযসঙ্গহঅনুদীপনা",
    ann3l03anu09: "৯. কম্মট্ঠানসঙ্গহঅনুদীপনা"
}
let ann3l04pat = {
    ann3l04pat01: "১. হেতুপচ্চযো",
    ann3l04pat02: "২. আরম্মণপচ্চযো",
    ann3l04pat03: "৩. অধিপতিপচ্চযো",
    ann3l04pat04: "৪. অনন্তরপচ্চযো",
    ann3l04pat05: "৫. সমনন্তরপচ্চযো",
    ann3l04pat06: "৬. সহজাতপচ্চযো",
    ann3l04pat07: "৭. অঞ্ঞমঞ্ঞপচ্চযো",
    ann3l04pat08: "৮. নিস্সযপচ্চযো",
    ann3l04pat09: "৯. উপনিস্সযপচ্চযো",
    ann3l04pat10: "১০. পুরেজাতপচ্চযো",
    ann3l04pat11: "১১. পচ্ছাজাতপচ্চযো",
    ann3l04pat12: "১২. আসেৰনপচ্চযো",
    ann3l04pat13: "১৩. কম্মপচ্চযো",
    ann3l04pat14: "১৪. ৰিপাকপচ্চযো",
    ann3l04pat15: "১৫. আহারপচ্চযো",
    ann3l04pat16: "১৬. ইন্দ্রিযপচ্চযো",
    ann3l04pat17: "১৭. ঝানপচ্চযো",
    ann3l04pat18: "১৮. মগ্গপচ্চযো",
    ann3l04pat19: "১৯. সম্পযুত্তপচ্চযো",
    ann3l04pat20: "২০. ৰিপ্পযুত্তপচ্চযো",
    ann3l04pat21: "২১. অত্থিপচ্চযো",
    ann3l04pat22: "২২. নত্থিপচ্চযো",
    ann3l04pat23: "পচ্চযসভাগো"
}

//budann9s05dhtdana books

let ann4b01nam = {
    ann4b01nam01: "নমক্কারপাল়ি",
    ann4b01nam02: "নমক্কারটীকা"
}
let ann4b02mah = {
    ann4b02mah01: "মহাপণামপাঠ",
    ann4b02mah02: "তিগুম্বচেতিয থোমনা",
    ann4b02mah03: "ৰাসমালিনীক্য"
}
let ann4b03lak = {
    ann4b03lak01: "বুদ্ধথোমনাগাথা",
    ann4b03lak02: "বুদ্ধৰন্দনা",
    ann4b03lak03: "উণ্ণালোমিকনাথ ৰন্দনা"
}
let ann4b04sut = {
    ann4b04sut01: "সুত্তৰন্দনা"
}
let ann4b05kam = {
    ann4b05kam01: "কমলাঞ্জলি"
}
let ann4b06jin = {
    ann4b06jin01: "পণামদীপনীগাথা",
    ann4b06jin02: "যোগাৰচরসম্পত্তিদীপনীগাথা",
    ann4b06jin03: "ৰত্থুৰিসোধনীগাথা",
    ann4b06jin04: "অনঞ্ঞসাধারণদীপনীগাথা",
    ann4b06jin05: "অভিনীহারদীপনীগাথা",
    ann4b06jin06: "বোধিসম্ভারদীপনীগাথা",
    ann4b06jin07: "গব্ভোক্কন্তিদীপনীগাথা",
    ann4b06jin08: "ৰিজাযনমঙ্গলদীপনীগাথা",
    ann4b06jin09: "অগারিযসম্পত্তিদীপনীগাথা",
    ann4b06jin10: "নেক্খম্মজ্ঝাসযদীপনীযমকগাথা",
    ann4b06jin11: "পাদুদ্ধারৰিম্হযদীপনীগাথা",
    ann4b06jin12: "অপুনরাৰত্তিগমনদীপনীযমকগাথা",
    ann4b06jin13: "দ্বিপাদব্যাসযমকগাথা",
    ann4b06jin14: "তিপাদব্যাসযমকগাথা",
    ann4b06jin15: "পাদব্যাসমহাযমকগাথা",
    ann4b06jin16: "অব্যাপেতাদ্যন্তযমকগাথা",
    ann4b06jin17: "পটিলোমযমকগাথা",
    ann4b06jin18: "একঠানিকাদিযমকগাথা",
    ann4b06jin19: "অক্খরুত্তরিকযমকগাথা",
    ann4b06jin20: "পহেল়িগাথা",
    ann4b06jin21: "ব্যাপেতাদিযমকগাথা",
    ann4b06jin22: "মহাপধানদীপনীগাথা",
    ann4b06jin23: "মারপরাজযদীপনীগাথা",
    ann4b06jin24: "অভিসম্বোধিদীপনীগাথা",
    ann4b06jin25: "ধম্মচক্কপৰত্তনদীপনীগাথা",
    ann4b06jin26: "পাটিহারিযদীপনীগাথা",
    ann4b06jin27: "নৰগুণদীপনীগাথা",
    ann4b06jin28: "গুণদীপনীগাথা",
    ann4b06jin29: "পূজানিধানদীপনীগাথা",
    ann4b06jin30: "পত্থনাদীপনীগাথা"
}
let ann4b07paj = {
    ann4b07paj01: "পজ্জমধু"
}
let ann4b08bud = {
    ann4b08bud01: "বুদ্ধগুণগাথাৰলী"
}

//vangsa books
let ann5b01cul = {
    ann5b01cul01: "১. পিটকত্তযপরিচ্ছেদো",
    ann5b01cul02: "২. গন্থকারকাচরিয-পরিচ্ছেদো",
    ann5b01cul03: "৩. আচরিযানং সঞ্জাতট্ঠানপরিচ্ছেদো",
    ann5b01cul04: "৪. আযাযকাচরিয-পরিচ্ছেদো",
    ann5b01cul05: "৫. পকিণ্ণক-পরিচ্ছেদো"
}
let ann5b02mah = {
    ann5b02mah01: "পথমপরিচ্ছেদ",
    ann5b02mah02: "দুতিযপরিচ্ছেদ",
    ann5b02mah03: "ততিয পরিচ্ছেদ",
    ann5b02mah04: "চতুত্থ পরিচ্ছেদ",
    ann5b02mah05: "পঞ্চম পরিচ্ছেদ",
    ann5b02mah06: "ছট্ঠপরিচ্ছেদ",
    ann5b02mah07: "সত্তম পরিচ্ছেদ",
    ann5b02mah08: "অট্ঠম পরিচ্ছেদ",
    ann5b02mah09: "নৰম পরিচ্ছেদ",
    ann5b02mah10: "দসম পরিচ্ছেদ",
    ann5b02mah11: "একাদসম পরিচ্ছেদ",
    ann5b02mah12: "দ্বাদসম পরিচ্ছেদ",
    ann5b02mah13: "তেরসম পরিচ্ছেদ",
    ann5b02mah14: "চুদ্দসম পরিচ্ছেদ",
    ann5b02mah15: "পঞ্চদসম পরিচ্ছেদ",
    ann5b02mah16: "সোল়সম পরিচ্ছেদ",
    ann5b02mah17: "সত্তরসম পরিচ্ছেদ",
    ann5b02mah18: "অট্ঠারসম পরিচ্ছেদ",
    ann5b02mah19: "একূনৰীসতিম পরিচ্ছেদ",
    ann5b02mah20: "ৰীসতিম পরিচ্ছেদ",
    ann5b02mah21: "একৰীসতিম পরিচ্ছেদ",
    ann5b02mah22: "বাৰীসতিম পরিচ্ছেদ",
    ann5b02mah23: "তেৰীসতিম পরিচ্ছেদ",
    ann5b02mah24: "চতুৰীসতিম পরিচ্ছেদ",
    ann5b02mah25: "পঞ্চৰীসতিম পরিচ্ছেদ",
    ann5b02mah26: "ছব্বীসতিম পরিচ্ছেদ",
    ann5b02mah27: "সত্তৰীসতিম পরিচ্ছেদ",
    ann5b02mah28: "অট্ঠৰীসতিম পরিচ্ছেদ",
    ann5b02mah29: "একূনতিংসতিম পরিচ্ছেদ",
    ann5b02mah30: "তিংসতিম পরিচ্ছেদ",
    ann5b02mah31: "একতিংসতিম পরিচ্ছেদ",
    ann5b02mah32: "দ্বত্তিংসতিম পরিচ্ছেদ",
    ann5b02mah33: "তেত্তিংসতিম পরিচ্ছেদ",
    ann5b02mah34: "চতুত্তিংসতিম পরিচ্ছেদ",
    ann5b02mah35: "পঞ্চতিংসতিমপরিচ্ছেদ",
    ann5b02mah36: "ছত্তিংসতিম পরিচ্ছেদ",
    ann5b02mah37: "সত্ততিংসতিম পরিচ্ছেদ",
    ann5b02mah38: "অট্ঠতিংসতিম পরিচ্ছেদ",
    ann5b02mah39: "একূনচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah40: "চত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah41: "একচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah42: "দ্বিচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah43: "তেচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah44: "চতুচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah45: "পঞ্চচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah46: "ছচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah47: "সত্তচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah48: "অট্ঠচত্তালীসতিম পরিচ্ছেদ",
    ann5b02mah49: "একূনপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah50: "পঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah51: "একপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah52: "দ্বিপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah53: "তিৰঞ্ঞাসতিম পচ্ছেদ",
    ann5b02mah54: "চতুপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah55: "পঞ্চপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah56: "ছপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah57: "সত্তপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah58: "অট্ঠপঞ্ঞাসতিম পরিচ্ছেদ",
    ann5b02mah59: "একূনসট্ঠিম পরিচ্ছেদ",
    ann5b02mah60: "সট্ঠিম পরিচ্ছেদ",
    ann5b02mah61: "একসট্ঠিম পরিচ্ছেদ",
    ann5b02mah62:"দ্বিসট্ঠিমপরিচ্ছেদ",
    ann5b02mah63: "তিসট্ঠিম পরিচ্ছেদ"
}
let ann5b03sas = {
    ann5b03sas01: "সাসনৰংসপ্পদীপিকা",
    ann5b03sas02: "১. নৰট্ঠানাগতসাসনৰংসকথামগ্গো",
    ann5b03sas03: "২. সীহল়দীপিকসাসনৰংসকথামগ্গো",
    ann5b03sas04: "৩. সুৰণ্ণভূমিসাসনৰংসকথামগ্গো",
    ann5b03sas05: "৪. যোনকরট্ঠসাসনৰংসকথামগ্গো",
    ann5b03sas06: "৫. নৰৰাসীরট্ঠসাসনৰংসকথামগ্গো",
    ann5b03sas07: "৬. অপরন্তরট্ঠসাসনৰংসকথামগ্গো",
    ann5b03sas08: "৭. কস্মিরগন্ধাররট্ঠসাসনৰংসকথামগ্গো",
    ann5b03sas09: "৮. মহিংসকরট্ঠস্সাসনৰংসকথামগ্গো",
    ann5b03sas10: "৯. মহারট্ঠসাসনৰংসকথামগ্গো",
    ann5b03sas11: "১০. চিনরট্ঠসাসনৰংসকথামগ্গো"
}

//byakarana books
let ann6v01kac = {
    ann6v01kac01: "কচ্চাযনব্যাকরণং",
    ann6v01kac02: "১. সন্ধিকপ্প",
    ann6v01kac03: "২. নামকপ্প",
    ann6v01kac04: "৩. কারককপ্প",
    ann6v01kac05: "৪. সমাসকপ্প",
    ann6v01kac06: "৫. তদ্ধিতকপ্প",
    ann6v01kac07: "৬. আখ্যাতকপ্প",
    ann6v01kac08: "৭. কিব্বিধানকপ্প",
    ann6v01kac09: "৮. উণাদিকপ্প"
}
let ann6v02mog = {
    ann6v02mog01: "মোগ্গল্লানসুত্তপাঠো",
    ann6v02mog02: "১. পঠমো সঞ্ঞাদিকণ্ডো",
    ann6v02mog03: "২. দুতিযো কণ্ডো (স্যাদি)",
    ann6v02mog04: "৩. ততিযো কণ্ডো (সমাসো)",
    ann6v02mog05: "৪. চতুত্থো কণ্ডো (ণাদি)",
    ann6v02mog06: "৫. পঞ্চমো কণ্ডো (খাদি)",
    ann6v02mog07: "৬. ছট্ঠো কণ্ডো (ত্যাদি)",
    ann6v02mog08: "৭. সত্তমো কণ্ডো (ণ্ৰাদি)"
}
let ann6v03sad = {
    ann6v03sad01: "গন্থারম্ভকথা",
    ann6v03sad02: "১. সৰিকরণাখ্যাতৰিভাগ",
    ann6v03sad03: "২. ভৰতিক্রিযাপদমালাৰিভাগ",
    ann6v03sad04: "৩. পকিণ্ণকৰিনিচ্ছয",
    ann6v03sad05: "৪. ভূধাতুমযনামিকরূপৰিভাগ",
    ann6v03sad06: "৫. ওকারন্তপুল্লিঙ্গনামিকপদমালা",
    ann6v03sad07: "৬. আকারন্তপুল্লিঙ্গনামিকপদমালা",
    ann6v03sad08: "৭. নিগ্গহীতন্তপুল্লিঙ্গনামিকপদমালা",
    ann6v03sad09: "৮. ইত্থিলিঙ্গনামিকপদমালা",
    ann6v03sad10: "৯. নপুংসকলিঙ্গনামিকপদমালা",
    ann6v03sad11: "১০. লিঙ্গত্তযমিস্সকনামিকপদমালা",
    ann6v03sad12: "১১. ৰাচ্চাভিধেয্যলিঙ্গাদিপরিদীপননামিকপদমালা",
    ann6v03sad13: "১২. সব্বনামতংসদিসনামনামিকপদমালা",
    ann6v03sad14: "১৩. সৰিনিচ্ছযসঙ্খ্যানামনামিকপদমালা",
    ann6v03sad15: "১৪. অত্থত্তিকৰিভাগ",
    ann6v03sad16: "১৫. সরৰগ্গপঞ্চকন্তিক সুদ্ধস্সরধাতু",
    ann6v03sad17: "১৬. ভূৰাদিগণিকপরিচ্ছেদ",
    ann6v03sad18: "১৭. রুধাদিছক্ক",
    ann6v03sad19: "১৮. চুরাদিগণপরিদীপন",
    ann6v03sad20: "১৯. সব্বগণৰিনিচ্ছয"
}
let ann6v04pad = {
    ann6v04pad01: "১. সন্ধিকণ্ড",
    ann6v04pad02: "২. নামকণ্ড",
    ann6v04pad03: "৩. কারককণ্ড",
    ann6v04pad04: "৪. সমাসকণ্ড",
    ann6v04pad05: "৫. তদ্ধিতকণ্ড",
    ann6v04pad06: "৬. আখ্যাতকণ্ড",
    ann6v04pad07: "৭. কিব্বিধানকণ্ড"
}
let ann6v05mpn = {
    ann6v05mpn01: "মোগ্গল্লান পঞ্চিকা টীকা",
    ann6v05mpn02: "১. পঠমকণ্ডৰণ্ণনা",
    ann6v05mpn03: "২. দুতিযকণ্ড ৰণ্ণনা",
    ann6v05mpn04: "৩. ততিযকণ্ডৰণ্ণনা",
    ann6v05mpn05: "চতুত্থকণ্ড",
    ann6v05mpn06: "পঞ্চমকণ্ড",
    ann6v05mpn07: "ছট্ঠকণ্ড"
}
let ann6v06pay = {
    ann6v06pay01: "১. সঞ্ঞাদিকণ্ড",
    ann6v06pay02: "২. নামকণ্ড",
    ann6v06pay03: "৩. কারককণ্ড",
    ann6v06pay04: "৪. সমাসকণ্ড",
    ann6v06pay05: "৫. ণাদিকণ্ড",
    ann6v06pay06: "৬. ত্যাদিকণ্ড",
    ann6v06pay07: "৭. খাদিকণ্ড"
}
let ann6v07vut = {
    ann6v07vut01: "১. সঞ্ঞাপরিভাসানিদ্দেস-পঠমপরিচ্ছেদ",
    ann6v07vut02: "২. মত্তাৰুত্তিনিদ্দেস-দুতিযপরিচ্ছেদ",
    ann6v07vut03: "৩. সমৰুত্তিনিদ্দেস-ততিযপরিচ্ছেদ",
    ann6v07vut04: "৪. অড্ঢসমৰুত্তিনিদ্দেস-চতুত্থপরিচ্ছেদ",
    ann6v07vut05: "৫. ৰিসমৰুত্তিনিদ্দেস-পঞ্চমপরিচ্ছেদ",
    ann6v07vut06: "৬. ছপ্পচ্চযৰিভাগ-ছট্ঠপরিচ্ছেদ"
}
let ann6v08adp = {
    ann6v08adp01: "অভিধানপ্পদীপিকা",
    ann6v08adp02: "১. সগ্গকণ্ড",
    ann6v08adp03: "২. ভূকণ্ড",
    ann6v08adp04: "২. ভূকণ্ড",
    ann6v08adp05: "৩. সামঞ্ঞকণ্ড",
    ann6v08adp06: "৩. সামঞ্ঞকণ্ড"
}
let ann6v09adt = {
    ann6v09adt01: "গন্থারম্ভ",
    ann6v09adt02: "১. সগ্গকণ্ডৰণ্ণনা",
    ann6v09adt03: "২. ভূকণ্ড",
    ann6v09adt04: "৩. সামঞ্ঞকণ্ড"
}
let ann6v10sup = {
    ann6v10sup01: "১. দোসাৰবোধ-পঠমপরিচ্ছেদ",
    ann6v10sup02: "১. দোসপরিহারাৰবোধ-দুতিযপরিচ্ছেদ",
    ann6v10sup03: "৩. গুণাৰবোধ-ততিযপরিচ্ছেদ",
    ann6v10sup04: "৪. অত্থালঙ্কারাৰবোধ-চতুত্থপরিচ্ছেদ",
    ann6v10sup05: "৫. ভাৰাৰবোধ-পঞ্চমপরিচ্ছেদ"
}
let ann6v11sut = {
    ann6v11sut01: "১. দোসাৰবোধ পঠমপরিচ্ছেদ",
    ann6v11sut02: "২. দোসপরিহারাৰবোধপরিচ্ছেদৰণ্ণনা",
    ann6v11sut03: "৩. গুণাৰবোধপরিচ্ছেদ",
    ann6v11sut04: "৪. অত্থালঙ্কারাৰবোধপরিচ্ছেদ",
    ann6v11sut05: "৫. ভাৰাৰবোধপরিচ্ছেদ",
    ann6v11sut06: "ঠাযীভাৰনিদ্দেস"
}
let ann6v12val = {
    ann6v12val01: "বালাৰতার",
    ann6v12val02: "১. সন্ধি কণ্ড",
    ann6v12val03: "২. নামকণ্ড",
    ann6v12val04: "৩. সমাসকণ্ড",
    ann6v12val05: "৪. তদ্ধিতকণ্ড"
}

//nitigantha books
let ann7n01lok = {
    ann7n01lok01: "১. পণ্ডিতকণ্ডো",
    ann7n01lok02: "সুজনকণ্ডো",
    ann7n01lok03: "৪. বালদুজ্জনকণ্ডো",
    ann7n01lok04: "৪. মিত্তকণ্ডো",
    ann7n01lok05: "৫. ইত্থিকণ্ডো",
    ann7n01lok06: "৬. রাজকণ্ডো",
    ann7n01lok07: "৭. পকিণ্ণককণ্ডো"
}
let ann7n02sut = {
    ann7n02sut01: "সুত্তন্তনীতি",
    ann7n02sut02: "ৰসলসুত্ত"
}
let ann7n03sur = {
    ann7n03sur01: "পণামগাথা",
    ann7n03sur02: "সূরস্সতীনীতি",
    ann7n03sur03: "চাণক্যনীতিলা গাথা"
}
let ann7n04mah = {
    ann7n04mah01: "পণ্ডিতকথা",
    ann7n04mah02: "সম্ভেদকথা",
    ann7n04mah03: "মিত্তকথা",
    ann7n04mah04: "নাযককথা",
    ann7n04mah05: "ইত্থিকথা"
}
let ann7n05dha = {
    ann7n05dha01: "ধম্মনীতি"
}
let ann7n06kav = {
    ann7n06kav01: "মাতিকা",
    ann7n06kav02: "রতনত্তযপণাম",
    ann7n06kav03: "পণ্ডিতকণ্ড",
    ann7n06kav04: "সুজনকণ্ড",
    ann7n06kav05: "বালদুজ্জনকণ্ড",
    ann7n06kav06: "রাজকণ্ড",
    ann7n06kav07: "নাযক কণ্ড",
    ann7n06kav08: "পুত্তকণ্ড",
    ann7n06kav09: "ৰেজ্জাচরিয কণ্ড",
    ann7n06kav10: "দাসক কণ্ড",
    ann7n06kav11: "ইত্থিকণ্ড",
    ann7n06kav12: "পকিণ্ণককণ্ড",
    ann7n06kav13: "কৰিদপ্পণনীতি",
    ann7n06kav14: "পণাম পটিঞ্ঞা"
}
let ann7n07nit = {
    ann7n07nit01: "নীতিমঞ্জরী"
}
let ann7n08nar = {
    ann7n08nar01: "পণাম",
    ann7n08nar02: "নরদক্খদীপকস্স,",
    ann7n08nar03: "মত্থনা",
    ann7n08nar04: "আসীস",
    ann7n08nar05: "অভিযাচক",
    ann7n08nar06: "পঞ্ঞা-নিদ্দেস",
    ann7n08nar07: "চারিত্ত-নিদ্দেস",
    ann7n08nar08: "ঘরাৰাস-নিদ্দেস",
    ann7n08nar09: "সাধুজন-নিদ্দেস",
    ann7n08nar10: "কাযখমনীয-নিদ্দেস",
    ann7n08nar11: "পকিণ্ণক-নিদ্দেস",
    ann7n08nar12: "সীল-নিদ্দেস",
    ann7n08nar13: "নরদক্খ থোমনা আসীস"
}
let ann7n09cat = {
    ann7n09cat01: "কাযপচ্চৰেক্খণা",
    ann7n09cat02: "১. বুদ্ধানুস্সতি নিদ্দেস",
    ann7n09cat03: "২. মরণস্সতিনিদ্দেস",
    ann7n09cat04: "৩. অসুভভাৰনা নিদ্দেস",
    ann7n09cat05: "অপ্পমাদাৰহ পকিণ্ণকনিদ্দেস",
    ann7n09cat06: "কাযপচ্চৰেক্খণা"
}
let ann7n10can = {
    ann7n10can01: "চাণক্যনীতিপাল়ি"
}

    
//pakinnaka books
let ann8p01ras = {
    ann8p01ras01: "পণামাদিকথা",
    ann8p01ras02: "ধম্মসোণ্ডকৰগ্গো",
    ann8p01ras03: "নন্দিযরাজৰগ্গো",
    ann8p01ras04: "যক্খৰঞ্চিতৰগ্গো",
    ann8p01ras05: "মহাসেনৰগ্গো"
}
let ann8p02sim = {
    ann8p02sim01: "সীমৰিসোধনী",
    ann8p02sim02: "১. উপসম্পদাকণ্ডো",
    ann8p02sim03: "২. কপ্পৰিনাসকণ্ডো",
    ann8p02sim04: "৩. নিব্বানকণ্ডো",
    ann8p02sim05: "৪. সমসীসিকণ্ডো",
    ann8p02sim06: "পকিণ্ণককণ্ডো"
}
let ann8p03ves = {
    ann8p03ves01: "ৰেস্সন্তরাগীতি"
}

//sihala books
let ann9s01mog = {
    ann9s01mog01: "মোগ্গল্লান ৰুত্তিৰিৰরণপঞ্চিকা।"
}
let ann9s02thu = {
    ann9s02thu01: "থুপৰংসো ",
    ann9s02thu02: "অভিনীহার কথা",
    ann9s02thu03: "চূল়ামণিদুস্স থুপদ্বযকথা",
    ann9s02thu04: "দসথূপকথা",
    ann9s02thu05: "ধাতুনিধান কথা",
    ann9s02thu06: "চতুরাসীতি সহস্স থূপকথা",
    ann9s02thu07: "বোধি আগমনকথা",
    ann9s02thu08: "যোজনথূপ কথা",
    ann9s02thu09: "তদত্থদীপনত্থং অযমনুপুব্বকথা",
    ann9s02thu10: "মহিযঙ্গন থূপকথা",
    ann9s02thu11: "মরীচৰট্টি ৰিহারকথা",
    ann9s02thu12: "থূপসাধন লাভকথা",
    ann9s02thu13: "থূপারম্হ কথা",
    ann9s02thu14: "ধাতুগব্ব রূপৰণ্ণনাকথা"
}
let ann9s03dat = {
    ann9s03dat01: "দাঠাৰংসো "
}
let ann9s04dha = {
    ann9s04dha01: "ধাতুপাঠ ৰিলাসিনিযা"
}
let ann9s05dht = {
    ann9s05dht01: "১. তথাগতস্সাগমনকথা ",
    ann9s05dht02: "২. পরিনিব্বানকথা",
    ann9s05dht03: "৩. ধাতুপরম্পরাকথা",
    ann9s05dht04: "৪. পকিণ্ণককথা",
    ann9s05dht05: "৫. ধাতুনিধানাধিকারো"
}
let ann9s06hat = {
    ann9s06hat01: "হত্থৰনগল্লৰিহার ৰংসো"
}
let ann9s07jin = {
    ann9s07jin01: "জিনচরিতয "
}
let ann9s08jvd = {
    ann9s08jvd01: "জিনৰংসদীপং "
}
let ann9s09tel = {
    ann9s09tel01: "তেলকটাহগাথা "
}
let ann9s10mil = {
    ann9s10mil01: "মিলিদটীকা",
    ann9s10mil02: "পকিণ্ণকথৰিৰরণং"
}
let ann9s11pad = {
    ann9s11pad01: "পদমঞ্জরী "
}
let ann9s12psd = {
    ann9s12psd01: "পদসাধনং "
}
let ann9s13sad = {
    ann9s13sad01: "সদ্দবিন্দু পকরণং"
}
let ann9s14kdm = {
    ann9s14kdm01: "কচ্চাযন ধাতু মঞ্জূসা ",
    ann9s14kdm02: "তুদাদযো অৰুদ্ধিকা",
    ann9s14kdm03: "জুহোত্যা’দযো সদ্বিভাৰলুত্তৰিকরণা।",
    ann9s14kdm04: "রুধাদযো",
    ann9s14kdm05: "দিৰাদযো ",
    ann9s14kdm06: "স্ৰাদযো ",
    ann9s14kdm07: "কিযাদযো",
    ann9s14kdm08: "তনাদযো "
}
let ann9s15sam = {
    ann9s15sam01: "সমন্তকূটৰণ্ণনা "
}

//level5-sutta books
//digha-mul
let mul2d01sil = {
    mul2d01sil01: "১. ব্রহ্মজালসুত্তং",
    mul2d01sil02: "২. সামঞ্ঞফলসুত্তং",
    mul2d01sil03: "৩. অম্বট্ঠসুত্তং",
    mul2d01sil04: "৪. সোণদণ্ডসুত্তং",
    mul2d01sil05: "৫. কূটদন্তসুত্তং",
    mul2d01sil06: "৬. মহালিসুত্তং",
    mul2d01sil07: "৭. জালিযসুত্তং",
    mul2d01sil08: "৮. মহাসীহনাদসুত্তং",
    mul2d01sil09: "৯. পোট্ঠপাদসুত্তং",
    mul2d01sil10: "১০. সুভসুত্তং",
    mul2d01sil11: "১১. কেৰট্টসুত্তং",
    mul2d01sil12: "১২. লোহিচ্চসুত্তং",
    mul2d01sil13: "১৩. তেৰিজ্জসুত্তং"
}
let mul2d02mah = {
    mul2d02mah01: "১. মহাপদানসুত্তং",
    mul2d02mah02: "২. মহানিদানসুত্তং",
    mul2d02mah03: "৩. মহাপরিনিব্বানসুত্তং",
    mul2d02mah04: "৪. মহাসুদস্সনসুত্তং",
    mul2d02mah05: "৫. জনৰসভসুত্তং",
    mul2d02mah06: "৬. মহাগোৰিন্দসুত্তং",
    mul2d02mah07: "৭. মহাসমযসুত্তং",
    mul2d02mah08: "৮. সক্কপঞ্হসুত্তং",
    mul2d02mah09: "৯. মহাসতিপট্ঠানসুত্তং",
    mul2d02mah10: "১০. পাযাসিরাজঞ্ঞসুত্তং"
}
let mul2d03pat = {
    mul2d03pat01: "১. পাথিকসুত্তং",
    mul2d03pat02: "২. উদুম্বরিকসুত্তং",
    mul2d03pat03: "৩. চক্কৰত্তিসুত্তং",
    mul2d03pat04: "৪. অগ্গঞ্ঞসুত্তং",
    mul2d03pat05: "৫. সম্পসাদনীযসুত্তং",
    mul2d03pat06: "৬. পাসাদিকসুত্তং",
    mul2d03pat07: "৭. লক্খণসুত্তং",
    mul2d03pat08: "৮. সিঙ্গালসুত্তং",
    mul2d03pat09: "৯. আটানাটিযসুত্তং",
    mul2d03pat10: "১০. সঙ্গীতিসুত্তং",
    mul2d03pat11: "১১. দসুত্তরসুত্তং"
}

//majjhima-mul
let mul3m01mul = {
    mul3m01mul01: "১. মূলপরিযাযৰগ্গো",
    mul3m01mul02: "২. সীহনাদৰগ্গো",
    mul3m01mul03: "৩. ওপম্মৰগ্গো",
    mul3m01mul04: "৪. মহাযমকৰগ্গো",
    mul3m01mul05: "৫. চূল়যমকৰগ্গো"
}
let mul3m02maj = {
    mul3m02maj01: "১. গহপতিৰগ্গো",
    mul3m02maj02: "২. ভিক্খুৰগ্গো",
    mul3m02maj03: "৩. পরিব্বাজকৰগ্গো",
    mul3m02maj04: "৪. রাজৰগ্গো",
    mul3m02maj05: "৫. ব্রাহ্মণৰগ্গো"
}
let mul3m03upa = {
    mul3m03upa01: "১. দেৰদহৰগ্গো",
    mul3m03upa02: "২. অনুপদৰগ্গো",
    mul3m03upa03: "৩. সুঞ্ঞতৰগ্গো",
    mul3m03upa04: "৪. ৰিভঙ্গৰগ্গো",
    mul3m03upa05: "৫. সল়াযতনৰগ্গো"
}

//samyutta-mul
let mul4s01sag = {
    mul4s01sag01: "১. দেৰতাসংযুত্তং",
    mul4s01sag02: "২. দেৰপুত্তসংযুত্তং",
    mul4s01sag03: "৩. কোসলসংযুত্তং",
    mul4s01sag04: "৪. মারসংযুত্তং",
    mul4s01sag05: "৫. ভিক্খুনীসংযুত্তং",
    mul4s01sag06: "৬. ব্রহ্মসংযুত্তং",
    mul4s01sag07: "৭. ব্রাহ্মণসংযুত্তং",
    mul4s01sag08: "৮. ৰঙ্গীসসংযুত্তং",
    mul4s01sag09: "৯. ৰনসংযুত্তং",
    mul4s01sag10: "১০. যক্খসংযুত্তং",
    mul4s01sag11: "১১. সক্কসংযুত্তং"
}
let mul4s02nid = {
    mul4s02nid01: "১. নিদানসংযুত্তং",
    mul4s02nid02: "২. অভিসমযসংযুত্তং",
    mul4s02nid03: "৩. ধাতুসংযুত্তং",
    mul4s02nid04: "৪. অনমতগ্গসংযুত্তং",
    mul4s02nid05: "৫. কস্সপসংযুত্তং",
    mul4s02nid06: "৬. লাভসক্কারসংযুত্তং",
    mul4s02nid07: "৭. রাহুলসংযুত্তং",
    mul4s02nid08: "৮. লক্খণসংযুত্তং",
    mul4s02nid09: "৯. ওপম্মসংযুত্তং",
    mul4s02nid10: "১০. ভিক্খুসংযুত্তং"
}
let mul4s03kha = {
    mul4s03kha01: "১. খন্ধসংযুত্তং",
    mul4s03kha02: "২. রাধসংযুত্তং",
    mul4s03kha03: "৩. দিট্ঠিসংযুত্তং",
    mul4s03kha04: "৪. ওক্কন্তসংযুত্তং",
    mul4s03kha05: "৫. উপ্পাদসংযুত্তং",
    mul4s03kha06: "৬. কিলেসসংযুত্তং",
    mul4s03kha07: "৭. সারিপুত্তসংযুত্তং",
    mul4s03kha08: "৮. নাগসংযুত্তং",
    mul4s03kha09: "৯. সুপণ্ণসংযুত্তং",
    mul4s03kha10: "১০. গন্ধব্বকাযসংযুত্তং",
    mul4s03kha11: "১১. ৰলাহকসংযুত্তং",
    mul4s03kha12: "১২. ৰচ্ছগোত্তসংযুত্তং",
    mul4s03kha13: "১৩. ঝানসংযুত্তং"
}
let mul4s04sal = {
    mul4s04sal01: "১. সল়াযতনসংযুত্তং",
    mul4s04sal02: "২. ৰেদনাসংযুত্তং",
    mul4s04sal03: "৩. মাতুগামসংযুত্তং",
    mul4s04sal04: "৪. জম্বুখাদকসংযুত্তং",
    mul4s04sal05: "৫. সামণ্ডকসংযুত্তং",
    mul4s04sal06: "৬. মোগ্গল্লানসংযুত্তং",
    mul4s04sal07: "৭. চিত্তসংযুত্তং",
    mul4s04sal08: "৮. গামণিসংযুত্তং",
    mul4s04sal09: "৯. অসঙ্খতসংযুত্তং",
    mul4s04sal10: "১০. অব্যাকতসংযুত্তং"
}
let mul4s05mah = {
    mul4s05mah01: "১. মগ্গসংযুত্তং",
    mul4s05mah02: "২. বোজ্ঝঙ্গসংযুত্তং",
    mul4s05mah03: "৩. সতিপট্ঠানসংযুত্তং",
    mul4s05mah04: "৪. ইন্দ্রিযসংযুত্তং",
    mul4s05mah05: "৫. সম্মপ্পধানসংযুত্তং",
    mul4s05mah06: "৬. বলসংযুত্তং",
    mul4s05mah07: "৭. ইদ্ধিপাদসংযুত্তং",
    mul4s05mah08: "৮. অনুরুদ্ধসংযুত্তং",
    mul4s05mah09: "৯. ঝানসংযুত্তং",
    mul4s05mah10: "১০. আনাপানসংযুত্তং",
    mul4s05mah11: "১১. সোতাপত্তিসংযুত্তং",
    mul4s05mah12: "১২. সচ্চসংযুত্তং"
}

//anguttara-mul
let mul5a01eka = {
    mul5a01eka01: "১. রূপাদিৰগ্গো",
    mul5a01eka02: "২. নীৰরণপ্পহানৰগ্গো",
    mul5a01eka03: "৩. অকম্মনিযৰগ্গো",
    mul5a01eka04: "৪. অদন্তৰগ্গো",
    mul5a01eka05: "৫. পণিহিতঅচ্ছৰগ্গো",
    mul5a01eka06: "৬. অচ্ছরাসঙ্ঘাতৰগ্গো",
    mul5a01eka07: "৭. ৰীরিযারম্ভাদিৰগ্গো",
    mul5a01eka08: "৮. কল্যাণমিত্ততাদিৰগ্গো",
    mul5a01eka09: "৯. পমাদাদিৰগ্গো",
    mul5a01eka10: "১০. দুতিযপমাদাদিৰগ্গো",
    mul5a01eka11: "১১. অধম্মৰগ্গো",
    mul5a01eka12: "১২. অনাপত্তিৰগ্গো",
    mul5a01eka13: "১৩. একপুগ্গলৰগ্গো",
    mul5a01eka14: "১৪. এতদগ্গৰগ্গো",
    mul5a01eka15: "১৫. অট্ঠানপাল়ি",
    mul5a01eka16: "১৬. একধম্মপাল়ি",
    mul5a01eka17: "১৭. পসাদকরধম্মৰগ্গো",
    mul5a01eka18: "১৮. অপরঅচ্ছরাসঙ্ঘাতৰগ্গো",
    mul5a01eka19: "১৯. কাযগতাসতিৰগ্গো",
    mul5a01eka20: "২০. অমতৰগ্গো"
}
let mul5a02duk = {
    mul5a02duk01: "১. কম্মকারণৰগ্গো",
    mul5a02duk02: "২. অধিকরণৰগ্গো",
    mul5a02duk03: "৩. বালৰগ্গো",
    mul5a02duk04: "৪. সমচিত্তৰগ্গো",
    mul5a02duk05: "৫. পরিসৰগ্গো",
    mul5a02duk06: "(৬) ১. পুগ্গলৰগ্গো",
    mul5a02duk07: "(৭) ২. সুখৰগ্গো",
    mul5a02duk08: "(৮) ৩. সনিমিত্তৰগ্গো",
    mul5a02duk09: "(৯) ৪. ধম্মৰগ্গো",
    mul5a02duk10: "(১০) ৫. বালৰগ্গো",
    mul5a02duk11: "(১১) ১. আসাদুপ্পজহৰগ্গো",
    mul5a02duk12: "(১২) ২. আযাচনৰগ্গো",
    mul5a02duk13: "(১৩) ৩. দানৰগ্গো",
    mul5a02duk14: "(১৪) ৪. সন্থারৰগ্গো",
    mul5a02duk15: "(১৫) ৫. সমাপত্তিৰগ্গো",
    mul5a02duk16: "১. কোধপেয্যালং",
    mul5a02duk17: "২. অকুসলপেয্যালং",
    mul5a02duk18: "৩. ৰিনযপেয্যালং",
    mul5a02duk19: "৪. রাগপেয্যালং"
}
let mul5a03tik = {
    mul5a03tik01: "১. বালৰগ্গো",
    mul5a03tik02: "২. রথকারৰগ্গো",
    mul5a03tik03: "৩. পুগ্গলৰগ্গো",
    mul5a03tik04: "৪. দেৰদূতৰগ্গো",
    mul5a03tik05: "৫. চূল়ৰগ্গো",
    mul5a03tik06: "(৬) ১. ব্রাহ্মণৰগ্গো",
    mul5a03tik07: "(৭) ২. মহাৰগ্গো",
    mul5a03tik08: "(৮) ৩. আনন্দৰগ্গো",
    mul5a03tik09: "(৯) ৪. সমণৰগ্গো",
    mul5a03tik10: "(১০) ৫. লোণকপল্লৰগ্গো",
    mul5a03tik11: "(১১) ১. সম্বোধৰগ্গো",
    mul5a03tik12: "(১২) ২. আপাযিকৰগ্গো",
    mul5a03tik13: "(১৩) ৩. কুসিনারৰগ্গো",
    mul5a03tik14: "(১৪) ৪. যোধাজীৰৰগ্গো",
    mul5a03tik15: "(১৫) ৫. মঙ্গলৰগ্গো",
    mul5a03tik16: "(১৬) ৬. অচেলকৰগ্গো",
    mul5a03tik17: "(১৭) ৭. কম্মপথপেয্যালং",
    mul5a03tik18: "(১৮) ৮. রাগপেয্যালং"
}
let mul5a04cat = {
    mul5a04cat01: "১. ভণ্ডগামৰগ্গো",
    mul5a04cat02: "২. চরৰগ্গো",
    mul5a04cat03: "৩. উরুৰেলৰগ্গো",
    mul5a04cat04: "৪. চক্কৰগ্গো",
    mul5a04cat05: "৫. রোহিতস্সৰগ্গো",
    mul5a04cat06: "(৬) ১. পুঞ্ঞাভিসন্দৰগ্গো",
    mul5a04cat07: "(৭) ২. পত্তকম্মৰগ্গো",
    mul5a04cat08: "(৮) ৩. অপণ্ণকৰগ্গো",
    mul5a04cat09: "(৯) ৪. মচলৰগ্গো",
    mul5a04cat10: "(১০) ৫. অসুরৰগ্গো",
    mul5a04cat11: "(১১) ১. ৰলাহকৰগ্গো",
    mul5a04cat12: "(১২) ২. কেসিৰগ্গো",
    mul5a04cat13: "(১৩) ৩. ভযৰগ্গো",
    mul5a04cat14: "(১৪) ৪. পুগ্গলৰগ্গো",
    mul5a04cat15: "(১৫) ৫. আভাৰগ্গো",
    mul5a04cat16: "(১৬) ১. ইন্দ্রিযৰগ্গো",
    mul5a04cat17: "(১৭) ২. পটিপদাৰগ্গো",
    mul5a04cat18: "(১৮) ৩. সঞ্চেতনিযৰগ্গো",
    mul5a04cat19: "(১৯) ৪. ব্রাহ্মণৰগ্গো",
    mul5a04cat20: "(২০) ৫. মহাৰগ্গো",
    mul5a04cat21: "(২১) ১. সপ্পুরিসৰগ্গো",
    mul5a04cat22: "(২২) ২. পরিসাৰগ্গো",
    mul5a04cat23: "(২৩) ৩. দুচ্চরিতৰগ্গো",
    mul5a04cat24: "(২৪) ৪. কম্মৰগ্গো",
    mul5a04cat25: "(২৫) ৫. আপত্তিভযৰগ্গো",
    mul5a04cat26: "(২৬) ৬. অভিঞ্ঞাৰগ্গো",
    mul5a04cat27: "(২৭) ৭. কম্মপথৰগ্গো",
    mul5a04cat28: "(২৮) ৮. রাগপেয্যালং"
}
let mul5a05pan = {
    mul5a05pan01: "১. সেখবলৰগ্গো",
    mul5a05pan02: "২. বলৰগ্গো",
    mul5a05pan03: "৩. পঞ্চঙ্গিকৰগ্গো",
    mul5a05pan04: "৪. সুমনৰগ্গো",
    mul5a05pan05: "৫. মুণ্ডরাজৰগ্গো",
    mul5a05pan06: "(৬) ১. নীৰরণৰগ্গো",
    mul5a05pan07: "(৭) ২. সঞ্ঞাৰগ্গো",
    mul5a05pan08: "(৮) ৩. যোধাজীৰৰগ্গো",
    mul5a05pan09: "(৯) ৪. থেরৰগ্গো",
    mul5a05pan10: "(১০) ৫. ককুধৰগ্গো",
    mul5a05pan11: "(১১) ১. ফাসুৰিহারৰগ্গো",
    mul5a05pan12: "(১২) ২. অন্ধকৰিন্দৰগ্গো",
    mul5a05pan13: "(১৩) ৩. গিলানৰগ্গো",
    mul5a05pan14: "(১৪) ৪. রাজৰগ্গো",
    mul5a05pan15: "(১৫) ৫. তিকণ্ডকীৰগ্গো",
    mul5a05pan16: "(১৬) ১. সদ্ধম্মৰগ্গো",
    mul5a05pan17: "(১৭) ২. আঘাতৰগ্গো",
    mul5a05pan18: "(১৮) ৩. উপাসকৰগ্গো",
    mul5a05pan19: "(১৯) ৪. অরঞ্ঞৰগ্গো",
    mul5a05pan20: "(২০) ৫. ব্রাহ্মণৰগ্গো",
    mul5a05pan21: "(২১) ১. কিমিলৰগ্গো",
    mul5a05pan22: "(২২) ২. অক্কোসকৰগ্গো",
    mul5a05pan23: "(২৩) ৩. দীঘচারিকৰগ্গো",
    mul5a05pan24: "(২৪) ৪. আৰাসিকৰগ্গো",
    mul5a05pan25: "(২৫) ৫. দুচ্চরিতৰগ্গো",
    mul5a05pan26: "(২৬) ৬. উপসম্পদাৰগ্গো",
    mul5a05pan27: "১. সম্মুতিপেয্যালং",
    mul5a05pan28: "২. সিক্খাপদপেয্যালং",
    mul5a05pan29: "৩. রাগপেয্যালং"
}
let mul5a06cha = {
    mul5a06cha01: "১. আহুনেয্যৰগ্গো",
    mul5a06cha02: "২. সারণীযৰগ্গো",
    mul5a06cha03: "৩. অনুত্তরিযৰগ্গো",
    mul5a06cha04: "৪. দেৰতাৰগ্গো",
    mul5a06cha05: "৫. ধম্মিকৰগ্গো",
    mul5a06cha06: "৬. মহাৰগ্গো",
    mul5a06cha07: "৭. দেৰতাৰগ্গো",
    mul5a06cha08: "৮. অরহত্তৰগ্গো",
    mul5a06cha09: "৯. সীতিৰগ্গো",
    mul5a06cha10: "১০. আনিসংসৰগ্গো",
    mul5a06cha11: "১১. তিকৰগ্গো",
    mul5a06cha12: "১২. সামঞ্ঞৰগ্গো",
    mul5a06cha13: "১৩. রাগপেয্যালং"
}
let mul5a07sat = {
    mul5a07sat01: "১. ধনৰগ্গো",
    mul5a07sat02: "২. অনুসযৰগ্গো",
    mul5a07sat03: "৩. ৰজ্জিসত্তকৰগ্গো",
    mul5a07sat04: "৪. দেৰতাৰগ্গো",
    mul5a07sat05: "৫. মহাযঞ্ঞৰগ্গো",
    mul5a07sat06: "৬. অব্যাকতৰগ্গো",
    mul5a07sat07: "৭. মহাৰগ্গো",
    mul5a07sat08: "৮. ৰিনযৰগ্গো",
    mul5a07sat09: "৯. সমণৰগ্গো",
    mul5a07sat10: "১০. আহুনেয্যৰগ্গো",
    mul5a07sat11: "১১. রাগপেয্যালং"
}
let mul5a08att = {
    mul5a08att01: "১. মেত্তাৰগ্গো",
    mul5a08att02: "২. মহাৰগ্গো",
    mul5a08att03: "৩. গহপতিৰগ্গো",
    mul5a08att04: "৪. দানৰগ্গো",
    mul5a08att05: "৫. উপোসথৰগ্গো",
    mul5a08att06: "(৬) ১. গোতমীৰগ্গো",
    mul5a08att07: "(৭) ২. ভূমিচালৰগ্গো",
    mul5a08att08: "(৮) ৩. যমকৰগ্গো",
    mul5a08att09: "(৯) ৪. সতিৰগ্গো",
    mul5a08att10: "(১০) ৫. সামঞ্ঞৰগ্গো",
    mul5a08att11: "(১১). রাগপেয্যালং"
}
let mul5a09nav = {
    mul5a09nav01: "১. সম্বোধিৰগ্গো",
    mul5a09nav02: "২. সীহনাদৰগ্গো",
    mul5a09nav03: "৩. সত্তাৰাসৰগ্গো",
    mul5a09nav04: "৪. মহাৰগ্গো",
    mul5a09nav05: "৫. সামঞ্ঞৰগ্গো",
    mul5a09nav06: "(৬) ১. খেমৰগ্গো",
    mul5a09nav07: "(৭) ২. সতিপট্ঠানৰগ্গো",
    mul5a09nav08: "(৮) ৩. সম্মপ্পধানৰগ্গো",
    mul5a09nav09: "(৯) ৪. ইদ্ধিপাদৰগ্গো",
    mul5a09nav10: "(১০) ৫. রাগপেয্যালং"
}
let mul5a10das = {
    mul5a10das01: "১. আনিসংসৰগ্গো",
    mul5a10das02: "২. নাথৰগ্গো",
    mul5a10das03: "৩. মহাৰগ্গো",
    mul5a10das04: "৪. উপালিৰগ্গো",
    mul5a10das05: "৫. অক্কোসৰগ্গো",
    mul5a10das06: "(৬) ১. সচিত্তৰগ্গো",
    mul5a10das07: "(৭) ২. যমকৰগ্গো",
    mul5a10das08: "(৮) ৩. আকঙ্খৰগ্গো",
    mul5a10das09: "(৯) ৪. থেরৰগ্গো",
    mul5a10das10: "(১০) ৫. উপালিৰগ্গো",
    mul5a10das11: "(১১) ১. সমণসঞ্ঞাৰগ্গো",
    mul5a10das12: "(১২) ২. পচ্চোরোহণিৰগ্গো",
    mul5a10das13: "(১৩) ৩. পরিসুদ্ধৰগ্গো",
    mul5a10das14: "(১৪) ৪. সাধুৰগ্গো",
    mul5a10das15: "(১৫) ৫. অরিযৰগ্গো",
    mul5a10das16: "(১৬) ১. পুগ্গলৰগ্গো",
    mul5a10das17: "(১৭) ২. জাণুস্সোণিৰগ্গো",
    mul5a10das18: "(১৮) ৩. সাধুৰগ্গো",
    mul5a10das19: "(১৯) ৪. অরিযমগ্গৰগ্গো",
    mul5a10das20: "(২০) ৫. অপরপুগ্গলৰগ্গো",
    mul5a10das21: "(২১) ১. করজকাযৰগ্গো",
    mul5a10das22: "(২২) ২. সামঞ্ঞৰগ্গো",
    mul5a10das23: "২৩. রাগপেয্যালং"
}
let mul5a11eka = {
    mul5a11eka01: "১. নিস্সযৰগ্গো",
    mul5a11eka02: "২. অনুস্সতিৰগ্গো",
    mul5a11eka03: "৩. সামঞ্ঞৰগ্গো",
    mul5a11eka04: "৪. রাগপেয্যালং"
}


    
//khuddaka-mul
let mul6k01khu = {
    mul6k01khu01: "১. সরণত্তযং",
    mul6k01khu02: "২. দসসিক্খাপদং",
    mul6k01khu03: "৩. দ্বত্তিংসাকারো",
    mul6k01khu04: "৪. কুমারপঞ্হা",
    mul6k01khu05: "৫. মঙ্গলসুত্তং",
    mul6k01khu06: "৬. রতনসুত্তং",
    mul6k01khu07: "৭. তিরোকুট্টসুত্তং",
    mul6k01khu08: "৮. নিধিকণ্ডসুত্তং",
    mul6k01khu09: "৯. মেত্তসুত্তং"
}
let mul6k02dha = {
    mul6k02dha01: "১. যমকৰগ্গো",
    mul6k02dha02: "২. অপ্পমাদৰগ্গো",
    mul6k02dha03: "৩. চিত্তৰগ্গো",
    mul6k02dha04: "৪. পুপ্ফৰগ্গো",
    mul6k02dha05: "৫. বালৰগ্গো",
    mul6k02dha06: "৬. পণ্ডিতৰগ্গো",
    mul6k02dha07: "৭. অরহন্তৰগ্গো",
    mul6k02dha08: "৮. সহস্সৰগ্গো",
    mul6k02dha09: "৯. পাপৰগ্গো",
    mul6k02dha10: "১০. দণ্ডৰগ্গো",
    mul6k02dha11: "১১. জরাৰগ্গো",
    mul6k02dha12: "১২. অত্তৰগ্গো",
    mul6k02dha13: "১৩. লোকৰগ্গো",
    mul6k02dha14: "১৪. বুদ্ধৰগ্গো",
    mul6k02dha15: "১৫. সুখৰগ্গো",
    mul6k02dha16: "১৬. পিযৰগ্গো",
    mul6k02dha17: "১৭. কোধৰগ্গো",
    mul6k02dha18: "১৮. মলৰগ্গো",
    mul6k02dha19: "১৯. ধম্মট্ঠৰগ্গো",
    mul6k02dha20: "২০. মগ্গৰগ্গো",
    mul6k02dha21: "২১. পকিণ্ণকৰগ্গো",
    mul6k02dha22: "২২. নিরযৰগ্গো",
    mul6k02dha23: "২৩. নাগৰগ্গো",
    mul6k02dha24: "২৪. তণ্হাৰগ্গো",
    mul6k02dha25: "২৫. ভিক্খুৰগ্গো",
    mul6k02dha26: "২৬. ব্রাহ্মণৰগ্গো"
}
let mul6k03uda = {
    mul6k03uda01: "১. বোধিৰগ্গো",
    mul6k03uda02: "২. মুচলিন্দৰগ্গো",
    mul6k03uda03: "৩. নন্দৰগ্গো",
    mul6k03uda04: "৪. মেঘিযৰগ্গো",
    mul6k03uda05: "৫. সোণৰগ্গো",
    mul6k03uda06: "৬. জচ্চন্ধৰগ্গো",
    mul6k03uda07: "৭. চূল়ৰগ্গো",
    mul6k03uda08: "৮. পাটলিগামিযৰগ্গো"
}
let mul6k04iti = {
    mul6k04iti01: "১. এককনিপাতো",
    mul6k04iti02: "২. দুকনিপাতো",
    mul6k04iti03: "৩. তিকনিপাতো",
    mul6k04iti04: "৪. চতুক্কনিপাতো"
}
let mul6k05sut = {
    mul6k05sut01: "১. উরগৰগ্গো",
    mul6k05sut02: "২. চূল়ৰগ্গো",
    mul6k05sut03: "৩. মহাৰগ্গো",
    mul6k05sut04: "৪. অট্ঠকৰগ্গো",
    mul6k05sut05: "৫. পারাযনৰগ্গো"
}
let mul6k06vim = {
    mul6k06vim01: "১. ইত্থিৰিমানং",
    mul6k06vim02: "২. পুরিসৰিমানং"
}
let mul6k07pet = {
    mul6k07pet01: "১. উরগৰগ্গো",
    mul6k07pet02: "২. উব্বরিৰগ্গো",
    mul6k07pet03: "৩. চূল়ৰগ্গো",
    mul6k07pet04: "৪. মহাৰগ্গো"
}
let mul6k08the = {
    mul6k08the01: "১. এককনিপাতো",
    mul6k08the02: "২. দুকনিপাতো",
    mul6k08the03: "৩. তিকনিপাতো",
    mul6k08the04: "৪. চতুক্কনিপাতো",
    mul6k08the05: "৫. পঞ্চকনিপাতো",
    mul6k08the06: "৬. ছক্কনিপাতো",
    mul6k08the07: "৭. সত্তকনিপাতো",
    mul6k08the08: "৮. অট্ঠকনিপাতো",
    mul6k08the09: "৯. নৰকনিপাতো",
    mul6k08the10: "১০. দসকনিপাতো",
    mul6k08the11: "১১. একাদসনিপাতো",
    mul6k08the12: "১২. দ্বাদসকনিপাতো",
    mul6k08the13: "১৩. তেরসনিপাতো",
    mul6k08the14: "১৪. চুদ্দসকনিপাতো",
    mul6k08the15: "১৫. সোল়সকনিপাতো",
    mul6k08the16: "১৬. ৰীসতিনিপাতো",
    mul6k08the17: "১৭. তিংসনিপাতো",
    mul6k08the18: "১৮. চত্তালীসনিপাতো",
    mul6k08the19: "১৯. পঞ্ঞাসনিপাতো",
    mul6k08the20: "২০. সট্ঠিনিপাতো",
    mul6k08the21: "২১. মহানিপাতো"
}
let mul6k09the = {
    mul6k09the01: "১. এককনিপাতো",
    mul6k09the02: "২. দুকনিপাতো",
    mul6k09the03: "৩. তিকনিপাতো",
    mul6k09the04: "৪. চতুক্কনিপাতো",
    mul6k09the05: "৫. পঞ্চকনিপাতো",
    mul6k09the06: "৬. ছক্কনিপাতো",
    mul6k09the07: "৭. সত্তকনিপাতো",
    mul6k09the08: "৮. অট্ঠকনিপাতো",
    mul6k09the09: "৯. নৰকনিপাতো",
    mul6k09the10: "১০. একাদসকনিপাতো",
    mul6k09the11: "১১. দ্বাদসকনিপাতো",
    mul6k09the12: "১২. সোল়সনিপাতো",
    mul6k09the13: "১৩. ৰীসতিনিপাতো",
    mul6k09the14: "১৪. তিংসনিপাতো",
    mul6k09the15: "১৫. চত্তালীসনিপাতো",
    mul6k09the16: "১৬. মহানিপাতো"
}
let mul6k10apa01 = {
    mul6k10apa0101: "১. বুদ্ধৰগ্গো",
    mul6k10apa0102: "২. সীহাসনিযৰগ্গো",
    mul6k10apa0103: "৩. সুভূতিৰগ্গো",
    mul6k10apa0104: "৪. কুণ্ডধানৰগ্গো",
    mul6k10apa0105: "৫. উপালিৰগ্গো",
    mul6k10apa0106: "৬. বীজনিৰগ্গো",
    mul6k10apa0107: "৭. সকচিন্তনিযৰগ্গো",
    mul6k10apa0108: "৮. নাগসমালৰগ্গো",
    mul6k10apa0109: "৯. তিমিরৰগ্গো",
    mul6k10apa0110: "১০. সুধাৰগ্গো",
    mul6k10apa0111: "১১. ভিক্খদাযিৰগ্গো",
    mul6k10apa0112: "১২. মহাপরিৰারৰগ্গো",
    mul6k10apa0113: "১৩. সেরেয্যৰগ্গো",
    mul6k10apa0114: "১৪. সোভিতৰগ্গো",
    mul6k10apa0115: "১৫. ছত্তৰগ্গো",
    mul6k10apa0116: "১৬. বন্ধুজীৰকৰগ্গো",
    mul6k10apa0117: "১৭. সুপারিচরিযৰগ্গো",
    mul6k10apa0118: "১৮. কুমুদৰগ্গো",
    mul6k10apa0119: "১৯. কুটজপুপ্ফিযৰগ্গো",
    mul6k10apa0120: "২০. তমালপুপ্ফিযৰগ্গো",
    mul6k10apa0121: "২১. কণিকারপুপ্ফিযৰগ্গো",
    mul6k10apa0122: "২২. হত্থিৰগ্গো",
    mul6k10apa0123: "২৩. আলম্বণদাযকৰগ্গো",
    mul6k10apa0124: "২৪. উদকাসনৰগ্গো",
    mul6k10apa0125: "২৫. তুৰরদাযকৰগ্গো",
    mul6k10apa0126: "২৬. থোমকৰগ্গো",
    mul6k10apa0127: "২৭. পদুমুক্খিপৰগ্গো",
    mul6k10apa0128: "২৮. সুৰণ্ণবিব্বোহনৰগ্গো",
    mul6k10apa0129: "২৯. পণ্ণদাযকৰগ্গো",
    mul6k10apa0130: "৩০. চিতকপূজকৰগ্গো",
    mul6k10apa0131: "৩১. পদুমকেসরৰগ্গো",
    mul6k10apa0132: "৩২. আরক্খদাযকৰগ্গো",
    mul6k10apa0133: "৩৩. উমাপুপ্ফিযৰগ্গো",
    mul6k10apa0134: "৩৪. গন্ধোদকৰগ্গো",
    mul6k10apa0135: "৩৫. একপদুমিযৰগ্গো",
    mul6k10apa0136: "৩৬. সদ্দসঞ্ঞকৰগ্গো",
    mul6k10apa0137: "৩৭. মন্দারৰপুপ্ফিযৰগ্গো",
    mul6k10apa0138: "৩৮. বোধিৰন্দনৰগ্গো",
    mul6k10apa0139: "৩৯. অৰটফলৰগ্গো",
    mul6k10apa0140: "৪০. পিলিন্দৰচ্ছৰগ্গো",
    mul6k10apa0141: "৪১. মেত্তেয্যৰগ্গো",
    mul6k10apa0142: "৪২. ভদ্দালিৰগ্গো"
}
let mul6k11apa02 = {
    mul6k11apa0201: "৪৩. সকিংসম্মজ্জকৰগ্গো",
    mul6k11apa0202: "৪৪. একৰিহারিৰগ্গো",
    mul6k11apa0203: "৪৫. ৰিভীতকৰগ্গো",
    mul6k11apa0204: "৪৬. জগতিদাযকৰগ্গো",
    mul6k11apa0205: "৪৭. সালকুসুমিযৰগ্গো",
    mul6k11apa0206: "৪৮. নল়মালিৰগ্গো",
    mul6k11apa0207: "৪৯. পংসুকূলৰগ্গো",
    mul6k11apa0208: "৫০. কিঙ্কণিপুপ্ফৰগ্গো",
    mul6k11apa0209: "৫১. কণিকারৰগ্গো",
    mul6k11apa0210: "৫২. ফলদাযকৰগ্গো",
    mul6k11apa0211: "৫৩. তিণদাযকৰগ্গো",
    mul6k11apa0212: "৫৪. কচ্চাযনৰগ্গো",
    mul6k11apa0213: "৫৫. ভদ্দিযৰগ্গো",
    mul6k11apa0214: "৫৬. যসৰগ্গো",
    mul6k11apa0215: "১. সুমেধাৰগ্গো",
    mul6k11apa0216: "২. একূপোসথিকৰগ্গো",
    mul6k11apa0217: "৩. কুণ্ডলকেসীৰগ্গো",
    mul6k11apa0218: "৪. খত্তিযাৰগ্গো"
}
let mul6k12bud = {
    mul6k12bud01: "১. রতনচঙ্কমনকণ্ডং",
    mul6k12bud02: "২. সুমেধপত্থনাকথা",
    mul6k12bud03: "৩. দীপঙ্করবুদ্ধৰংসো",
    mul6k12bud04: "৪. কোণ্ডঞ্ঞবুদ্ধৰংসো",
    mul6k12bud05: "৫. মঙ্গলবুদ্ধৰংসো",
    mul6k12bud06: "৬. সুমনবুদ্ধৰংসো",
    mul6k12bud07: "৭. রেৰতবুদ্ধৰংসো",
    mul6k12bud08: "৮. সোভিতবুদ্ধৰংসো",
    mul6k12bud09: "৯. অনোমদস্সীবুদ্ধৰংসো",
    mul6k12bud10: "১০. পদুমবুদ্ধৰংসো",
    mul6k12bud11: "১১. নারদবুদ্ধৰংসো",
    mul6k12bud12: "১২. পদুমুত্তরবুদ্ধৰংসো",
    mul6k12bud13: "১৩. সুমেধবুদ্ধৰংসো",
    mul6k12bud14: "১৪. সুজাতবুদ্ধৰংসো",
    mul6k12bud15: "১৫. পিযদস্সীবুদ্ধৰংসো",
    mul6k12bud16: "১৬. অত্থদস্সীবুদ্ধৰংসো",
    mul6k12bud17: "১৭. ধম্মদস্সীবুদ্ধৰংসো",
    mul6k12bud18: "১৮. সিদ্ধত্থবুদ্ধৰংসো",
    mul6k12bud19: "১৯. তিস্সবুদ্ধৰংসো",
    mul6k12bud20: "২০. ফুস্সবুদ্ধৰংসো",
    mul6k12bud21: "২১. ৰিপস্সীবুদ্ধৰংসো",
    mul6k12bud22: "২২. সিখীবুদ্ধৰংসো",
    mul6k12bud23: "২৩. ৰেস্সভূবুদ্ধৰংসো",
    mul6k12bud24: "২৪. ককুসন্ধবুদ্ধৰংসো",
    mul6k12bud25: "২৫. কোণাগমনবুদ্ধৰংসো",
    mul6k12bud26: "২৬. কস্সপবুদ্ধৰংসো",
    mul6k12bud27: "২৭. গোতমবুদ্ধৰংসো",
    mul6k12bud28: "২৮. বুদ্ধপকিণ্ণককণ্ডং",
    mul6k12bud29: "২৯. ধাতুভাজনীযকথা"
}
let mul6k13car = {
    mul6k13car01: "১. অকিত্তিৰগ্গো",
    mul6k13car02: "২. হত্থিনাগৰগ্গো",
    mul6k13car03: "৩. যুধঞ্জযৰগ্গো"
}
let mul6k14jat01 = {
    mul6k14jat0101: "১. এককনিপাতো",
    mul6k14jat0102: "২. দুকনিপাতো",
    mul6k14jat0103: "৩. তিকনিপাতো",
    mul6k14jat0104: "৪. চতুক্কনিপাতো",
    mul6k14jat0105: "৫. পঞ্চকনিপাতো",
    mul6k14jat0106: "৬. ছক্কনিপাতো",
    mul6k14jat0107: "৭. সত্তকনিপাতো",
    mul6k14jat0108: "৮. অট্ঠকনিপাতো",
    mul6k14jat0109: "৯. নৰকনিপাতো",
    mul6k14jat0110: "১০. দসকনিপাতো",
    mul6k14jat0111: "১১. একাদসকনিপাতো",
    mul6k14jat0112: "১২. দ্বাদসকনিপাতো",
    mul6k14jat0113: "১৩. তেরসকনিপাতো",
    mul6k14jat0114: "১৪. পকিণ্ণকনিপাতো",
    mul6k14jat0115: "১৫. ৰীসতিনিপাতো",
    mul6k14jat0116: "১৬. তিংসনিপাতো"
}
let mul6k15jat02 = {
    mul6k15jat0201: "১৭. চত্তালীসনিপাতো",
    mul6k15jat0202: "১৮. পণ্ণাসনিপাতো",
    mul6k15jat0203: "১৯. সট্ঠিনিপাতো",
    mul6k15jat0204: "২০. সত্ততিনিপাতো",
    mul6k15jat0205: "২১. অসীতিনিপাতো",
    mul6k15jat0206: "২২. মহানিপাতো"
}
let mul6k16mah = {
    mul6k16mah01: "১. কামসুত্তনিদ্দেসো",
    mul6k16mah02: "২. গুহট্ঠকসুত্তনিদ্দেসো",
    mul6k16mah03: "৩. দুট্ঠট্ঠকসুত্তনিদ্দেসো",
    mul6k16mah04: "৪. সুদ্ধট্ঠকসুত্তনিদ্দেসো",
    mul6k16mah05: "৫. পরমট্ঠকসুত্তনিদ্দেসো",
    mul6k16mah06: "৬. জরাসুত্তনিদ্দেসো",
    mul6k16mah07: "৭. তিস্সমেত্তেয্যসুত্তনিদ্দেসো",
    mul6k16mah08: "৮. পসূরসুত্তনিদ্দেসো",
    mul6k16mah09: "৯. মাগণ্ডিযসুত্তনিদ্দেসো",
    mul6k16mah10: "১০. পুরাভেদসুত্তনিদ্দেসো",
    mul6k16mah11: "১১. কলহৰিৰাদসুত্তনিদ্দেসো",
    mul6k16mah12: "১২. চূল়ব্যূহসুত্তনিদ্দেসো",
    mul6k16mah13: "১৩. মহাব্যূহসুত্তনিদ্দেসো",
    mul6k16mah14: "১৪. তুৰটকসুত্তনিদ্দেসো",
    mul6k16mah15: "১৫. অত্তদণ্ডসুত্তনিদ্দেসো",
    mul6k16mah16: "১৬. সারিপুত্তসুত্তনিদ্দেসো"
}
let mul6k17cul = {
    mul6k17cul01: "পারাযনৰগ্গো",
    mul6k17cul02: "পারাযনৰগ্গনিদ্দেসো",
    mul6k17cul03: "খগ্গৰিসাণসুত্তো"
}
let mul6k18pat = {
    mul6k18pat01: "১. মহাৰগ্গো",
    mul6k18pat02: "২. যুগনদ্ধৰগ্গো",
    mul6k18pat03: "৩. পঞ্ঞাৰগ্গো"
}
let mul6k19net = {
    mul6k19net01: "১. সঙ্গহৰারো",
    mul6k19net02: "২. উদ্দেসৰারো",
    mul6k19net03: "৩. নিদ্দেসৰারো",
    mul6k19net04: "৪. পটিনিদ্দেসৰারো",
    mul6k19net05: "নযসমুট্ঠানং",
    mul6k19net06: "সাসনপট্ঠানং"
}
let mul6k20mil = {
    mul6k20mil01: "মিলিন্দপঞ্হপাল়ি",
    mul6k20mil02: "২-৩. মিলিন্দপঞ্হো",
    mul6k20mil03: "৪. মেণ্ডকপঞ্হো",
    mul6k20mil04: "৫. অনুমানপঞ্হো",
    mul6k20mil05: "৬. ওপম্মকথাপঞ্হো"
}
let mul6k21pet = {
    mul6k21pet01: "১. অরিযসচ্চপ্পকাসনপঠমভূমি",
    mul6k21pet02: "২. সাসনপট্ঠানদুতিযভূমি",
    mul6k21pet03: "৩. সুত্তাধিট্ঠানততিযভূমি",
    mul6k21pet04: "৪. সুত্তৰিচযচতুত্থভূমি",
    mul6k21pet05: "৫. পঞ্চমভূমি",
    mul6k21pet06: "৬. সুত্তত্থসমুচ্চযভূমি",
    mul6k21pet07: "৭. হারসম্পাতভূমি",
    mul6k21pet08: "৮. সুত্তৰেভঙ্গিযং"
}

//digha-att
let att2d01sil = {
    att2d01sil01:"গন্থারম্ভকথা",
    att2d01sil02:"১. ব্রহ্মজালসুত্তৰণ্ণনা",
    att2d01sil03:"২. সামঞ্ঞফলসুত্তৰণ্ণনা",
    att2d01sil04:"৩. অম্বট্ঠসুত্তৰণ্ণনা",
    att2d01sil05:"৪. সোণদণ্ডসুত্তৰণ্ণনা",
    att2d01sil06:"৫. কূটদন্তসুত্তৰণ্ণনা",
    att2d01sil07:"৬. মহালিসুত্তৰণ্ণনা",
    att2d01sil08:"৭. জালিযসুত্তৰণ্ণনা",
    att2d01sil09:"৮. মহাসীহনাদসুত্তৰণ্ণনা",
    att2d01sil10:"৯. পোট্ঠপাদসুত্তৰণ্ণনা",
    att2d01sil11:"১০. সুভসুত্তৰণ্ণনা",
    att2d01sil12:"১১. কেৰট্টসুত্তৰণ্ণনা",
    att2d01sil13:"১২. লোহিচ্চসুত্তৰণ্ণনা",
    att2d01sil14:"১৩. তেৰিজ্জসুত্তৰণ্ণনা"
}
let att2d02mah = {
    att2d02mah01:"১. মহাপদানসুত্তৰণ্ণনা",
    att2d02mah02:"২. মহানিদানসুত্তৰণ্ণনা",
    att2d02mah03:"৩. মহাপরিনিব্বানসুত্তৰণ্ণনা",
    att2d02mah04:"৪. মহাসুদস্সনসুত্তৰণ্ণনা",
    att2d02mah05:"৫. জনৰসভসুত্তৰণ্ণনা",
    att2d02mah06:"৬. মহাগোৰিন্দসুত্তৰণ্ণনা",
    att2d02mah07:"৭. মহাসমযসুত্তৰণ্ণনা",
    att2d02mah08:"৮. সক্কপঞ্হসুত্তৰণ্ণনা",
    att2d02mah09:"৯. মহাসতিপট্ঠানসুত্তৰণ্ণনা",
    att2d02mah10:"১০. পাযাসিরাজঞ্ঞসুত্তৰণ্ণনা"
}
let att2d03pat = {
    att2d03pat01:"১. পাথিকসুত্তৰণ্ণনা",
    att2d03pat02:"২. উদুম্বরিকসুত্তৰণ্ণনা",
    att2d03pat03:"৩. চক্কৰত্তিসুত্তৰণ্ণনা",
    att2d03pat04:"৪. অগ্গঞ্ঞসুত্তৰণ্ণনা",
    att2d03pat05:"৫. সম্পসাদনীযসুত্তৰণ্ণনা",
    att2d03pat06:"৬. পাসাদিকসুত্তৰণ্ণনা",
    att2d03pat07:"৭. লক্খণসুত্তৰণ্ণনা",
    att2d03pat08:"৮. সিঙ্গালসুত্তৰণ্ণনা",
    att2d03pat09:"৯. আটানাটিযসুত্তৰণ্ণনা",
    att2d03pat10:"১০. সঙ্গীতিসুত্তৰণ্ণনা",
    att2d03pat11:"১১. দসুত্তরসুত্তৰণ্ণনা"
}

//majjhima-att
let att3m01mul = {
    att3m01mul01:"গন্থারম্ভকথা",
    att3m01mul02:"১. মূলপরিযাযৰগ্গো",
    att3m01mul03:"২. সীহনাদৰগ্গো",
    att3m01mul04:"৩. ওপম্মৰগ্গো",
    att3m01mul05:"৪. মহাযমকৰগ্গো",
    att3m01mul06:"৫. চূল়যমকৰগ্গো"
}
let att3m02maj = {
    att3m02maj01:"১. গহপতিৰগ্গো",
    att3m02maj02:"২. ভিক্খুৰগ্গো",
    att3m02maj03:"৩. পরিব্বাজকৰগ্গো",
    att3m02maj04:"৪. রাজৰগ্গো",
    att3m02maj05:"৫. ব্রাহ্মণৰগ্গো"
}
let att3m03upa = {
    att3m03upa01:"১. দেৰদহৰগ্গো",
    att3m03upa02:"২. অনুপদৰগ্গো",
    att3m03upa03:"৩. সুঞ্ঞতৰগ্গো",
    att3m03upa04:"৪. ৰিভঙ্গৰগ্গো",
    att3m03upa05:"৫. সল়াযতনৰগ্গো"
}

//samyutta-att
let att4s01sag = {
    att4s01sag01:"গন্থারম্ভকথা",
    att4s01sag02:"১. দেৰতাসংযুত্তং",
    att4s01sag03:"২. দেৰপুত্তসংযুত্তং",
    att4s01sag04:"৩. কোসলসংযুত্তং",
    att4s01sag05:"৪. মারসংযুত্তং",
    att4s01sag06:"৫. ভিক্খুনীসংযুত্তং",
    att4s01sag07:"৬. ব্রহ্মসংযুত্তং",
    att4s01sag08:"৭. ব্রাহ্মণসংযুত্তং",
    att4s01sag09:"৮. ৰঙ্গীসসংযুত্তং",
    att4s01sag10:"৯. ৰনসংযুত্তং",
    att4s01sag11:"১০. যক্খসংযুত্তং",
    att4s01sag12:"১১. সক্কসংযুত্তং"
}
let att4s02nid = {
    att4s02nid01:"১. নিদানসংযুত্তং",
    att4s02nid02:"২. অভিসমযসংযুত্তং",
    att4s02nid03:"৩. ধাতুসংযুত্তং",
    att4s02nid04:"৪. অনমতগ্গসংযুত্তং",
    att4s02nid05:"৫. কস্সপসংযুত্তং",
    att4s02nid06:"৬. লাভসক্কারসংযুত্তং",
    att4s02nid07:"৭. রাহুলসংযুত্তং",
    att4s02nid08:"৮. লক্খণসংযুত্তং",
    att4s02nid09:"৯. ওপম্মসংযুত্তং",
    att4s02nid10:"১০. ভিক্খুসংযুত্তং"
}
let att4s03kha = {
    att4s03kha01:"১. খন্ধসংযুত্তং",
    att4s03kha02:"২. রাধসংযুত্তং",
    att4s03kha03:"৩. দিট্ঠিসংযুত্তং",
    att4s03kha04:"৪. ওক্কন্তসংযুত্তং",
    att4s03kha05:"৫. উপ্পাদসংযুত্তৰণ্ণনা",
    att4s03kha06:"৬. কিলেসসংযুত্তৰণ্ণনা",
    att4s03kha07:"৭. সারিপুত্তসংযুত্তং",
    att4s03kha08:"৮. নাগসংযুত্তং",
    att4s03kha09:"৯. সুপণ্ণসংযুত্তৰণ্ণনা",
    att4s03kha10:"১০. গন্ধব্বকাযসংযুত্তৰণ্ণনা",
    att4s03kha11:"১১. ৰলাহকসংযুত্তৰণ্ণনা",
    att4s03kha12:"১২. ৰচ্ছগোত্তসংযুত্তৰণ্ণনা",
    att4s03kha13:"১৩. ঝানসংযুত্তং"
}
let att4s04sal = {
    att4s04sal01:"১. সল়াযতনসংযুত্তং",
    att4s04sal02:"২. ৰেদনাসংযুত্তং",
    att4s04sal03:"৩. মাতুগামসংযুত্তং",
    att4s04sal04:"৪. জম্বুখাদকসংযুত্তং",
    att4s04sal05:"৫. সামণ্ডকসংযুত্তৰণ্ণনা",
    att4s04sal06:"৬. মোগ্গল্লানসংযুত্তং",
    att4s04sal07:"৭. চিত্তসংযুত্তং",
    att4s04sal08:"৮. গামণিসংযুত্তং",
    att4s04sal09:"৯. অসঙ্খতসংযুত্তং",
    att4s04sal10:"১০. অব্যাকতসংযুত্তং"
}
let att4s05mah = {
    att4s05mah01:"১. মগ্গসংযুত্তং",
    att4s05mah02:"২. বোজ্ঝঙ্গসংযুত্তং",
    att4s05mah03:"৩. সতিপট্ঠানসংযুত্তং",
    att4s05mah04:"৪. ইন্দ্রিযসংযুত্তং",
    att4s05mah05:"৫. সম্মপ্পধানসংযুত্তৰণ্ণনা",
    att4s05mah06:"৬. বলসংযুত্তৰণ্ণনা",
    att4s05mah07:"৭. ইদ্ধিপাদসংযুত্তং",
    att4s05mah08:"৮. অনুরুদ্ধসংযুত্তং",
    att4s05mah09:"৯. ঝানসংযুত্তৰণ্ণনা",
    att4s05mah10:"১০. আনাপানসংযুত্তং",
    att4s05mah11:"১১. সোতাপত্তিসংযুত্তং",
    att4s05mah12:"১২. সচ্চসংযুত্তং"
}

//anguttara-att
let att5a01eka = {
    att5a01eka01:"গন্থারম্ভকথা",
    att5a01eka02:"১. রূপাদিৰগ্গৰণ্ণনা",
    att5a01eka03:"২. নীৰরণপ্পহানৰগ্গৰণ্ণনা",
    att5a01eka04:"৩. অকম্মনিযৰগ্গৰণ্ণনা",
    att5a01eka05:"৪. অদন্তৰগ্গৰণ্ণনা",
    att5a01eka06:"৫. পণিহিতঅচ্ছৰগ্গৰণ্ণনা",
    att5a01eka07:"৬. অচ্ছরাসঙ্ঘাতৰগ্গৰণ্ণনা",
    att5a01eka08:"৭. ৰীরিযারম্ভাদিৰগ্গৰণ্ণনা",
    att5a01eka09:"৮. কল্যাণমিত্ততাদিৰগ্গৰণ্ণনা",
    att5a01eka10:"৯. পমাদাদিৰগ্গৰণ্ণনা",
    att5a01eka11:"১০. দুতিযপমাদাদিৰগ্গৰণ্ণনা",
    att5a01eka12:"১১. অধম্মৰগ্গৰণ্ণনা",
    att5a01eka13:"১৩. একপুগ্গলৰগ্গৰণ্ণনা",
    att5a01eka14:"১৪. এতদগ্গৰগ্গো",
    att5a01eka15:"১৫. অট্ঠানপাল়ি",
    att5a01eka16:"১৬. একধম্মপাল়ি",
    att5a01eka17:"১৭. পসাদকরধম্মৰগ্গৰণ্ণনা",
    att5a01eka18:"১৮. অপরঅচ্ছরাসঙ্ঘাতৰগ্গৰণ্ণনা",
    att5a01eka19:"১৯. কাযগতাসতিৰগ্গৰণ্ণনা",
    att5a01eka20:"২০. অমতৰগ্গৰণ্ণনা"
}
let att5a02duk = {
    att5a02duk01:"১. কম্মকারণৰগ্গো",
    att5a02duk02:"২. অধিকরণৰগ্গৰণ্ণনা",
    att5a02duk03:"৩. বালৰগ্গৰণ্ণনা",
    att5a02duk04:"৪. সমচিত্তৰগ্গৰণ্ণনা",
    att5a02duk05:"৫. পরিসৰগ্গৰণ্ণনা",
    att5a02duk06:"(৬) ১. পুগ্গলৰগ্গৰণ্ণনা",
    att5a02duk07:"(৭) ২. সুখৰগ্গৰণ্ণনা",
    att5a02duk08:"(৮) ৩. সনিমিত্তৰগ্গৰণ্ণনা",
    att5a02duk09:"(৯) ৪. ধম্মৰগ্গৰণ্ণনা",
    att5a02duk10:"(১০) ৫. বালৰগ্গৰণ্ণনা",
    att5a02duk11:"(১১) ১. আসাদুপ্পজহৰগ্গৰণ্ণনা",
    att5a02duk12:"(১২) ২. আযাচনৰগ্গৰণ্ণনা",
    att5a02duk13:"(১৩) ৩. দানৰগ্গৰণ্ণনা",
    att5a02duk14:"(১৪) ৪. সন্থারৰগ্গৰণ্ণনা",
    att5a02duk15:"(১৫) ৫. সমাপত্তিৰগ্গৰণ্ণনা",
    att5a02duk16:"১. কোধপেয্যালং",
    att5a02duk17:"২. অকুসলপেয্যালং",
    att5a02duk18:"৩. ৰিনযপেয্যালং",
    att5a02duk19:"৪. রাগপেয্যালং"
}
let att5a03tik = {
    att5a03tik01:"১. বালৰগ্গো",
    att5a03tik02:"২. রথকারৰগ্গো",
    att5a03tik03:"৩. পুগ্গলৰগ্গো",
    att5a03tik04:"৪. দেৰদূতৰগ্গো",
    att5a03tik05:"৫. চূল়ৰগ্গো",
    att5a03tik06:"(৬) ১. ব্রাহ্মণৰগ্গো",
    att5a03tik07:"(৭) ২. মহাৰগ্গো",
    att5a03tik08:"(৮) ৩. আনন্দৰগ্গো",
    att5a03tik09:"(৯) ৪. সমণৰগ্গো",
    att5a03tik10:"(১০) ৫. লোণকপল্লৰগ্গো",
    att5a03tik11:"(১১) ১. সম্বোধৰগ্গো",
    att5a03tik12:"(১২) ২. আপাযিকৰগ্গো",
    att5a03tik13:"(১৩) ৩. কুসিনারৰগ্গো",
    att5a03tik14:"(১৪) ৪. যোধাজীৰৰগ্গো",
    att5a03tik15:"(১৫) ৫. মঙ্গলৰগ্গো",
    att5a03tik16:"(১৬) ৬. অচেলকৰগ্গৰণ্ণনা",
    att5a03tik17:"১৭-১৮. পেয্যালৰগ্গাদিৰণ্ণনা"
}
let att5a04cat = {
    att5a04cat01:"১. ভণ্ডগামৰগ্গো",
    att5a04cat02:"২. চরৰগ্গো",
    att5a04cat03:"৩. উরুৰেলৰগ্গো",
    att5a04cat04:"৪. চক্কৰগ্গো",
    att5a04cat05:"৫. রোহিতস্সৰগ্গো",
    att5a04cat06:"(৬) ১. পুঞ্ঞাভিসন্দৰগ্গো",
    att5a04cat07:"(৭) ২. পত্তকম্মৰগ্গো",
    att5a04cat08:"(৮) ৩. অপণ্ণকৰগ্গো",
    att5a04cat09:"(৯) ৪. মচলৰগ্গো",
    att5a04cat10:"(১০) ৫. অসুরৰগ্গো",
    att5a04cat11:"(১১) ১. ৰলাহকৰগ্গো",
    att5a04cat12:"(১২) ২. কেসিৰগ্গো",
    att5a04cat13:"(১৩) ৩. ভযৰগ্গো",
    att5a04cat14:"(১৪) ৪. পুগ্গলৰগ্গো",
    att5a04cat15:"(১৫) ৫. আভাৰগ্গো",
    att5a04cat16:"(১৬) ১. ইন্দ্রিযৰগ্গো",
    att5a04cat17:"(১৭) ২. পটিপদাৰগ্গো",
    att5a04cat18:"(১৮) ৩. সঞ্চেতনিযৰগ্গো",
    att5a04cat19:"(১৯) ৪. ব্রাহ্মণৰগ্গো",
    att5a04cat20:"(২০) ৫. মহাৰগ্গো",
    att5a04cat21:"(২১) ১. সপ্পুরিসৰগ্গো",
    att5a04cat22:"(২২) ২. পরিসাৰগ্গো",
    att5a04cat23:"(২৩) ৩. দুচ্চরিতৰগ্গৰণ্ণনা",
    att5a04cat24:"(২৪) ৪. কম্মৰগ্গো",
    att5a04cat25:"(২৫) ৫. আপত্তিভযৰগ্গো",
    att5a04cat26:"(২৬) ৬. অভিঞ্ঞাৰগ্গো",
    att5a04cat27:"(২৭) ৭. কম্মপথৰগ্গৰণ্ণনা",
    att5a04cat28:"(২৮) ৮. রাগপেয্যালৰণ্ণনা"
}
let att5a05pan = {
    att5a05pan01:"১. সেখবলৰগ্গো",
    att5a05pan02:"২. বলৰগ্গো",
    att5a05pan03:"৩. পঞ্চঙ্গিকৰগ্গো",
    att5a05pan04:"৪. সুমনৰগ্গো",
    att5a05pan05:"৫. মুণ্ডরাজৰগ্গো",
    att5a05pan06:"(৬) ১. নীৰরণৰগ্গো",
    att5a05pan07:"(৭) ২. সঞ্ঞাৰগ্গো",
    att5a05pan08:"(৮) ৩. যোধাজীৰৰগ্গো",
    att5a05pan09:"(৯) ৪. থেরৰগ্গো",
    att5a05pan10:"(১০) ৫. ককুধৰগ্গো",
    att5a05pan11:"(১১) ১. ফাসুৰিহারৰগ্গো",
    att5a05pan12:"(১২) ২. অন্ধকৰিন্দৰগ্গো",
    att5a05pan13:"(১৩) ৩. গিলানৰগ্গো",
    att5a05pan14:"(১৪) ৪. রাজৰগ্গো",
    att5a05pan15:"(১৫) ৫. তিকণ্ডকীৰগ্গো",
    att5a05pan16:"(১৬) ১. সদ্ধম্মৰগ্গো",
    att5a05pan17:"(১৭) ২. আঘাতৰগ্গো",
    att5a05pan18:"(১৮) ৩. উপাসকৰগ্গো",
    att5a05pan19:"(১৯) ৪. অরঞ্ঞৰগ্গো",
    att5a05pan20:"(২০) ৫. ব্রাহ্মণৰগ্গো",
    att5a05pan21:"(২১) ১. কিমিলৰগ্গো",
    att5a05pan22:"(২২) ২. অক্কোসকৰগ্গো",
    att5a05pan23:"(২৩) ৩. দীঘচারিকৰগ্গো",
    att5a05pan24:"(২৪) ৪. আৰাসিকৰগ্গো",
    att5a05pan25:"(২৫) ৫. দুচ্চরিতৰগ্গো",
    att5a05pan26:"(২৬) ৬. উপসম্পদাৰগ্গো"
}
let att5a06cha = {
    att5a06cha01:"১. আহুনেয্যৰগ্গো",
    att5a06cha02:"২. সারণীযৰগ্গো",
    att5a06cha03:"৩. অনুত্তরিযৰগ্গো",
    att5a06cha04:"৪. দেৰতাৰগ্গো",
    att5a06cha05:"৫. ধম্মিকৰগ্গো",
    att5a06cha06:"৬. মহাৰগ্গো",
    att5a06cha07:"৭. দেৰতাৰগ্গো",
    att5a06cha08:"৮. অরহত্তৰগ্গো",
    att5a06cha09:"৯. সীতিৰগ্গো",
    att5a06cha10:"১০. আনিসংসৰগ্গো",
    att5a06cha11:"১১. তিকৰগ্গো",
    att5a06cha12:"১২. সামঞ্ঞৰগ্গৰণ্ণনা",
    att5a06cha13:"২৪. রাগপেয্যালৰণ্ণনা"
}
let att5a07sat = {
    att5a07sat01:"১. ধনৰগ্গো",
    att5a07sat02:"২. অনুসযৰগ্গো",
    att5a07sat03:"৩. ৰজ্জিসত্তকৰগ্গো",
    att5a07sat04:"৪. দেৰতাৰগ্গো",
    att5a07sat05:"৫. মহাযঞ্ঞৰগ্গো",
    att5a07sat06:"৬. অব্যাকতৰগ্গো",
    att5a07sat07:"৭. মহাৰগ্গো",
    att5a07sat08:"৮. ৰিনযৰগ্গো"
}
let att5a08att = {
    att5a08att01:"১. মেত্তাৰগ্গো",
    att5a08att02:"২. মহাৰগ্গো",
    att5a08att03:"৩. গহপতিৰগ্গো",
    att5a08att04:"৪. দানৰগ্গো",
    att5a08att05:"৫. উপোসথৰগ্গো",
    att5a08att06:"(৬) ১. গোতমীৰগ্গো",
    att5a08att07:"(৭) ২. ভূমিচালৰগ্গো",
    att5a08att08:"(৮) ৩. যমকৰগ্গো",
    att5a08att09:"(৯) ৪. সতিৰগ্গো",
    att5a08att10:"(১০) ৫. সামঞ্ঞৰগ্গো"
}
let att5a09nav = {
    att5a09nav01:"১. সম্বোধিৰগ্গো",
    att5a09nav02:"২. সীহনাদৰগ্গো",
    att5a09nav03:"৩. সত্তাৰাসৰগ্গো",
    att5a09nav04:"৪. মহাৰগ্গো",
    att5a09nav05:"৫. সামঞ্ঞৰগ্গো"
}
let att5a10das = {
    att5a10das01:"১. আনিসংসৰগ্গো",
    att5a10das02:"২. নাথৰগ্গো",
    att5a10das03:"৩. মহাৰগ্গো",
    att5a10das04:"৪. উপালিৰগ্গো",
    att5a10das05:"৫. অক্কোসৰগ্গো",
    att5a10das06:"(৬) ১. সচিত্তৰগ্গো",
    att5a10das07:"(৭) ২. যমকৰগ্গো",
    att5a10das08:"(৮) ৩. আকঙ্খৰগ্গো",
    att5a10das09:"(৯) ৪. থেরৰগ্গো",
    att5a10das10:"(১০) ৫. উপালিৰগ্গো",
    att5a10das11:"(১১) ১. সমণসঞ্ঞাৰগ্গো",
    att5a10das12:"(১২) ২. পচ্চোরোহণিৰগ্গো",
    att5a10das13:"(১৩) ৩. পরিসুদ্ধৰগ্গৰণ্ণনা",
    att5a10das14:"(১৪) ৪. সাধুৰগ্গৰণ্ণনা",
    att5a10das15:"(২১) ১. করজকাযৰগ্গো",
    att5a10das16:"(২২) ২. সামঞ্ঞৰগ্গৰণ্ণনা"
}
let att5a11eka = {
    att5a11eka01:"১. নিস্সযৰগ্গো",
    att5a11eka02:"২. অনুস্সতিৰগ্গো"
}

//khuddaka-att
let att6k01khu = {
    att6k01khu01:"গন্থারম্ভকথা",
    att6k01khu02:"১. সরণত্তযৰণ্ণনা",
    att6k01khu03:"২. সিক্খাপদৰণ্ণনা",
    att6k01khu04:"৩. দ্বত্তিংসাকারৰণ্ণনা",
    att6k01khu05:"৪. কুমারপঞ্হৰণ্ণনা",
    att6k01khu06:"৫. মঙ্গলসুত্তৰণ্ণনা",
    att6k01khu07:"৬. রতনসুত্তৰণ্ণনা",
    att6k01khu08:"৭. তিরোকুট্টসুত্তৰণ্ণনা",
    att6k01khu09:"৮. নিধিকণ্ডসুত্তৰণ্ণনা",
    att6k01khu10:"৯. মেত্তসুত্তৰণ্ণনা"
}
let att6k02dha = {
    att6k02dha01:"গন্থারম্ভকথা",
    att6k02dha02:"১. যমকৰগ্গো",
    att6k02dha03:"২. অপ্পমাদৰগ্গো",
    att6k02dha04:"৩. চিত্তৰগ্গো",
    att6k02dha05:"৪. পুপ্ফৰগ্গো",
    att6k02dha06:"৫. বালৰগ্গো",
    att6k02dha07:"৬. পণ্ডিতৰগ্গো",
    att6k02dha08:"৭. অরহন্তৰগ্গো",
    att6k02dha09:"৮. সহস্সৰগ্গো",
    att6k02dha10:"৯. পাপৰগ্গো",
    att6k02dha11:"১০. দণ্ডৰগ্গো",
    att6k02dha12:"১১. জরাৰগ্গো",
    att6k02dha13:"১২. অত্তৰগ্গো",
    att6k02dha14:"১৩. লোকৰগ্গো",
    att6k02dha15:"১৪. বুদ্ধৰগ্গো",
    att6k02dha16:"১৫. সুখৰগ্গো",
    att6k02dha17:"১৬. পিযৰগ্গো",
    att6k02dha18:"১৭. কোধৰগ্গো",
    att6k02dha19:"১৮. মলৰগ্গো",
    att6k02dha20:"১৯. ধম্মট্ঠৰগ্গো",
    att6k02dha21:"২০. মগ্গৰগ্গো",
    att6k02dha22:"২১. পকিণ্ণকৰগ্গো",
    att6k02dha23:"২২. নিরযৰগ্গো",
    att6k02dha24:"২৩. নাগৰগ্গো",
    att6k02dha25:"২৪. তণ্হাৰগ্গো",
    att6k02dha26:"২৫. ভিক্খুৰগ্গো",
    att6k02dha27:"২৬. ব্রাহ্মণৰগ্গো"
}
let att6k03uda = {
    att6k03uda01:"গন্থারম্ভকথা",
    att6k03uda02:"১. বোধিৰগ্গো",
    att6k03uda03:"২. মুচলিন্দৰগ্গো",
    att6k03uda04:"৩. নন্দৰগ্গো",
    att6k03uda05:"৪. মেঘিযৰগ্গো",
    att6k03uda06:"৫. সোণৰগ্গো",
    att6k03uda07:"৬. জচ্চন্ধৰগ্গো",
    att6k03uda08:"৭. চূল়ৰগ্গো",
    att6k03uda09:"৮. পাটলিগামিযৰগ্গো"
}
let att6k04iti = {
    att6k04iti01:"গন্থারম্ভকথা",
    att6k04iti02:"১. এককনিপাতো",
    att6k04iti03:"২. দুকনিপাতো",
    att6k04iti04:"৩. তিকনিপাতো",
    att6k04iti05:"৪. চতুক্কনিপাতো"
}
let att6k05sut = {
    att6k05sut01:"১. উরগৰগ্গো",
    att6k05sut02:"২. চূল়ৰগ্গো",
    att6k05sut03:"৩. মহাৰগ্গো",
    att6k05sut04:"৪. অট্ঠকৰগ্গো",
    att6k05sut05:"৫. পারাযনৰগ্গো"
}
let att6k06vim = {
    att6k06vim01:"গন্থারম্ভকথা",
    att6k06vim02:"১. ইত্থিৰিমানং",
    att6k06vim03:"২. পুরিসৰিমানং"
}
let att6k07pet = {
    att6k07pet01:"গন্থারম্ভকথা",
    att6k07pet02:"১. উরগৰগ্গো",
    att6k07pet03:"২. উব্বরিৰগ্গো",
    att6k07pet04:"৩. চূল়ৰগ্গো",
    att6k07pet05:"৪. মহাৰগ্গো"
}
let att6k08the = {
    att6k08the01:"গন্থারম্ভকথা",
    att6k08the02:"১. এককনিপাতো",
    att6k08the03:"২. দুকনিপাতো",
    att6k08the04:"৩. তিকনিপাতো",
    att6k08the05:"৪. চতুক্কনিপাতো",
    att6k08the06:"৫. পঞ্চকনিপাতো",
    att6k08the07:"৬. ছক্কনিপাতো",
    att6k08the08:"৭. সত্তকনিপাতো",
    att6k08the09:"৮. অট্ঠকনিপাতো",
    att6k08the10:"৯. নৰকনিপাতো",
    att6k08the11:"১০. দসকনিপাতো",
    att6k08the12:"১১. একাদসনিপাতো",
    att6k08the13:"১২. দ্বাদসকনিপাতো",
    att6k08the14:"১৩. তেরসনিপাতো",
    att6k08the15:"১৪. চুদ্দসকনিপাতো",
    att6k08the16:"১৫. সোল়সকনিপাতো",
    att6k08the17:"১৬. ৰীসতিনিপাতো",
    att6k08the18:"১৭. তিংসনিপাতো",
    att6k08the19:"১৮. চত্তালীসনিপাতো",
    att6k08the20:"১৯. পঞ্ঞাসনিপাতো",
    att6k08the21:"২০. সট্ঠিনিপাতো",
    att6k08the22:"২১. মহানিপাতো"
}
let att6k09the = {
    att6k09the01:"১. এককনিপাতো",
    att6k09the02:"২. দুকনিপাতো",
    att6k09the03:"৩. তিকনিপাতো",
    att6k09the04:"৪. চতুক্কনিপাতো",
    att6k09the05:"৫. পঞ্চকনিপাতো",
    att6k09the06:"৬. ছক্কনিপাতো",
    att6k09the07:"৭. সত্তকনিপাতো",
    att6k09the08:"৮. অট্ঠকনিপাতো",
    att6k09the09:"৯. নৰকনিপাতো",
    att6k09the10:"১০. একাদসকনিপাতো",
    att6k09the11:"১১. দ্বাদসকনিপাতো",
    att6k09the12:"১২. সোল়সনিপাতো",
    att6k09the13:"১৩. ৰীসতিনিপাতো",
    att6k09the14:"১৪. তিংসনিপাতো",
    att6k09the15:"১৫. চত্তালীসনিপাতো",
    att6k09the16:"১৬. মহানিপাতো"
}
let att6k10apa = {
    att6k10apa01:"গন্থারম্ভকথা",
    att6k10apa02:"১. বুদ্ধৰগ্গো",
    att6k10apa03:"২. সীহাসনিযৰগ্গো",
    att6k10apa04:"৩. সুভূতিৰগ্গো",
    att6k10apa05:"৪. কুণ্ডধানৰগ্গো",
    att6k10apa06:"৫. উপালিৰগ্গো",
    att6k10apa07:"৬. বীজনিৰগ্গো",
    att6k10apa08:"৭. সকচিন্তনিযৰগ্গো",
    att6k10apa09:"৮. নাগসমালৰগ্গো",
    att6k10apa10:"৯. তিমিরৰগ্গো",
    att6k10apa11:"১০. সুধাৰগ্গো",
    att6k10apa12:"১১. ভিক্খদাযিৰগ্গো",
    att6k10apa13:"১২. মহাপরিৰারৰগ্গো",
    att6k10apa14:"১৩. সেরেয্যৰগ্গো",
    att6k10apa15:"১৪. সোভিতৰগ্গো",
    att6k10apa16:"১৫. ছত্তৰগ্গো",
    att6k10apa17:"১৬. বন্ধুজীৰকৰগ্গো",
    att6k10apa18:"১৭. সুপারিচরিযৰগ্গো",
    att6k10apa19:"১৮. কুমুদৰগ্গো",
    att6k10apa20:"১৯. কুটজপুপ্ফিযৰগ্গো",
    att6k10apa21:"২০. তমালপুপ্ফিযৰগ্গো",
    att6k10apa22:"২১-২৩. কণিকারপুপ্ফিযাদিৰগ্গো",
    att6k10apa23:"২৪. উদকাসনৰগ্গো",
    att6k10apa24:"২৫. তুৰরদাযকৰগ্গো",
    att6k10apa25:"২৬. থোমকৰগ্গো",
    att6k10apa26:"২৭. পদুমুক্খিপৰগ্গো",
    att6k10apa27:"২৮. সুৰণ্ণবিব্বোহনৰগ্গো",
    att6k10apa28:"২৯. পণ্ণদাযকৰগ্গো",
    att6k10apa29:"৩০. চিতকপূজকৰগ্গো",
    att6k10apa30:"৩১. পদুমকেসরৰগ্গো",
    att6k10apa31:"৩২. আরক্খদাযকৰগ্গো",
    att6k10apa32:"৩৩. উমাপুপ্ফিযৰগ্গো",
    att6k10apa33:"৩৪-৩৮. গন্ধোদকাদিৰগ্গো",
    att6k10apa34:"৩৯. অৰটফলৰগ্গো",
    att6k10apa35:"৪০. পিলিন্দৰচ্ছৰগ্গো",
    att6k10apa36:"৪১. মেত্তেয্যৰগ্গো",
    att6k10apa37:"৪২. ভদ্দালিৰগ্গো",
    att6k10apa38:"৪৩-৪৮. সকিংসম্মজ্জকাদিৰগ্গো",
    att6k10apa39:"৪৯. পংসুকূলৰগ্গো",
    att6k10apa40:"৫০-৫৩. কিঙ্কণিপুপ্ফাদিৰগ্গো",
    att6k10apa41:"৫৪. কচ্চাযনৰগ্গো",
    att6k10apa42:"৫৫. ভদ্দিযৰগ্গো",
    att6k10apa43:"৫৬. যসৰগ্গো"
}
let att6k11bud = {
    att6k11bud01:"গন্থারম্ভকথা",
    att6k11bud02:"১. রতনচঙ্কমনকণ্ডৰণ্ণনা",
    att6k11bud03:"২. সুমেধপত্থনাকথাৰণ্ণনা",
    att6k11bud04:"৩. দীপঙ্করবুদ্ধৰংসৰণ্ণনা",
    att6k11bud05:"৪. কোণ্ডঞ্ঞবুদ্ধৰংসৰণ্ণনা",
    att6k11bud06:"৫. মঙ্গলবুদ্ধৰংসৰণ্ণনা",
    att6k11bud07:"৬. সুমনবুদ্ধৰংসৰণ্ণনা",
    att6k11bud08:"৭. রেৰতবুদ্ধৰংসৰণ্ণনা",
    att6k11bud09:"৮. সোভিতবুদ্ধৰংসৰণ্ণনা",
    att6k11bud10:"৯. অনোমদস্সীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud11:"১০. পদুমবুদ্ধৰংসৰণ্ণনা",
    att6k11bud12:"১১. নারদবুদ্ধৰংসৰণ্ণনা",
    att6k11bud13:"১২. পদুমুত্তরবুদ্ধৰংসৰণ্ণনা",
    att6k11bud14:"১৩. সুমেধবুদ্ধৰংসৰণ্ণনা",
    att6k11bud15:"১৪. সুজাতবুদ্ধৰংসৰণ্ণনা",
    att6k11bud16:"১৫. পিযদস্সীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud17:"১৬. অত্থদস্সীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud18:"১৭. ধম্মদস্সীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud19:"১৮. সিদ্ধত্থবুদ্ধৰংসৰণ্ণনা",
    att6k11bud20:"১৯. তিস্সবুদ্ধৰংসৰণ্ণনা",
    att6k11bud21:"২০. ফুস্সবুদ্ধৰংসৰণ্ণনা",
    att6k11bud22:"২১. ৰিপস্সীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud23:"২২. সিখীবুদ্ধৰংসৰণ্ণনা",
    att6k11bud24:"২৩. ৰেস্সভূবুদ্ধৰংসৰণ্ণনা",
    att6k11bud25:"২৪. ককুসন্ধবুদ্ধৰংসৰণ্ণনা",
    att6k11bud26:"২৫. কোণাগমনবুদ্ধৰংসৰণ্ণনা",
    att6k11bud27:"২৬. কস্সপবুদ্ধৰংসৰণ্ণনা",
    att6k11bud28:"২৭. গোতমবুদ্ধৰংসৰণ্ণনা",
    att6k11bud29:"২৮. বুদ্ধপকিণ্ণককথা"
}
let att6k12car = {
    att6k12car01:"গন্থারম্ভকথা",
    att6k12car02:"১. অকিত্তিৰগ্গো",
    att6k12car03:"২. হত্থিনাগৰগ্গো",
    att6k12car04:"৩. যুধঞ্জযৰগ্গো"
}
let att6k13jat01 = {
    att6k13jat0101:"গন্থারম্ভকথা",
    att6k13jat0102:"১. এককনিপাতো"
}
let att6k14jat02 = {
    att6k14jat0201:"২. দুকনিপাতো",
    att6k14jat0202:"৩. তিকনিপাতো"
}
let att6k15jat03 = {
    att6k15jat0301:"৪. চতুক্কনিপাতো",
    att6k15jat0302:"৫. পঞ্চকনিপাতো",
    att6k15jat0303:"৬. ছক্কনিপাতো",
    att6k15jat0304:"৭. সত্তকনিপাতো",
    att6k15jat0305:"৮. অট্ঠকনিপাতো",
    att6k15jat0306:"৯. নৰকনিপাতো"
}
let att6k16jat04 = {
    att6k16jat0401:"১০. দসকনিপাতো",
    att6k16jat0402:"১১. একাদসকনিপাতো",
    att6k16jat0403:"১২. দ্বাদসকনিপাতো",
    att6k16jat0404:"১৩. তেরসকনিপাতো",
    att6k16jat0405:"১৪. পকিণ্ণকনিপাতো",
    att6k16jat0406:"১৫. ৰীসতিনিপাতো",
    att6k16jat0407:"১৬. তিংসনিপাতো"
}
let att6k17jat05 = {
    att6k17jat0501:"১৭. চত্তালীসনিপাতো",
    att6k17jat0502:"১৮. পণ্ণাসনিপাতো",
    att6k17jat0503:"১৯. সট্ঠিনিপাতো",
    att6k17jat0504:"২০. সত্ততিনিপাতো",
    att6k17jat0505:"২১. অসীতিনিপাতো"
}
let att6k18jat06 = {
    att6k18jat0601:"২২. মহানিপাতো"
}
let att6k19jat07 = {
    att6k19jat0701:"২২. মহানিপাতো"
}
let att6k20mah = {
    att6k20mah01:"গন্থারম্ভকথা",
    att6k20mah02:"১. কামসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah03:"২. গুহট্ঠকসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah04:"৩. দুট্ঠট্ঠকসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah05:"৪. সুদ্ধট্ঠকসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah06:"৫. পরমট্ঠকসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah07:"৬. জরাসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah08:"৭. তিস্সমেত্তেয্যসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah09:"৮. পসূরসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah10:"৯. মাগণ্ডিযসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah11:"১০. পুরাভেদসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah12:"১১. কলহৰিৰাদসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah13:"১২. চূল়ব্যূহসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah14:"১৩. মহাব্যূহসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah15:"১৪. তুৰটকসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah16:"১৫. অত্তদণ্ডসুত্তনিদ্দেসৰণ্ণনা",
    att6k20mah17:"১৬. সারিপুত্তসুত্তনিদ্দেসৰণ্ণনা"
}
let att6k21cul = {
    att6k21cul01:"পারাযনৰগ্গনিদ্দেসো",
    att6k21cul02:"খগ্গৰিসাণসুত্তনিদ্দেসো"
}
let att6k22pat = {
    att6k22pat01:"গন্থারম্ভকথা",
    att6k22pat02:"(১) মহাৰগ্গো",
    att6k22pat03:"১. ঞাণকথা",
    att6k22pat04:"২. দিট্ঠিকথা",
    att6k22pat05:"৩. আনাপানস্সতিকথা",
    att6k22pat06:"৪. ইন্দ্রিযকথা",
    att6k22pat07:"৫. ৰিমোক্খকথা",
    att6k22pat08:"৬. গতিকথা",
    att6k22pat09:"৭. কম্মকথাৰণ্ণনা",
    att6k22pat10:"৮. ৰিপল্লাসকথা",
    att6k22pat11:"৯. মগ্গকথা",
    att6k22pat12:"১০. মণ্ডপেয্যকথা",
    att6k22pat13:"(২) যুগনদ্ধৰগ্গো",
    att6k22pat14:"(৩) পঞ্ঞাৰগ্গো",
    att6k22pat15:"১. মহাপঞ্ঞাকথা",
    att6k22pat16:"২. ইদ্ধিকথা",
    att6k22pat17:"৩. অভিসমযকথা",
    att6k22pat18:"৪. ৰিৰেককথা",
    att6k22pat19:"৫. চরিযাকথা",
    att6k22pat20:"৬. পাটিহারিযকথা",
    att6k22pat21:"৭. সমসীসকথা",
    att6k22pat22:"৮. সতিপট্ঠানকথা",
    att6k22pat23:"৯. ৰিপস্সনাকথা",
    att6k22pat24:"১০. মাতিকাকথা"
}
let att6k23net = {
    att6k23net01:"গন্থারম্ভকথা",
    att6k23net02:"১. সঙ্গহৰারৰণ্ণনা",
    att6k23net03:"২. উদ্দেসৰারৰণ্ণনা",
    att6k23net04:"৩. নিদ্দেসৰারৰণ্ণনা",
    att6k23net05:"৪. পটিনিদ্দেসৰারৰণ্ণনা",
    att6k23net06:"নযসমুট্ঠানৰারৰণ্ণনা",
    att6k23net07:"সাসনপট্ঠানৰারৰণ্ণনা"
}


//dight-tik
let tik2d01sil = {
    tik2d01sil01:"গন্থারম্ভকথাৰণ্ণনা",
    tik2d01sil02:"১. ব্রহ্মজালসুত্তৰণ্ণনা",
    tik2d01sil03:"২. সামঞ্ঞফলসুত্তৰণ্ণনা",
    tik2d01sil04:"৩. অম্বট্ঠসুত্তৰণ্ণনা",
    tik2d01sil05:"৪. সোণদণ্ডসুত্তৰণ্ণনা",
    tik2d01sil06:"৫. কূটদন্তসুত্তৰণ্ণনা",
    tik2d01sil07:"৬. মহালিসুত্তৰণ্ণনা",
    tik2d01sil08:"৭. জালিযসুত্তৰণ্ণনা",
    tik2d01sil09:"৮. মহাসীহনাদসুত্তৰণ্ণনা",
    tik2d01sil10:"৯. পোট্ঠপাদসুত্তৰণ্ণনা",
    tik2d01sil11:"১০. সুভসুত্তৰণ্ণনা",
    tik2d01sil12:"১১. কেৰট্টসুত্তৰণ্ণনা",
    tik2d01sil13:"১২. লোহিচ্চসুত্তৰণ্ণনা",
    tik2d01sil14:"১৩. তেৰিজ্জসুত্তৰণ্ণনা"
}
let tik2d02mah = {
    tik2d02mah01:"১. মহাপদানসুত্তৰণ্ণনা",
    tik2d02mah02:"২. মহানিদানসুত্তৰণ্ণনা",
    tik2d02mah03:"৩. মহাপরিনিব্বানসুত্তৰণ্ণনা",
    tik2d02mah04:"৪. মহাসুদস্সনসুত্তৰণ্ণনা",
    tik2d02mah05:"৫. জনৰসভসুত্তৰণ্ণনা",
    tik2d02mah06:"৬. মহাগোৰিন্দসুত্তৰণ্ণনা",
    tik2d02mah07:"৭. মহাসমযসুত্তৰণ্ণনা",
    tik2d02mah08:"৮. সক্কপঞ্হসুত্তৰণ্ণনা",
    tik2d02mah09:"৯. মহাসতিপট্ঠানসুত্তৰণ্ণনা",
    tik2d02mah10:"১০. পাযাসিরাজঞ্ঞসুত্তৰণ্ণনা"
}
let tik2d03pat = {
    tik2d03pat01:"১. পাথিকসুত্তৰণ্ণনা",
    tik2d03pat02:"২. উদুম্বরিকসুত্তৰণ্ণনা",
    tik2d03pat03:"৩. চক্কৰত্তিসুত্তৰণ্ণনা",
    tik2d03pat04:"৪. অগ্গঞ্ঞসুত্তৰণ্ণনা",
    tik2d03pat05:"৫. সম্পসাদনীযসুত্তৰণ্ণনা",
    tik2d03pat06:"৬. পাসাদিকসুত্তৰণ্ণনা",
    tik2d03pat07:"৭. লক্খণসুত্তৰণ্ণনা",
    tik2d03pat08:"৮. সিঙ্গালসুত্তৰণ্ণনা",
    tik2d03pat09:"৯. আটানাটিযসুত্তৰণ্ণনা",
    tik2d03pat10:"১০. সঙ্গীতিসুত্তৰণ্ণনা",
    tik2d03pat11:"১১. দসুত্তরসুত্তৰণ্ণনা"
}
let tik2d04sab = {
    tik2d04sab01:"গন্থারম্ভকথাৰণ্ণনা",
    tik2d04sab02:"১. ব্রহ্মজালসুত্তং",
    tik2d04sab03:"২. সামঞ্ঞফলসুত্তৰণ্ণনা",
    tik2d04sab04:"৩. অম্বট্ঠসুত্তৰণ্ণনা",
    tik2d04sab05:"৪. সোণদণ্ডসুত্তৰণ্ণনা",
    tik2d04sab06:"৫. কূটদন্তসুত্তৰণ্ণনা",
    tik2d04sab07:"৬. মহালিসুত্তৰণ্ণনা",
    tik2d04sab08:"৭. জালিযসুত্তৰণ্ণনা",
    tik2d04sab09:"৮. মহাসীহনাদসুত্তৰণ্ণনা",
    tik2d04sab10:"৯. পোট্ঠপাদসুত্তৰণ্ণনা",
    tik2d04sab11:"১০. সুভসুত্তৰণ্ণনা",
    tik2d04sab12:"১১. কেৰট্টসুত্তৰণ্ণনা",
    tik2d04sab13:"১২. লোহিচ্চসুত্তৰণ্ণনা",
    tik2d04sab14:"১৩. তেৰিজ্জসুত্তৰণ্ণনা"
}

//majjhima-tik
let tik3m01mul = {
    tik3m01mul01:"গন্থারম্ভকথাৰণ্ণনা",
    tik3m01mul02:"১. মূলপরিযাযৰগ্গো",
    tik3m01mul03:"২. সীহনাদৰগ্গো",
    tik3m01mul04:"৩. ওপম্মৰগ্গো",
    tik3m01mul05:"৪. মহাযমকৰগ্গো",
    tik3m01mul06:"৫. চূল়যমকৰগ্গো"
}
let tik3m02maj = {
    tik3m02maj01:"১. গহপতিৰগ্গো",
    tik3m02maj02:"২. ভিক্খুৰগ্গো",
    tik3m02maj03:"৩. পরিব্বাজকৰগ্গো",
    tik3m02maj04:"৪. রাজৰগ্গো",
    tik3m02maj05:"৫. ব্রাহ্মণৰগ্গো"
}
let tik3m03upa = {
    tik3m03upa01:"১. দেৰদহৰগ্গো",
    tik3m03upa02:"২. অনুপদৰগ্গো",
    tik3m03upa03:"৩. সুঞ্ঞতৰগ্গো",
    tik3m03upa04:"৪. ৰিভঙ্গৰগ্গো",
    tik3m03upa05:"৫. সল়াযতনৰগ্গো"
}

//samyutta-tik
let tik4s01sag = {
    tik4s01sag01:"গন্থারম্ভকথাৰণ্ণনা",
    tik4s01sag02:"১. দেৰতাসংযুত্তং",
    tik4s01sag03:"২. দেৰপুত্তসংযুত্তং",
    tik4s01sag04:"৩. কোসলসংযুত্তং",
    tik4s01sag05:"৪. মারসংযুত্তং",
    tik4s01sag06:"৫. ভিক্খুনীসংযুত্তং",
    tik4s01sag07:"৬. ব্রহ্মসংযুত্তং",
    tik4s01sag08:"৭. ব্রাহ্মণসংযুত্তং",
    tik4s01sag09:"৮. ৰঙ্গীসসংযুত্তং",
    tik4s01sag10:"৯. ৰনসংযুত্তং",
    tik4s01sag11:"১০. যক্খসংযুত্তং",
    tik4s01sag12:"১১. সক্কসংযুত্তং"
}
let tik4s02nid = {
    tik4s02nid01:"১. নিদানসংযুত্তং",
    tik4s02nid02:"২. অভিসমযসংযুত্তং",
    tik4s02nid03:"৩. ধাতুসংযুত্তং",
    tik4s02nid04:"৪. অনমতগ্গসংযুত্তং",
    tik4s02nid05:"৫. কস্সপসংযুত্তং",
    tik4s02nid06:"৬. লাভসক্কারসংযুত্তং",
    tik4s02nid07:"৭. রাহুলসংযুত্তং",
    tik4s02nid08:"৮. লক্খণসংযুত্তং",
    tik4s02nid09:"৯. ওপম্মসংযুত্তং",
    tik4s02nid10:"১০. ভিক্খুসংযুত্তং"
}
let tik4s03kha = {
    tik4s03kha01:"১. খন্ধসংযুত্তং",
    tik4s03kha02:"২. রাধসংযুত্তং",
    tik4s03kha03:"৩. দিট্ঠিসংযুত্তং",
    tik4s03kha04:"৪. ওক্কন্তসংযুত্তং",
    tik4s03kha05:"৫. উপ্পাদসংযুত্তৰণ্ণনা",
    tik4s03kha06:"৬. কিলেসসংযুত্তৰণ্ণনা",
    tik4s03kha07:"৭. সারিপুত্তসংযুত্তং",
    tik4s03kha08:"৮. নাগসংযুত্তং",
    tik4s03kha09:"৯. সুপণ্ণসংযুত্তৰণ্ণনা",
    tik4s03kha10:"১০. গন্ধব্বকাযসংযুত্তৰণ্ণনা",
    tik4s03kha11:"১১. ৰলাহকসংযুত্তৰণ্ণনা",
    tik4s03kha12:"১২. ৰচ্ছগোত্তসংযুত্তৰণ্ণনা",
    tik4s03kha13:"১৩. ঝানসংযুত্তং"
}
let tik4s04sal = {
    tik4s04sal01:"১. সল়াযতনসংযুত্তং",
    tik4s04sal02:"২. ৰেদনাসংযুত্তং",
    tik4s04sal03:"৩. মাতুগামসংযুত্তং",
    tik4s04sal04:"৪. জম্বুখাদকসংযুত্তং",
    tik4s04sal05:"৫. সামণ্ডকসংযুত্তৰণ্ণনা",
    tik4s04sal06:"৬. মোগ্গল্লানসংযুত্তং",
    tik4s04sal07:"৭. চিত্তসংযুত্তং",
    tik4s04sal08:"৮. গামণিসংযুত্তং",
    tik4s04sal09:"৯. অসঙ্খতসংযুত্তং",
    tik4s04sal10:"১০. অব্যাকতসংযুত্তং"
}
let tik4s05mah = {
    tik4s05mah01:"১. মগ্গসংযুত্তং",
    tik4s05mah02:"২. বোজ্ঝঙ্গসংযুত্তং",
    tik4s05mah03:"৩. সতিপট্ঠানসংযুত্তং",
    tik4s05mah04:"৪. ইন্দ্রিযসংযুত্তং",
    tik4s05mah05:"৫. সম্মপ্পধানসংযুত্তৰণ্ণনা",
    tik4s05mah06:"৬. বলসংযুত্তৰণ্ণনা",
    tik4s05mah07:"৭. ইদ্ধিপাদসংযুত্তং",
    tik4s05mah08:"৮. অনুরুদ্ধসংযুত্তং",
    tik4s05mah09:"৯. ঝানসংযুত্তৰণ্ণনা",
    tik4s05mah10:"১০. আনাপানসংযুত্তং",
    tik4s05mah11:"১১. সোতাপত্তিসংযুত্তং",
    tik4s05mah12:"১২. সচ্চসংযুত্তং"
}

//anguttara-tik
let tik5a01eka = {
    tik5a01eka01:"গন্থারম্ভকথা",
    tik5a01eka02:"১. রূপাদিৰগ্গৰণ্ণনা",
    tik5a01eka03:"২. নীৰরণপ্পহানৰগ্গৰণ্ণনা",
    tik5a01eka04:"৩. অকম্মনিযৰগ্গৰণ্ণনা",
    tik5a01eka05:"৪. অদন্তৰগ্গৰণ্ণনা",
    tik5a01eka06:"৫. পণিহিতঅচ্ছৰগ্গৰণ্ণনা",
    tik5a01eka07:"৬. অচ্ছরাসঙ্ঘাতৰগ্গৰণ্ণনা",
    tik5a01eka08:"৭. ৰীরিযারম্ভাদিৰগ্গৰণ্ণনা",
    tik5a01eka09:"৮. কল্যাণমিত্ততাদিৰগ্গৰণ্ণনা",
    tik5a01eka10:"১০. দুতিযপমাদাদিৰগ্গৰণ্ণনা",
    tik5a01eka11:"১৩. একপুগ্গলৰগ্গৰণ্ণনা",
    tik5a01eka12:"১৪. এতদগ্গৰগ্গো",
    tik5a01eka13:"১৫. অট্ঠানপাল়ি",
    tik5a01eka14:"১৬. একধম্মপাল়ি",
    tik5a01eka15:"১৭. পসাদকরধম্মৰগ্গৰণ্ণনা",
    tik5a01eka16:"১৮. অপরঅচ্ছরাসঙ্ঘাতৰগ্গৰণ্ণনা",
    tik5a01eka17:"১৯. কাযগতাসতিৰগ্গৰণ্ণনা",
    tik5a01eka18:"২০. অমতৰগ্গৰণ্ণনা"
}
let tik5a02duk = {
    tik5a02duk01:"১. কম্মকারণৰগ্গো",
    tik5a02duk02:"২. অধিকরণৰগ্গৰণ্ণনা",
    tik5a02duk03:"৩. বালৰগ্গৰণ্ণনা",
    tik5a02duk04:"৪. সমচিত্তৰগ্গৰণ্ণনা",
    tik5a02duk05:"৫. পরিসৰগ্গৰণ্ণনা",
    tik5a02duk06:"(৬) ১. পুগ্গলৰগ্গৰণ্ণনা",
    tik5a02duk07:"(৭) ২. সুখৰগ্গৰণ্ণনা",
    tik5a02duk08:"(৮) ৩. সনিমিত্তৰগ্গৰণ্ণনা",
    tik5a02duk09:"(৯) ৪. ধম্মৰগ্গৰণ্ণনা",
    tik5a02duk10:"(১০) ৫. বালৰগ্গৰণ্ণনা",
    tik5a02duk11:"(১১) ১. আসাদুপ্পজহৰগ্গৰণ্ণনা",
    tik5a02duk12:"(১২) ২. আযাচনৰগ্গৰণ্ণনা",
    tik5a02duk13:"(১৩) ৩. দানৰগ্গৰণ্ণনা",
    tik5a02duk14:"(১৪) ৪. সন্থারৰগ্গৰণ্ণনা",
    tik5a02duk15:"(১৫) ৫. সমাপত্তিৰগ্গৰণ্ণনা",
    tik5a02duk16:"১. কোধপেয্যালং",
    tik5a02duk17:"২. অকুসলপেয্যালং",
    tik5a02duk18:"৩. ৰিনযপেয্যালং"
}
let tik5a03tik = {
    tik5a03tik01:"১. বালৰগ্গো",
    tik5a03tik02:"২. রথকারৰগ্গো",
    tik5a03tik03:"৩. পুগ্গলৰগ্গো",
    tik5a03tik04:"৪. দেৰদূতৰগ্গো",
    tik5a03tik05:"৫. চূল়ৰগ্গো",
    tik5a03tik06:"(৬) ১. ব্রাহ্মণৰগ্গো",
    tik5a03tik07:"(৭) ২. মহাৰগ্গো",
    tik5a03tik08:"(৮) ৩. আনন্দৰগ্গো",
    tik5a03tik09:"(৯) ৪. সমণৰগ্গো",
    tik5a03tik10:"(১০) ৫. লোণকপল্লৰগ্গো",
    tik5a03tik11:"(১১) ১. সম্বোধৰগ্গো",
    tik5a03tik12:"(১২) ২. আপাযিকৰগ্গো",
    tik5a03tik13:"(১৩) ৩. কুসিনারৰগ্গো",
    tik5a03tik14:"(১৪) ৪. যোধাজীৰৰগ্গো",
    tik5a03tik15:"(১৬) ৬. অচেলকৰগ্গৰণ্ণনা",
    tik5a03tik16:"১৭-১৮. পেয্যালৰগ্গাদিৰণ্ণনা"
}
let tik5a04cat = {
    tik5a04cat01:"১. ভণ্ডগামৰগ্গো",
    tik5a04cat02:"২. চরৰগ্গো",
    tik5a04cat03:"৩. উরুৰেলৰগ্গো",
    tik5a04cat04:"৪. চক্কৰগ্গো",
    tik5a04cat05:"৫. রোহিতস্সৰগ্গো",
    tik5a04cat06:"(৬) ১. পুঞ্ঞাভিসন্দৰগ্গো",
    tik5a04cat07:"(৭) ২. পত্তকম্মৰগ্গো",
    tik5a04cat08:"(৮) ৩. অপণ্ণকৰগ্গো",
    tik5a04cat09:"(৯) ৪. মচলৰগ্গো",
    tik5a04cat10:"(১০) ৫. অসুরৰগ্গো",
    tik5a04cat11:"(১১) ১. ৰলাহকৰগ্গো",
    tik5a04cat12:"(১২) ২. কেসিৰগ্গো",
    tik5a04cat13:"(১৩) ৩. ভযৰগ্গো",
    tik5a04cat14:"(১৪) ৪. পুগ্গলৰগ্গো",
    tik5a04cat15:"(১৫) ৫. আভাৰগ্গো",
    tik5a04cat16:"(১৬) ১. ইন্দ্রিযৰগ্গো",
    tik5a04cat17:"(১৭) ২. পটিপদাৰগ্গো",
    tik5a04cat18:"(১৮) ৩. সঞ্চেতনিযৰগ্গো",
    tik5a04cat19:"(১৯) ৪. ব্রাহ্মণৰগ্গো",
    tik5a04cat20:"(২০) ৫. মহাৰগ্গো",
    tik5a04cat21:"(২১) ১. সপ্পুরিসৰগ্গো",
    tik5a04cat22:"(২৩) ৩. দুচ্চরিতৰগ্গৰণ্ণনা",
    tik5a04cat23:"(২৪) ৪. কম্মৰগ্গো",
    tik5a04cat24:"(২৫) ৫. আপত্তিভযৰগ্গো",
    tik5a04cat25:"(২৬) ৬. অভিঞ্ঞাৰগ্গো"
}
let tik5a05pan = {
    tik5a05pan01:"১. সেখবলৰগ্গো",
    tik5a05pan02:"২. বলৰগ্গো",
    tik5a05pan03:"৩. পঞ্চঙ্গিকৰগ্গো",
    tik5a05pan04:"৪. সুমনৰগ্গো",
    tik5a05pan05:"৫. মুণ্ডরাজৰগ্গো",
    tik5a05pan06:"(৬) ১. নীৰরণৰগ্গো",
    tik5a05pan07:"(৭) ২. সঞ্ঞাৰগ্গো",
    tik5a05pan08:"(৮) ৩. যোধাজীৰৰগ্গো",
    tik5a05pan09:"(৯) ৪. থেরৰগ্গো",
    tik5a05pan10:"(১০) ৫. ককুধৰগ্গো",
    tik5a05pan11:"(১১) ১. ফাসুৰিহারৰগ্গো",
    tik5a05pan12:"(১২) ২. অন্ধকৰিন্দৰগ্গো",
    tik5a05pan13:"(১৩) ৩. গিলানৰগ্গো",
    tik5a05pan14:"(১৪) ৪. রাজৰগ্গো",
    tik5a05pan15:"(১৫) ৫. তিকণ্ডকীৰগ্গো",
    tik5a05pan16:"(১৬) ১. সদ্ধম্মৰগ্গো",
    tik5a05pan17:"(১৭) ২. আঘাতৰগ্গো",
    tik5a05pan18:"(১৮) ৩. উপাসকৰগ্গো",
    tik5a05pan19:"(১৯) ৪. অরঞ্ঞৰগ্গো",
    tik5a05pan20:"(২০) ৫. ব্রাহ্মণৰগ্গো",
    tik5a05pan21:"(২১) ১. কিমিলৰগ্গো",
    tik5a05pan22:"(২২) ২. অক্কোসকৰগ্গো",
    tik5a05pan23:"(২৩) ৩. দীঘচারিকৰগ্গো"
}
let tik5a06cha = {
    tik5a06cha01:"১. আহুনেয্যৰগ্গো",
    tik5a06cha02:"২. সারণীযৰগ্গো",
    tik5a06cha03:"৩. অনুত্তরিযৰগ্গো",
    tik5a06cha04:"৪. দেৰতাৰগ্গো",
    tik5a06cha05:"৫. ধম্মিকৰগ্গো",
    tik5a06cha06:"৬. মহাৰগ্গো",
    tik5a06cha07:"৭. দেৰতাৰগ্গো",
    tik5a06cha08:"৮. অরহত্তৰগ্গো",
    tik5a06cha09:"৯. সীতিৰগ্গো",
    tik5a06cha10:"১০. আনিসংসৰগ্গো"
}
let tik5a07sat = {
    tik5a07sat01:"১. ধনৰগ্গো",
    tik5a07sat02:"২. অনুসযৰগ্গো",
    tik5a07sat03:"৩. ৰজ্জিসত্তকৰগ্গো",
    tik5a07sat04:"৪. দেৰতাৰগ্গো",
    tik5a07sat05:"৫. মহাযঞ্ঞৰগ্গো",
    tik5a07sat06:"৬. অব্যাকতৰগ্গো",
    tik5a07sat07:"৭. মহাৰগ্গো",
    tik5a07sat08:"৮. ৰিনযৰগ্গো"
}
let tik5a08att = {
    tik5a08att01:"১. মেত্তাৰগ্গো",
    tik5a08att02:"২. মহাৰগ্গো",
    tik5a08att03:"৩. গহপতিৰগ্গো",
    tik5a08att04:"৪. দানৰগ্গো",
    tik5a08att05:"৫. উপোসথৰগ্গো",
    tik5a08att06:"(৬) ১. গোতমীৰগ্গো",
    tik5a08att07:"(৭) ২. ভূমিচালৰগ্গো",
    tik5a08att08:"(৮) ৩. যমকৰগ্গো"
}
let tik5a09nav = {
    tik5a09nav01:"১. সম্বোধিৰগ্গো",
    tik5a09nav02:"২. সীহনাদৰগ্গো",
    tik5a09nav03:"৩. সত্তাৰাসৰগ্গো",
    tik5a09nav04:"৪. মহাৰগ্গো",
    tik5a09nav05:"৫. সামঞ্ঞৰগ্গো"
}
let tik5a10das = {
    tik5a10das01:"১. আনিসংসৰগ্গো",
    tik5a10das02:"২. নাথৰগ্গো",
    tik5a10das03:"৩. মহাৰগ্গো",
    tik5a10das04:"৪. উপালিৰগ্গো",
    tik5a10das05:"৫. অক্কোসৰগ্গো",
    tik5a10das06:"(৬) ১. সচিত্তৰগ্গো",
    tik5a10das07:"(৭) ২. যমকৰগ্গো",
    tik5a10das08:"(৮) ৩. আকঙ্খৰগ্গো",
    tik5a10das09:"(৯) ৪. থেরৰগ্গো",
    tik5a10das10:"(১০) ৫. উপালিৰগ্গো",
    tik5a10das11:"(১১) ১. সমণসঞ্ঞাৰগ্গো",
    tik5a10das12:"(১২) ২. পচ্চোরোহণিৰগ্গো",
    tik5a10das13:"(২১) ১. করজকাযৰগ্গো"
}
let tik5a11eka = {
    tik5a11eka01:"১. নিস্সযৰগ্গো",
    tik5a11eka02:"২. অনুস্সতিৰগ্গো"
}
//khuddaka-tik
let tik6k01npt = {
    tik6k01npt01:"গন্থারম্ভকথাৰণ্ণনা",
    tik6k01npt02:"১. সঙ্গহৰারৰণ্ণনা",
    tik6k01npt03:"২. উদ্দেসৰারৰণ্ণনা",
    tik6k01npt04:"৩. নিদ্দেসৰারৰণ্ণনা",
    tik6k01npt05:"৪. পটিনিদ্দেসৰারৰণ্ণনা",
    tik6k01npt06:"নযসমুট্ঠানৰারৰণ্ণনা",
    tik6k01npt07:"সাসনপট্ঠানৰারৰণ্ণনা"
}
let tik6k02nvn = {
    tik6k02nvn01:"১. সঙ্গহৰারঅত্থৰিভাৰনা",
    tik6k02nvn02:"২. উদ্দেসৰারঅত্থৰিভাৰনা",
    tik6k02nvn03:"৩. নিদ্দেসৰারঅত্থৰিভাৰনা",
    tik6k02nvn04:"৪. পটিনিদ্দেসৰারঅত্থৰিভাৰনা",
    tik6k02nvn05:"নযসমুট্ঠানৰিভাৰনা",
    tik6k02nvn06:"সাসনপট্ঠানৰিভাৰনা"
}

function getTitles(key){
    let titlesList = {
        //level1 and level2
        lev1: lev1, mul: mul, att:att, tik:tik, ann:ann,
    
        //level3
        vinmul: vinmul, sutmul: sutmul, abhmul: abhmul,
        vinatt: vinatt, sutatt: sutatt, abhatt: abhatt,
        vintik: vintik, suttik: suttik, abhtik: abhtik,
        
        vismag: vismag, sangpu: sangpu, ledisa: ledisa, 
        budvan:budvan, vangsa:vangsa, vyakrn:vyakrn, nitiga:nitiga, pakinn:pakinn, sihala:sihala,
    
        //level4
        //level4-mula
        mul1v01par:mul1v01par, mul1v02pac:mul1v02pac, mul1v03mah:mul1v03mah, mul1v04cul:mul1v04cul, mul1v05par:mul1v05par,
        digmul:digmul, majmul:majmul, sammul:sammul, angmul:angmul, khumul,
    
        mul7a01dha:mul7a01dha, mul7a02vib:mul7a02vib, mul7a03dha:mul7a03dha, mul7a04pug:mul7a04pug, mul7a05kat:mul7a05kat, 
        mul7a06yam01:mul7a06yam01, mul7a07yam02:mul7a07yam02, mul7a08yam03:mul7a08yam03, 
        mul7a09pat01:mul7a09pat01, mul7a10pat02:mul7a10pat02, mul7a11pat03:mul7a11pat03, mul7a12pat04:mul7a12pat04, mul7a13pat05:mul7a13pat05,
    
        //level4-att
        att1v01par:att1v01par, att1v02pac:att1v02pac, att1v03mah:att1v03mah, att1v04cul:att1v04cul, att1v05par:att1v05par,
        digatt:digatt, majatt:majatt, samatt:samatt, angatt:angatt, khuatt:khuatt,
        att7a01dha:att7a01dha, att7a02vib:att7a02vib, att7a03dha:att7a03dha, att7a04pug:att7a04pug, att7a05kat:att7a05kat, att7a06yam:att7a06yam, att7a07pat:att7a07pat,
        
        //level4-tik
        tik1v01sar01:tik1v01sar01, tik1v02sar02:tik1v02sar02, tik1v03sar03:tik1v03sar03, tik1v04dve:tik1v04dve, tik1v05kan:tik1v05kan, tik1v06vsa:tik1v06vsa, 
        tik1v07vaj:tik1v07vaj, tik1v08vim:tik1v08vim, tik1v09vlt:tik1v09vlt, tik1v10kap:tik1v10kap, tik1v11vuv:tik1v11vuv, tik1v12vvt:tik1v12vvt, 
        tik1v13pdi:tik1v13pdi, tik1v14kmu:tik1v14kmu,
    
        digtik:digtik, majtik:majtik, samtik:samtik, angtik:angtik, khutik:khutik,
        tik7a01dmt:tik7a01dmt, tik7a02vmt:tik7a02vmt, tik7a03pmt:tik7a03pmt, tik7a04dat:tik7a04dat, tik7a05pat:tik7a05pat, tik7a05pat:tik7a05pat, tik7a06anp:tik7a06anp,
        tik7a06anp:tik7a06anp, tik7a07asn:tik7a07asn, tik7a08apu:tik7a08apu, tik7a09ama:tik7a09ama,
    
        //level4-ann
        ann1v01vis01:ann1v01vis01, ann1v02vis02:ann1v02vis02, ann1v03vmt01:ann1v03vmt01, ann1v04vmt02:ann1v04vmt02, ann1v05vnk:ann1v05vnk,
        ann2s01dig:ann2s01dig, ann2s02maj:ann2s02maj, ann2s03san:ann2s03san, ann2s04ang:ann2s04ang, ann2s05vin:ann2s05vin, ann2s06abh:ann2s06abh, ann2s07att:ann2s07att,
        ann3l01nir:ann3l01nir, ann3l02par:ann3l02par, ann3l03anu:ann3l03anu, ann3l04pat:ann3l04pat,
        ann4b01nam:ann4b01nam,ann4b02mah:ann4b02mah,ann4b03lak:ann4b03lak,ann4b04sut:ann4b04sut,ann4b05kam:ann4b05kam,ann4b06jin:ann4b06jin,ann4b07paj:ann4b07paj,ann4b08bud:ann4b08bud,
        ann5b01cul:ann5b01cul, ann5b02mah:ann5b02mah, ann5b03sas:ann5b03sas,
        ann6v01kac:ann6v01kac, ann6v02mog:ann6v02mog, ann6v03sad:ann6v03sad, ann6v04pad:ann6v04pad, ann6v05mpn:ann6v05mpn, ann6v06pay:ann6v06pay,
        ann6v07vut:ann6v07vut, ann6v08adp:ann6v08adp, ann6v09adt:ann6v09adt, ann6v10sup:ann6v10sup, ann6v11sut:ann6v11sut, ann6v12val:ann6v12val,
        ann7n01lok:ann7n01lok,ann7n02sut:ann7n02sut,ann7n03sur:ann7n03sur,ann7n04mah:ann7n04mah,ann7n05dha:ann7n05dha,ann7n06kav:ann7n06kav,ann7n07nit:ann7n07nit,
        ann7n08nar:ann7n08nar,ann7n09cat:ann7n09cat,ann7n10can:ann7n10can,
        ann8p01ras:ann8p01ras,ann8p02sim:ann8p02sim,ann8p03ves:ann8p03ves,
        ann9s01mog:ann9s01mog,ann9s02thu:ann9s02thu,ann9s03dat:ann9s03dat,ann9s04dha:ann9s04dha,ann9s05dht:ann9s05dht,ann9s06hat:ann9s06hat,ann9s07jin:ann9s07jin,
        ann9s08jvd:ann9s08jvd,ann9s09tel:ann9s09tel,ann9s10mil:ann9s10mil,ann9s11pad:ann9s11pad,ann9s12psd:ann9s12psd,ann9s13sad:ann9s13sad,ann9s14kdm:ann9s14kdm,
        ann9s15sam:ann9s15sam,
    
    
    
    
        //level5
        mul2d01sil:mul2d01sil,mul2d02mah:mul2d02mah,mul2d03pat:mul2d03pat,
        mul3m01mul:mul3m01mul,mul3m02maj:mul3m02maj,mul3m03upa:mul3m03upa,
        mul4s01sag:mul4s01sag, mul4s02nid:mul4s02nid,mul4s03kha:mul4s03kha,mul4s04sal:mul4s04sal,mul4s05mah:mul4s05mah,
        mul5a01eka:mul5a01eka,mul5a02duk:mul5a02duk,mul5a03tik:mul5a03tik,mul5a04cat:mul5a04cat,mul5a05pan:mul5a05pan,mul5a06cha:mul5a06cha,mul5a07sat:mul5a07sat,
        mul5a08att:mul5a08att,mul5a09nav:mul5a09nav,mul5a10das:mul5a10das,mul5a11eka:mul5a11eka,
        mul6k01khu:mul6k01khu,mul6k02dha:mul6k02dha,mul6k03uda:mul6k03uda,mul6k04iti:mul6k04iti,mul6k05sut:mul6k05sut,mul6k06vim:mul6k06vim,mul6k07pet:mul6k07pet,
        mul6k08the:mul6k08the,mul6k09the:mul6k09the,mul6k10apa01:mul6k10apa01,mul6k11apa02:mul6k11apa02,mul6k12bud:mul6k12bud,mul6k13car:mul6k13car,mul6k14jat01:mul6k14jat01,
        mul6k15jat02:mul6k15jat02,mul6k16mah:mul6k16mah,mul6k17cul:mul6k17cul,mul6k18pat:mul6k18pat,mul6k19net:mul6k19net,mul6k20mil:mul6k20mil,mul6k21pet:mul6k21pet,
    
        att2d01sil:att2d01sil,att2d02mah:att2d02mah,att2d03pat:att2d03pat,
        att3m01mul:att3m01mul,att3m02maj:att3m02maj,att3m03upa:att3m03upa,
        att4s01sag:att4s01sag,att4s02nid:att4s02nid,att4s03kha:att4s03kha,att4s04sal:att4s04sal,att4s05mah:att4s05mah,
        att5a01eka:att5a01eka,att5a02duk:att5a02duk,att5a03tik:att5a03tik,att5a04cat:att5a04cat,att5a05pan:att5a05pan,att5a06cha:att5a06cha,att5a07sat:att5a07sat,att5a08att:att5a08att,
        att5a09nav:att5a09nav,att5a10das:att5a10das,att5a11eka:att5a11eka,
        att6k01khu:att6k01khu,att6k02dha:att6k02dha,att6k03uda:att6k03uda,att6k04iti:att6k04iti,att6k05sut:att6k05sut,att6k06vim:att6k06vim,att6k07pet:att6k07pet,att6k08the:att6k08the,
        att6k09the:att6k09the,att6k10apa:att6k10apa,att6k11bud:att6k11bud,att6k12car:att6k12car,att6k13jat01:att6k13jat01,att6k14jat02: att6k14jat02,att6k15jat03:att6k15jat03,att6k16jat04:att6k16jat04,
        att6k17jat05:att6k17jat05,att6k18jat06:att6k18jat06,att6k19jat07:att6k19jat07,att6k20mah:att6k20mah,att6k21cul:att6k21cul,att6k22pat:att6k22pat,att6k23net:att6k23net,
    
        tik2d01sil:tik2d01sil,tik2d02mah:tik2d02mah,tik2d03pat:tik2d03pat,tik2d04sab:tik2d04sab,
        tik3m01mul:tik3m01mul,tik3m02maj:tik3m02maj,tik3m03upa:tik3m03upa,
        tik4s01sag:tik4s01sag,tik4s02nid:tik4s02nid,tik4s03kha:tik4s03kha,tik4s04sal:tik4s04sal,tik4s05mah:tik4s05mah,
        tik5a01eka:tik5a01eka,tik5a02duk:tik5a02duk,tik5a03tik:tik5a03tik,tik5a04cat:tik5a04cat,tik5a05pan:tik5a05pan,tik5a06cha:tik5a06cha,tik5a07sat:tik5a07sat,tik5a08att:tik5a08att,
        tik5a09nav:tik5a09nav,tik5a10das:tik5a10das,tik5a11eka:tik5a11eka,
        tik6k01npt:tik6k01npt,tik6k02nvn:tik6k02nvn
    }

    return titlesList[key]
}

function getBookname(bookid){
    let booktitlelist = ['পারাজিকপাল়ি','পাচিত্তিযপাল়ি','মহাৰগ্গপাল়ি','চূল়ৰগ্গপাল়ি','পরিৰারপাল়ি',
'সীলক্খন্ধৰগ্গপাল়ি','মহাৰগ্গপাল়ি','পাথিকৰগ্গপাল়ি',
'মূলপণ্ণাসপাল়ি','মজ্ঝিমপণ্ণাসপাল়ি','উপরিপণ্ণাসপাল়ি',
'সগাথাৰগ্গপাল়ি','নিদানৰগ্গপাল়ি','খন্ধৰগ্গপাল়ি','সল়াযতনৰগ্গপাল়ি','মহাৰগ্গপাল়ি',
'এককনিপাতপাল়ি','দুকনিপাতপাল়ি','তিকনিপাতপাল়ি','চতুক্কনিপাতপাল়ি','পঞ্চকনিপাতপাল়ি','ছক্কনিপাতপাল়ি','সত্তকনিপাতপাল়ি','অট্ঠকাদিনিপাতপাল়ি','নৰকনিপাতপাল়ি','দসকনিপাতপাল়ি','একাদসকনিপাতপাল়ি',
'খুদ্দকপাঠপাল়ি','ধম্মপদপাল়ি','উদানপাল়ি','ইতিৰুত্তকপাল়ি','সুত্তনিপাতপাল়ি','ৰিমানৰত্থুপাল়ি','পেতৰত্থুপাল়ি','থেরগাথাপাল়ি','থেরীগাথাপাল়ি','অপদানপাল়ি-১','অপদানপাল়ি-২','বুদ্ধৰংসপাল়ি','চরিযাপিটকপাল়ি','জাতকপাল়ি-১','জাতকপাল়ি-২','মহানিদ্দেসপাল়ি','চূল়নিদ্দেসপাল়ি','পটিসম্ভিদামগ্গপাল়ি','নেত্তিপ্পকরণপাল়ি','মিলিন্দপঞ্হপাল়ি','পেটকোপদেসপাল়ি',
'ধম্মসঙ্গণীপাল়ি','ৰিভঙ্গপাল়ি','ধাতুকথাপাল়ি','পুগ্গলপঞ্ঞত্তিপাল়ি','কথাৰত্থুপাল়ি','যমকপাল়ি-১','যমকপাল়ি-২','যমকপাল়ি-৩','পট্ঠানপাল়ি-১','পট্ঠানপাল়ি-২','পট্ঠানপাল়ি-৩','পট্ঠানপাল়ি-৪','পট্ঠানপাল়ি-৫',

'পারাজিককণ্ড-অট্ঠকথা','পাচিত্তিয-অট্ঠকথা','মহাৰগ্গ-অট্ঠকথা','চূল়ৰগ্গ-অট্ঠকথা','পরিৰার-অট্ঠকথা',

'সীলক্খন্ধৰগ্গ-অট্ঠকথা','মহাৰগ্গ-অট্ঠকথা','পাথিকৰগ্গ-অট্ঠকথা',
'মূলপণ্ণাস-অট্ঠকথা','মজ্ঝিমপণ্ণাস-অট্ঠকথা','উপরিপণ্ণাস-অট্ঠকথা',
'সগাথাৰগ্গ-অট্ঠকথা','নিদানৰগ্গ-অট্ঠকথা','খন্ধৰগ্গ-অট্ঠকথা','সল়াযতনৰগ্গ-অট্ঠকথা','মহাৰগ্গ-অট্ঠকথা',
'এককনিপাত-অট্ঠকথা','দুকনিপাত-অট্ঠকথা','তিকনিপাত-অট্ঠকথা','চতুক্কনিপাত-অট্ঠকথা','পঞ্চকনিপাত-অট্ঠকথা','ছক্কনিপাত-অট্ঠকথা','সত্তকনিপাত-অট্ঠকথা','অট্ঠকনিপাত-অট্ঠকথা','নৰকনিপাত-অট্ঠকথা','দসকনিপাত-অট্ঠকথা','একাদসকনিপাত-অট্ঠকথা',
'খুদ্দকপাঠ-অট্ঠকথা','ধম্মপদ-অট্ঠকথা','উদান-অট্ঠকথা','ইতিৰুত্তক-অট্ঠকথা','সুত্তনিপাত-অট্ঠকথা','ৰিমানৰত্থু-অট্ঠকথা','পেতৰত্থু-অট্ঠকথা','থেরগাথা-অট্ঠকথা','থেরীগাথা-অট্ঠকথা','অপদান-অট্ঠকথা','বুদ্ধৰংস-অট্ঠকথা','চরিযাপিটক-অট্ঠকথা','জাতক-অট্ঠকথা-১','জাতক-অট্ঠকথা-২','জাতক-অট্ঠকথা-৩','জাতক-অট্ঠকথা-৪','জাতক-অট্ঠকথা-৫','জাতক-অট্ঠকথা-৬','জাতক-অট্ঠকথা-৭','মহানিদ্দেস-অট্ঠকথা','চূল়নিদ্দেস-অট্ঠকথা','পটিসম্ভিদামগ্গ-অট্ঠকথা','নেত্তিপ্পকরণ-অট্ঠকথা',
'ধম্মসঙ্গণি-অট্ঠকথা','সম্মোহৰিনোদনী-অট্ঠকথা','ধাতুকথা-অট্ঠকথা','পুগ্গলপঞ্ঞত্তি-অট্ঠকথা','কথাৰত্থু-অট্ঠকথা','যমকপ্পকরণ-অট্ঠকথা','পট্ঠানপ্পকরণ-অট্ঠকথা',

'সারত্থদীপনী-টীকা-১','সারত্থদীপনী-টীকা-২','সারত্থদীপনী-টীকা-৩','দ্বেমাতিকাপাল়ি','কঙ্খাৰিতরণী-অট্ঠকথা','ৰিনযসঙ্গহ-অট্ঠকথা','ৰজিরবুদ্ধি-টীকা','ৰিমতিৰিনোদনী-টীকা','ৰিনযালঙ্কার-টীকা','কঙ্খাৰিতরণীপুরাণ-টীকা','ৰিনযৰিনিচ্ছয-উত্তরৰিনিচ্ছয','ৰিনযৰিনিচ্ছয-টীকা','পাচিত্যাদিযোজনাপাল়ি','খুদ্দসিক্খা-মূলসিক্খা',

'সীলক্খন্ধৰগ্গ-টীকা','মহাৰগ্গ-টীকা','পাথিকৰগ্গ-টীকা','সীলক্খন্ধৰগ্গ-অভিনৰটীকা',
'মূলপণ্ণাস-টীকা','মজ্ঝিমপণ্ণাস-টীকা','উপরিপণ্ণাস-টীকা',
'সগাথাৰগ্গ-টীকা','নিদানৰগ্গ-টীকা','খন্ধৰগ্গ-টীকা','সল়াযতনৰগ্গ-টীকা','মহাৰগ্গ-টীকা',
'এককনিপাত-টীকা','দুকনিপাত-টীকা','তিকনিপাত-টীকা','চতুক্কনিপাত-টীকা','পঞ্চকনিপাত-টীকা','ছক্কনিপাত-টীকা','সত্তকনিপাত-টীকা','অট্ঠকনিপাত-টীকা','নৰকনিপাত-টীকা','দসককনিপাত-টীকা','একাদসকনিপাত-টীকা',
'নেত্তিপ্পকরণ-টীকা','নেত্তিৰিভাৰিনী',
'ধম্মসঙ্গণি-মূলটীকা','ৰিভঙ্গ-মূলটীকা','পঞ্চপকরণ-মূলটীকা','ধম্মসঙ্গণী-অনুটীকা','পঞ্চপকরণ-অনুটীকা','অভিধম্মাৰতারো-নামরূপপরিচ্ছেদো','অভিধম্মত্থসঙ্গহো','অভিধম্মাৰতার-পুরাণটীকা','অভিধম্মমাতিকাপাল়ি',
'ৰিসুদ্ধিমগ্গ-১','ৰিসুদ্ধিমগ্গ-২','ৰিসুদ্ধিমগ্গ-মহাটীকা-১','ৰিসুদ্ধিমগ্গ-মহাটীকা-২','ৰিসুদ্ধিমগ্গ নিদানকথা',
'দীঘনিকায (পু-ৰি)','মজ্ঝিমনিকায (পু-ৰি)','সংযুত্তনিকায (পু-ৰি)','অঙ্গুত্তরনিকায (পু-ৰি)','ৰিনযপিটক (পু-ৰি)','অভিধম্মপিটক (পু-ৰি)','অট্ঠকথা (পু-ৰি)',
'নিরুত্তিদীপনী','পরমত্থদীপনী সঙ্গহমহাটীকাপাঠ','অনুদীপনীপাঠ','পট্ঠানুদ্দেস দীপনীপাঠ',
'নমক্কারটীকা','মহাপণামপাঠ','লক্খণাতো বুদ্ধথোমনাগাথা','সুতৰন্দনা','কমলাঞ্জলি','জিনালঙ্কার','পজ্জমধু','বুদ্ধগুণগাথাৰলী',
'চূল়গন্থৰংস','মহাৰংস','সাসনৰংস',
'কচ্চাযনব্যাকরণং','মোগ্গল্লানব্যাকরণং','সদ্দনীতিপ্পকরণং (পদমালা)','পদরূপসিদ্ধি','মোগল্লানপঞ্চিকা','পযোগসিদ্ধিপাঠ','ৰুত্তোদযপাঠ','অভিধানপ্পদীপিকাপাঠ','অভিধানপ্পদীপিকাটীকা','সুবোধালঙ্কারপাঠ','সুবোধালঙ্কারটীকা','বালাৰতার গণ্ঠিপদত্থৰিনিচ্ছযসার',
'লোকনীতি','সুত্তন্তনীতি','সূরস্সতিনীতি','মহারহনীতি','ধম্মনীতি','কৰিদপ্পণনীতি','নীতিমঞ্জরী','নরদক্খদীপনী','চতুরারক্খদীপনী','চাণক্যনীতি',
'রসৰাহিনী','সীমৰিসোধনীপাঠ','ৰেস্সন্তরগীতি',
'মোগ্গল্লান ৰুত্তিৰিৰরণপঞ্চিকা','থূপৰংস','দাঠাৰংস','ধাতুপাঠৰিলাসিনিযা','ধাতুৰংস','হত্থৰনগল্লৰিহারৰংস','জিনচরিতয','জিনৰংসদীপং','তেলকটাহগাথা','মিলিদটীকা','পদমঞ্জরী','পদসাধনং','সদ্দবিন্দুপকরণং','কচ্চাযনধাতুমঞ্জুসা','সামন্তকূটৰণ্ণনা'];

var bookidlist = ['mul1v01par','mul1v02pac','mul1v03mah','mul1v04cul','mul1v05par','mul2d01sil','mul2d02mah','mul2d03pat','mul3m01mul','mul3m02maj','mul3m03upa','mul4s01sag','mul4s02nid','mul4s03kha','mul4s04sal','mul4s05mah','mul5a01eka','mul5a02duk','mul5a03tik','mul5a04cat','mul5a05pan','mul5a06cha','mul5a07sat','mul5a08att','mul5a09nav','mul5a10das','mul5a11eka','mul6k01khu','mul6k02dha','mul6k03uda','mul6k04iti','mul6k05sut','mul6k06vim','mul6k07pet','mul6k08the','mul6k09the','mul6k10apa01','mul6k11apa02','mul6k12bud','mul6k13car','mul6k14jat01','mul6k15jat02','mul6k16mah','mul6k17cul','mul6k18pat','mul6k19net','mul6k20mil','mul6k21pet','mul7a01dha','mul7a02vib','mul7a03dha','mul7a04pug','mul7a05kat','mul7a06yam01','mul7a07yam02','mul7a08yam03','mul7a09pat01','mul7a10pat02','mul7a11pat03','mul7a12pat04','mul7a13pat05','att1v01par','att1v02pac','att1v03mah','att1v04cul','att1v05par','att2d01sil','att2d02mah','att2d03pat','att3m01mul','att3m02maj','att3m03upa','att4s01sag','att4s02nid','att4s03kha','att4s04sal','att4s05mah','att5a01eka','att5a02duk','att5a03tik','att5a04cat','att5a05pan','att5a06cha','att5a07sat','att5a08att','att5a09nav','att5a10das','att5a11eka','att6k01khu','att6k02dha','att6k03uda','att6k04iti','att6k05sut','att6k06vim','att6k07pet','att6k08the','att6k09the','att6k10apa','att6k11bud','att6k12car','att6k13jat01','att6k14jat02','att6k15jat03','att6k16jat04','att6k17jat05','att6k18jat06','att6k19jat07','att6k20mah','att6k21cul','att6k22pat','att6k23net','att7a01dha','att7a02vib','att7a03dha','att7a04pug','att7a05kat','att7a06yam','att7a07pat','tik1v01sar01','tik1v02sar02','tik1v03sar03','tik1v04dve','tik1v05kan','tik1v06vsa','tik1v07vaj','tik1v08vim','tik1v09vlt','tik1v10kap','tik1v11vuv','tik1v12vvt','tik1v13pdi','tik1v14kmu','tik2d01sil','tik2d02mah','tik2d03pat','tik2d04sab','tik3m01mul','tik3m02maj','tik3m03upa','tik4s01sag','tik4s02nid','tik4s03kha','tik4s04sal','tik4s05mah','tik5a01eka','tik5a02duk','tik5a03tik','tik5a04cat','tik5a05pan','tik5a06cha','tik5a07sat','tik5a08att','tik5a09nav','tik5a10das','tik5a11eka','tik6k01npt','tik6k02nvn','tik7a01dmt','tik7a02vmt','tik7a03pmt','tik7a04dat','tik7a05pat','tik7a06anp','tik7a07asn','tik7a08apu','tik7a09ama','ann1v01vis01','ann1v02vis02','ann1v03vmt01','ann1v04vmt02','ann1v05vnk','ann2s01dig','ann2s02maj','ann2s03san','ann2s04ang','ann2s05vin','ann2s06abh','ann2s07att','ann3l01nir','ann3l02par','ann3l03anu','ann3l04pat','ann4b01nam','ann4b02mah','ann4b03lak','ann4b04sut','ann4b05kam','ann4b06jin','ann4b07paj','ann4b08bud','ann5b01cul','ann5b02mah','ann5b03sas','ann6v01kac','ann6v02mog','ann6v03sad','ann6v04pad','ann6v05mpn','ann6v06pay','ann6v07vut','ann6v08adp','ann6v09adt','ann6v10sup','ann6v11sut','ann6v12val','ann7n01lok','ann7n02sut','ann7n03sur','ann7n04mah','ann7n05dha','ann7n06kav','ann7n07nit','ann7n08nar','ann7n09cat','ann7n10can','ann8p01ras','ann8p02sim','ann8p03ves','ann9s01mog','ann9s02thu','ann9s03dat','ann9s04dha','ann9s05dht','ann9s06hat','ann9s07jin','ann9s08jvd','ann9s09tel','ann9s10mil','ann9s11pad','ann9s12psd','ann9s13sad','ann9s14kdm','ann9s15sam'];

if(bookidlist.indexOf(bookid) >= 0) {
    var index = bookidlist.indexOf(bookid);
    return booktitlelist[index];
}else{return ''}

}

function getPageTitle(bookid, pageid){
    let book = getTitles(bookid)
    for(var key in book){
        if(key == pageid){
            return book[key]
        }
    }
}

function getPageTitleFromPageid(pageid){
    let bookid = pageid.slice(0,10)
    if(pageid.length === 14) bookid = pageid.slice(0,12)
    return getPageTitle(bookid, pageid)
}

//return an array of pageids of att, tik
function getRelatedPageids(pageid){
    //get category, pitaka, book, page
    let category = pageid.slice(0,3) //mul,att,tik
    let pitaka = pageid.slice(3,5) //1v,2d,3m,4s,5a,6k,7a
    let book = pageid.slice(5,10)
    let page = pageid.slice(10)

    if(pageid.length === 14) {
        book = pageid.slice(5,12)
        page = pageid.slice(12)
    }
    
    //console.log('book:'+book+', page:'+page)
    //process
    let pageids = pageidManager(category, pitaka, book, page)

    //output
    return pageids
}

function pageidManager(category, pitaka, book, page){
    let pageids = {}
    if(category == 'mul') {
        let attpageid = get_AttidFor_Mul(pitaka, book, page)
        if(attpageid !== '') pageids['att'] = attpageid

        let tikpageid = get_TikidFor_Mul(pitaka, book, page)
        if(tikpageid !== '') pageids['tik'] = tikpageid
        
    }
    else if(category == 'att') {
        let mulpageid = get_mulid_for_att(pitaka, book, page)
        if(mulpageid !== '') pageids['mul'] = mulpageid

        let tikpageid = get_tikid_for_att(pitaka, book, page)
        if(tikpageid !== '') pageids['tik'] = tikpageid
    }
    else if(category == 'tik') {
        let mulpageid = get_mulid_for_tik(pitaka, book, page)
        if(mulpageid !== '') pageids['mul'] = mulpageid

        let attpageid = get_attid_for_tik(pitaka, book, page)
        if(attpageid !== '') pageids['att'] = attpageid
    }
    return pageids
}

//----------------id for Mul--------------------
function get_AttidFor_Mul(pitaka, book, page){
    let attpageid = ''
    
    //selection
    if(pitaka == '1v') attpageid = get_AttVinid_For_Mul(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  attpageid = get_AttSutid_For_Mul(pitaka, book, page)
    else if(pitaka === '7a') attpageid = get_AttAbhid_For_Mul(book, page)

    //output
    return attpageid
}
function get_AttVinid_For_Mul(book, page){
    let attpageid = 'att1v'

    if(book === '01par'){
        if(page == '01') attpageid += book + '02'
        else if(page == '02')attpageid += book + '03'
        else if(page == '03') attpageid += book + '04'
        else if(page == '04') attpageid += book + '05'
        else if(page == '05') attpageid += book + '06'
    }
    else if(book === '02pac'){
        //if(page =='10' || page =='11') attpageid += book + '09'
        if(page =='10' || page =='11') attpageid = ''
        else attpageid += book+page
    }
    else if(book === '03mah' || book === '04cul' || book === '05par'){attpageid += book+page}

    return attpageid
}
function get_AttSutid_For_Mul(pitaka, book, page){
    let attpageid = 'att'
    let pageint = parseInt(page, 10)
    
    if(pitaka === '2d') {
        if(book === '01sil'){
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '02mah' || book === '03pat'){
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
    }
    else if(pitaka === '3m' ) {
        if(book === '01mul'){
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '02maj' || book === '03upa'){
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
    }
    //'mul4s01sag','mul4s02nid','mul4s03kha','mul4s04sal','mul4s05mah'
    else if(pitaka === '4s' ) {
        if(book === '01sag'){
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else {
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
    }
    
    else if( pitaka === '5a' ) {
        if(book === '01eka'){
            if(pageint >= 1 && pageint <= 11){
                pageint++
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
            else if(pageint == 12) attpageid = ''
            else if(pageint >= 13) attpageid += pitaka+book+pageint
        }
        else if(book == '02duk'){
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '03tik') {
            if(pageint === 18) attpageid += pitaka+book+"17"
            else if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '04cat'){
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '05pan' ) {
            if(pageint >= 27) attpageid = ''
            else if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '06cha' ) {
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '07sat' ) {
            if(pageint >= 9) attpageid = ''
            else attpageid += pitaka+book+'0'+pageint
        }
        else if(book === '08att' ) {
            if(pageint >= 11) attpageid = ''
            else if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '09nav' ) {
            if(pageint >= 6) attpageid = ''
            else if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '10das' ) {
            if((pageint >= 15 && pageint <= 20) || pageint === 23 ) attpageid = ''
            else if(pageint == 21) attpageid += pitaka+book+'15'
            else if(pageint == 22) attpageid += pitaka+book+'16'
            else if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '11eka' ) {
            if(pageint >= 3) attpageid = ''
            else attpageid += pitaka+book+'0'+pageint
        }
    }
    
    else if(pitaka === '6k') {
        if(book === '01khu' || book === '02dha' || book === '03uda' || book === '04iti' || book === '06vim' || book === '07pet'  || book === '08the'){
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '05sut' || book === '09the'){
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '10apa01'){
            book = '10apa'
            if(pageint < 21){
                pageint++
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
            else if(pageint >= 21 && pageint <= 23) attpageid += pitaka+book+'22'
            else if(pageint >= 24 && pageint <= 33){
                pageint--
                attpageid += pitaka+book+pageint
            }
            else if(pageint >= 34 && pageint <= 38) attpageid += pitaka+book+'33'
            else if(pageint >=39){
                pageint = pageint - 5
                attpageid += pitaka+book+pageint
            }
            
        }
        else if(book === '11apa02'){
            book = '10apa'
            if(pageint >= 1 && pageint <= 6) attpageid += pitaka+book+'38'
            else if(pageint == 7) attpageid += pitaka+book+'39'
            else if(pageint >= 8 && pageint <= 11) attpageid += pitaka+book+'40'
            else if(pageint >= 12 && pageint <= 14){
                pageint = pageint + 29
                attpageid += pitaka+book+pageint
            }
            else if(pageint >= 15) attpageid = ''
        }
        else if(book === '12bud'){
            book = '11bud'
            if(pageint >= 1 && pageint <= 28) {
                pageint++
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
            else if(pageint == 29)attpageid = ''
        }
        else if( book === '13car'){
            book = '12car'
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        //'mul6k14jat01','mul6k15jat02'
        else if(book === '14jat01'){
            if(pageint === 1) attpageid += pitaka+'13jat0102'
            else if(pageint === 2) attpageid += pitaka+'14jat0201'
            else if(pageint === 3) attpageid += pitaka+'14jat0202'
            else if(pageint >= 4 && pageint <= 9) {
                book = '15jat03'
                pageint = pageint - 3
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
            else if(pageint >= 10 && pageint <= 16) {
                book = '16jat04'
                pageint = pageint - 9
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
        }
        //15jat02
        else if(book === '15jat02'){
            if(pageint >= 1 && pageint <= 5) {
                book = '17jat05'
                if(pageint < 10) attpageid += pitaka+book+'0'+pageint
                else attpageid += pitaka+book+pageint
            }
            else if(pageint == 6) attpageid += pitaka+'18jat0601'
        }
        else if(book === '16mah'){
            book = '20mah'
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        //17cul
        else if(book === '17cul'){
            book = '21cul'
            if(pageint == 1 || pageint ==2) attpageid += pitaka+book+'01'
            else if(pageint == 3) attpageid += pitaka+book+'02'
        }
        //18pat
        else if(book === '18pat'){
            book = '22pat'
            if(pageint == 1) attpageid += pitaka+book+'02'
            else if(pageint == 2) attpageid += pitaka+book+'13'
            else if(pageint == 3) attpageid += pitaka+book+'14'
        }
        else if(book === '19net'){
            book = '23net'
            pageint++
            if(pageint < 10) attpageid += pitaka+book+'0'+pageint
            else attpageid += pitaka+book+pageint
        }
        else if(book === '20mil' || book === '21pet') attpageid = ''
    }

    return attpageid
}
function get_AttAbhid_For_Mul(book, page){
    let attpageid = 'att7a'  //mul7a01dha01
    let pageint = parseInt(page, 10)
    
    if(book === '01dha'){
        if(pageint == 1) attpageid = ''
        else if(pageint == 2)attpageid += book +'0'+pageint
        else if(pageint >= 3){
            pageint = pageint+3
            attpageid += book +'0'+pageint
        }
    }
    else if(book === '02vib'){attpageid += book+page}
    else if(book === '03dha' || book === '04pug'){
        if(pageint == 1) attpageid += book +'02'
        else if(pageint >= 2) attpageid += book +'03'
    } 
    else if(book === '05kat'){
        pageint = pageint+2
        
        if(pageint < 10)attpageid += book +'0'+pageint
        else attpageid += book +pageint
    }
    //---------Yamaka-----------------
    else if(book === '06yam01'){
        book = '06yam'
        pageint = pageint+1
        attpageid += book +'0'+pageint
    }
    else if(book === '07yam02'){
        book = '06yam'
        pageint = pageint+6
        attpageid += book +'0'+pageint
    }
    else if(book === '08yam03'){
        book = '06yam'
        pageint = pageint+9
        attpageid += book+pageint
    }

    //------------Patthana------------
    else if(book === '09pat01'){
        book = '07pat'
        
        if(pageint < 3) {
            pageint = pageint+1
            attpageid += book +'0'+pageint
        }
        else if(pageint == 3) attpageid = ''
        else if(pageint < 10) attpageid += book +'0'+pageint
    }
    else if(book === '10pat02'){
        book = '07pat'
        pageint = pageint+7
        if(pageint < 10)attpageid += book +'0'+pageint
        else attpageid += book +pageint
    }
    else if(book === '11pat03'){
        book = '07pat'
        attpageid += book +'09'
    }
    else if(book === '12pat04'){
        book = '07pat'
        if(pageint == 1) attpageid += book +'09'
        else if(pageint >= 2 && pageint <= 14 ) attpageid += book +'10'
        else if(pageint > 14 ) attpageid += book +'11'
    }
    else if(book === '13pat05'){
        book = '07pat'
        if(pageint == 1) attpageid += book +'12'
        else if(pageint == 2) attpageid += book +'13'
        else if(pageint >= 3 && pageint <= 8 ) attpageid += book +'14'
        else if(pageint >= 9 && pageint <= 14 ) attpageid += book +'15'
        else if(pageint >= 15 ) attpageid += book +'16'
    }

    return attpageid
}

function get_TikidFor_Mul(pitaka, book, page){
    let tikpageid = ''
    
    //selection
    if(pitaka == '1v') tikpageid = get_TikVinid_For_Mul(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  tikpageid = get_TikSutid_For_Mul(pitaka, book, page)
    else if(pitaka === '7a') tikpageid = get_TikAbhid_For_Mul(book, page)

    //output
    return tikpageid
}
function get_TikVinid_For_Mul(book, page){
    let tikpageid = 'tik1v'
    let pageint = parseInt(page, 10)

    if(book === '01par'){
        if(page == '01') tikpageid += '01sar0102' //sar0102
        else if(page == '02')tikpageid += '02sar0201' //sar0201-04
        else if(page == '03') tikpageid += '02sar0202'
        else if(page == '04') tikpageid += '02sar0203'
        else if(page == '05') tikpageid += '02sar0204'
    }
    else if(book === '02pac'){
        let tikbook = '03sar03'
        if(pageint>=1 && pageint <=3) tikpageid += tikbook+page
        else if(pageint == 4) tikpageid = ''
        else if(pageint >=5 && pageint <=9) {
            pageint--
            tikpageid += tikbook+'0'+pageint
        }
        else if(pageint>=10 && pageint <=11)tikpageid = ''
    }
    else if(book === '03mah'){
        let tikbook = '03sar03'
        pageint = pageint + 9 //eg: (1 => 10) att1v03mah01 => tik1v03sar0310
        tikpageid += tikbook+pageint
    }
    else if(book === '04cul'){
        let tikbook = '03sar03'
        pageint = pageint + 20  //eg: (1 => 10) mul1v04cul01 => tik1v03sar0321
        tikpageid += tikbook+pageint
    }
    else if(book === '05par'){
        let tikbook = '03sar03' 
        if(pageint == 4 || pageint == 10){
            tikpageid = ''
        }
        else if(pageint>=1 && pageint <=3){
            pageint = pageint + 33 //mul1v05par01 tik1v03sar0334
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=5 && pageint <=9){
            pageint = pageint + 32 //mul1v05par05 tik1v03sar0337
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=11 && pageint <=12){
            pageint = 42 //mul1v05par11 tik1v03sar0342
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=13 && pageint <=18){
            pageint = pageint + 30 //mul1v05par13-18 tik1v03sar0343-48
            tikpageid += tikbook+pageint
        } 
        
    }

    return tikpageid
}
function get_TikSutid_For_Mul(pitaka, book, page){
    let tikpageid = 'tik'
    let pageint = parseInt(page, 10)
    
    if(pitaka === '2d') {
        if(book === '01sil'){
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '02mah' || book === '03pat'){
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
    }
    else if(pitaka === '3m' ) {
        if(book === '01mul'){
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '02maj' || book === '03upa'){
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
    }
    //'mul4s01sag','mul4s02nid','mul4s03kha','mul4s04sal','mul4s05mah'
    else if(pitaka === '4s' ) {
        if(book === '01sag'){
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else {
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
    }
    
    else if( pitaka === '5a' ) {
        if(book === '01eka'){
            if(pageint >= 1 && pageint <= 8){
                pageint++
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint == 9) tikpageid = ''
            else if(pageint == 10) tikpageid += pitaka+book+pageint
            else if(pageint == 11 || pageint == 12) tikpageid = ''
            else if(pageint >= 13) {
                pageint = pageint - 2
                tikpageid += pitaka+book+pageint
            }
        }
        else if(book == '02duk'){
            if(pageint == 19) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '03tik') {
            if(pageint === 15) tikpageid = ''
            else if(pageint === 16) tikpageid += pitaka+book+"15"
            else if(pageint === 17 || pageint === 18) tikpageid += pitaka+book+"16"
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '04cat'){
            if(pageint === 22 || pageint === 27 || pageint === 28) tikpageid = ''
            else if(pageint >= 23 && pageint <= 26) {
                pageint = pageint - 1
                tikpageid += pitaka+book+pageint
            }
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '05pan' ) {
            if(pageint >= 24) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '06cha' ) {
            if(pageint >= 11) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '07sat' || book === '08att' ) {
            if(pageint >= 9) tikpageid = ''
            else tikpageid += pitaka+book+'0'+pageint
        }
        else if(book === '09nav' ) {
            if(pageint >= 6) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '10das' ) {
            if((pageint >= 13 && pageint <= 20) || pageint === 22 || pageint === 23) tikpageid = ''
            else if(pageint == 21) tikpageid += pitaka+book+'13'
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '11eka' ) {
            if(pageint >= 3) tikpageid = ''
            else tikpageid += pitaka+book+'0'+pageint
        }
    }
    
    else if(pitaka === '6k') {
        if(book === '01khu' || book === '02dha' || book === '03uda' || book === '04iti' || book === '06vim' || book === '07pet'  || book === '08the'){
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '05sut' || book === '09the'){
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '10apa01'){
            book = '10apa'
            if(pageint < 21){
                pageint++
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint >= 21 && pageint <= 23) tikpageid += pitaka+book+'22'
            else if(pageint >= 24 && pageint <= 33){
                pageint--
                tikpageid += pitaka+book+pageint
            }
            else if(pageint >= 34 && pageint <= 38) tikpageid += pitaka+book+'33'
            else if(pageint >=39){
                pageint = pageint - 5
                tikpageid += pitaka+book+pageint
            }
            
        }
        else if(book === '11apa02'){
            book = '10apa'
            if(pageint >= 1 && pageint <= 6) tikpageid += pitaka+book+'38'
            else if(pageint == 7) tikpageid += pitaka+book+'39'
            else if(pageint >= 8 && pageint <= 11) tikpageid += pitaka+book+'40'
            else if(pageint >= 12 && pageint <= 14){
                pageint = pageint + 29
                tikpageid += pitaka+book+pageint
            }
            else if(pageint >= 15) tikpageid = ''
        }
        else if(book === '12bud'){
            book = '11bud'
            if(pageint >= 1 && pageint <= 28) {
                pageint++
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint == 29)tikpageid = ''
        }
        else if( book === '13car'){
            book = '12car'
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        //'mul6k14jat01','mul6k15jat02'
        else if(book === '14jat01'){
            if(pageint === 1) tikpageid += pitaka+'13jat0102'
            else if(pageint === 2) tikpageid += pitaka+'14jat0201'
            else if(pageint === 3) tikpageid += pitaka+'14jat0202'
            else if(pageint >= 4 && pageint <= 9) {
                book = '15jat03'
                pageint = pageint - 3
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint >= 10 && pageint <= 16) {
                book = '16jat04'
                pageint = pageint - 9
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
        }
        //15jat02
        else if(book === '15jat02'){
            if(pageint >= 1 && pageint <= 5) {
                book = '17jat05'
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint == 6) tikpageid += pitaka+'18jat0601'
        }
        else if(book === '16mah'){
            book = '20mah'
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        //17cul
        else if(book === '17cul'){
            book = '21cul'
            if(pageint == 1 || pageint ==2) tikpageid += pitaka+book+'01'
            else if(pageint == 3) tikpageid += pitaka+book+'02'
        }
        //18pat
        else if(book === '18pat'){
            book = '22pat'
            if(pageint == 1) tikpageid += pitaka+book+'02'
            else if(pageint == 2) tikpageid += pitaka+book+'13'
            else if(pageint == 3) tikpageid += pitaka+book+'14'
        }
        else if(book === '19net'){
            book = '23net'
            pageint++
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '20mil' || book === '21pet') tikpageid = ''
    }

    return tikpageid
}
function get_TikAbhid_For_Mul(book, page){
    let tikpageid = 'tik7a' 
    let pageint = parseInt(page, 10)
    
    if(book === '01dha'){
        book = '01dmt'
        if(pageint == 1) tikpageid = ''
        else if(pageint == 2)tikpageid += book +'0'+pageint
        else if(pageint >= 3){
            pageint = pageint+4
            tikpageid += book +'0'+pageint
        }
    }
    else if(book === '02vib'){
        book = '02vmt'
        tikpageid += book+page
    }
    else if(book === '03dha'){
        book = '03pmt'
        tikpageid += book +'01'
    } 
    else if(book === '04pug'){
        book = '03pmt'
        tikpageid += book +'02'
    } 
    else if(book === '05kat'){
        book = '03pmt'
        tikpageid += book +'03'
    }
    //---------Yamaka-----------------
    else if(book === '06yam01' || book === '07yam02' || book === '08yam03'){
        book = '03pmt'
        tikpageid += book +'04'
    }

    //------------Patthana------------
    else if(book === '09pat01' || book === '10pat02' || book === '11pat03' || book === '12pat04' || book === '13pat05'){
        book = '03pmt'
        tikpageid += book +'05'
    }

    //output
    return tikpageid
}

//----------------id for Att--------------------
function get_mulid_for_att(pitaka, book, page){
    let mulpageid = ''
    
    //selection
    if(pitaka == '1v') mulpageid = get_mulvinid_for_att(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  mulpageid = get_mulsutid_for_att(pitaka, book, page)
    else if(pitaka === '7a') mulpageid = get_mulabhid_for_att(book, page)

    //output
    return mulpageid
}
function get_mulvinid_for_att(book, page){
    let mulpageid = 'mul1v'
    let pageint = parseInt(page, 10)

    if(book === '01par'){
        if(pageint == 1) mulpageid = ''
        else if(pageint >= 2 ) {
            pageint--
            mulpageid += book+'0'+pageint
        }
    }
    else if(book === '02pac' || book === '03mah' || book === '04cul' || book === '05par'){
        if(pageint < 10) mulpageid += book+'0'+pageint
        else mulpageid += book+pageint
    }
    
    return mulpageid
}
function get_mulsutid_for_att(pitaka, book, page){
    let mulpageid = 'mul'
    let pageint = parseInt(page, 10)
    
    if(pitaka === '2d') {
        if(book === '01sil'){
            if(pageint == 1) mulpageid = ''
            else {
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
            
        }
        else if(book === '02mah' || book === '03pat'){
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
    }
    else if(pitaka === '3m' ) {
        if(book === '01mul'){
            if(pageint == 1) mulpageid = ''
            else {
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
            
        }
        else if(book === '02maj' || book === '03upa'){
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        
    }
    //'mul4s01sag','mul4s02nid','mul4s03kha','mul4s04sal','mul4s05mah'
    else if(pitaka === '4s' ) {
        if(book === '01sag'){
            if(pageint == 1) mulpageid = ''
            else {
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
        }
        else {
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
    }
    
    else if( pitaka === '5a' ) {
        if(book === '01eka'){
            if(pageint == 1) mulpageid = ''
            else if(pageint >= 2 && pageint <= 12){
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
            else if(pageint >= 13) mulpageid += pitaka+book+pageint
        }
        else if(book == '02duk'){
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '03tik') {
            if(pageint === 18) mulpageid += pitaka+book+"17"
            else if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '04cat'){
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '05pan' ) {
            if(pageint >= 27) mulpageid = ''
            else if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '06cha' ) {
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '07sat' ) {
            if(pageint >= 9) mulpageid = ''
            else mulpageid += pitaka+book+'0'+pageint
        }
        else if(book === '08att' ) {
            if(pageint >= 11) mulpageid = ''
            else if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '09nav' ) {
            if(pageint >= 6) mulpageid = ''
            else if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '10das' ) {
            if((pageint >= 15 && pageint <= 20) || pageint === 23 ) mulpageid = ''
            else if(pageint == 21) mulpageid += pitaka+book+'15'
            else if(pageint == 22) mulpageid += pitaka+book+'16'
            else if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book === '11eka' ) {
            if(pageint >= 3) mulpageid = ''
            else mulpageid += pitaka+book+'0'+pageint
        }
    }
    
    else if(pitaka === '6k') {
        if(book === '01khu' || book === '02dha' || book === '03uda' || book === '04iti' || book === '06vim' || book === '07pet'  || book === '08the'){
            if(pageint == 1) mulpageid = ''
            else {
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
            
        }
        else if(book === '05sut' || book === '09the'){
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book == '10apa'){
            if(pageint == 1) mulpageid = ''
            else if(pageint <= 22){
                book = '10apa01'
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
            else if(pageint >= 23 && pageint <= 33){
                book = '10apa01'
                pageint++
                mulpageid += pitaka+book+pageint
            }
            else if(pageint >= 34 && pageint <= 37){
                book = '10apa01'
                pageint = pageint + 5
                mulpageid += pitaka+book+pageint
            }
            else if(pageint == 38) {
                book = '11apa02'
                mulpageid += pitaka+book+'01'
            }
            else if(pageint == 39) {
                book = '11apa02'
                mulpageid += pitaka+book+'07'
            }
            else if(pageint == 40) {
                book = '11apa02'
                mulpageid += pitaka+book+'08'
            }
            else if(pageint >= 41) {
                book = '11apa02'
                pageint = pageint - 29
                mulpageid += pitaka+book+pageint
            }
                
        }
        
        else if(book === '11bud'){
            if(pageint == 1) mulpageid = ''
            else {
                book = '12bud'
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
        }
        else if( book === '12car'){
            if(pageint == 1) mulpageid = ''
            else {
                book = '13car'
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
        }
        //--jatakas---------
        else if(book == '13jat01'){
            book = '14jat01'
            if(pageint == 1) mulpageid = ''
            else if(pageint == 2) mulpageid += pitaka+book+'01'
        }
        else if(book == '14jat02'){
            book = '14jat01'
            if(pageint == 1) mulpageid += pitaka+book+'02'
            else if(pageint == 2) mulpageid += pitaka+book+'03'
        }
        else if(book == '15jat03'){
            book = '14jat01'
            pageint = pageint + 3
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book == '16jat04'){
            book = '14jat01'
            pageint = pageint + 9
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book == '17jat05'){
            book = '15jat02'
            if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
            else mulpageid += pitaka+book+pageint
        }
        else if(book == '18jat06' || book == '19jat07'){
            book = '15jat02'
            mulpageid += pitaka+book+'06'
        }
        else if(book === '20mah'){
            if(pageint == 1) mulpageid = ''
            else {
                book = '16mah'
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
        }
        //17cul
        else if(book === '21cul'){
            book = '17cul'
            if(pageint == 1) mulpageid += pitaka+book+'02'
            else if(pageint == 2) mulpageid += pitaka+book+'03'
        }
        //18pat
        else if(book === '22pat'){
            book = '18pat'
            if(pageint >= 2 && pageint <= 12) mulpageid += pitaka+book+'01'
            else if(pageint == 13) mulpageid += pitaka+book+'02'
            else if(pageint >= 14) mulpageid += pitaka+book+'03'
            else mulpageid = ''
        }
        else if(book === '23net'){
            if(pageint == 1) mulpageid = ''
            else {
                book = '19net'
                pageint--
                if(pageint < 10) mulpageid += pitaka+book+'0'+pageint
                else mulpageid += pitaka+book+pageint
            }
        }
    }

    return mulpageid
}
function get_mulabhid_for_att(book, page){
    let mulpageid = 'mul7a'  //mul7a01dha01
    let pageint = parseInt(page, 10)
    
    if(book === '01dha'){
        if(pageint == 1 || pageint == 2) mulpageid = ''
        else if(pageint === 3 || pageint == 4) mulpageid += book+'01'
        else if(pageint == 5) mulpageid += book+'02'
        else if(pageint >= 6){
            pageint = pageint-3
            mulpageid += book +'0'+pageint
        }
    }
    else if(book === '02vib'){mulpageid += book+page}
    else if(book === '03dha')mulpageid += book +'01'
    else if(book === '04pug'){
        if(pageint == 1) mulpageid = ''
        else{
            pageint--
            mulpageid += book+'0'+pageint
        }
    }
    else if(book === '05kat'){
        if(pageint <=  2) mulpageid = ''
        else {
            pageint = pageint-2
            if(pageint < 10)mulpageid += book +'0'+pageint
            else mulpageid += book +pageint
        }
        
    }
    //---------Yamaka-----------------
    else if(book === '06yam'){
        if(pageint == 1 ) mulpageid = ''
        else if(pageint >= 2 && pageint <= 6){
            book = '06yam01'
            pageint--
            mulpageid += book +'0'+pageint
        }
        else if(pageint >= 7 && pageint <= 9){
            book = '07yam02'
            pageint = pageint - 6
            mulpageid += book +'0'+pageint
        }
        else if(pageint >= 10 && pageint <= 11){
            book = '08yam03'
            pageint = pageint - 9
            if(pageint < 10)mulpageid += book +'0'+pageint
            else mulpageid += book +pageint
        }
    }
    
    //------------Patthana------------
    else if(book === '07pat'){
        if(pageint == 1) mulpageid = ''
        else if(pageint == 2 || pageint == 3){
            book = '09pat01'
            pageint--
            mulpageid += book +'0'+pageint
        }
        else if(pageint >= 4 && pageint <= 8){
            book = '09pat01'
            mulpageid += book +'0'+pageint
        }
        else if(pageint == 9){
            book = '11pat03'
            mulpageid += book +'01'
        }//12pat0402
        else if(pageint == 10){
            book = '12pat04'
            mulpageid += book +'02'
        }
        else if(pageint == 11){
            book = '12pat04'
            mulpageid += book +'15'
        }
        else if(pageint == 12){
            book = '13pat05'
            mulpageid += book +'01'
        }
        else if(pageint == 13){
            book = '13pat05'
            mulpageid += book +'02'
        }
        else if(pageint == 14){
            book = '13pat05'
            mulpageid += book +'03'
        }
        else if(pageint == 15){
            book = '13pat05'
            mulpageid += book +'09'
        }
        else if(pageint == 16){
            book = '13pat05'
            mulpageid += book +'15'
        }
    }
    

    return mulpageid
}

function get_tikid_for_att(pitaka, book, page){
    let tikpageid = ''
    
    //selection
    if(pitaka == '1v') tikpageid = get_tikvinid_for_att(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  tikpageid = get_tiksutid_for_att(pitaka, book, page)
    else if(pitaka === '7a') tikpageid = get_tikabhid_for_att(book, page)

    //output
    return tikpageid
}
function get_tikvinid_for_att(book, page){
    let tikpageid = 'tik1v'
    let pageint = parseInt(page, 10)

    if(book === '01par'){
        if(pageint == 1 || pageint == 2){
            let tikbook = '01sar01'
            tikpageid += tikbook+'0'+pageint
        }
        else if(pageint >= 3 ) {
            let tikbook = '02sar02'
            pageint = pageint - 2
            tikpageid += tikbook+'0'+pageint
        }
    }
    
    else if(book === '02pac'){
        let tikbook = '03sar03'
        if(pageint>=1 && pageint <=3) tikpageid += tikbook+page
        else if(pageint == 4) tikpageid = ''
        else if(pageint >=5 && pageint <=9) {
            pageint--
            tikpageid += tikbook+'0'+pageint
        }
        else if(pageint>=10)tikpageid = ''
    }
    else if(book === '03mah'){
        let tikbook = '03sar03'
        pageint = pageint + 9 //eg: (1 => 10) att1v03mah01 => tik1v03sar0310
        tikpageid += tikbook+pageint
    }
    else if(book === '04cul'){
        let tikbook = '03sar03'
        pageint = pageint + 20  //eg: (1 => 10) mul1v04cul01 => tik1v03sar0321
        tikpageid += tikbook+pageint
    }
    else if(book === '05par'){
        let tikbook = '03sar03' 
        if(pageint == 4 || pageint == 10){
            tikpageid = ''
        }
        else if(pageint>=1 && pageint <=3){
            pageint = pageint + 33 //mul1v05par01 tik1v03sar0334
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=5 && pageint <=9){
            pageint = pageint + 32 //mul1v05par05 tik1v03sar0337
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=11 && pageint <=12){
            pageint = 42 //mul1v05par11 tik1v03sar0342
            tikpageid += tikbook+pageint
        } 
        else if(pageint>=13 && pageint <=18){
            pageint = pageint + 30 //mul1v05par13-18 tik1v03sar0343-48
            tikpageid += tikbook+pageint
        } 
        
    }

    return tikpageid
}
function get_tiksutid_for_att(pitaka, book, page){
    let tikpageid = 'tik'
    let pageint = parseInt(page, 10)
    
    if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' ) {
        if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
        else tikpageid += pitaka+book+pageint
    }
    else if( pitaka === '5a' ) {
        if(book === '01eka'){
            if(pageint >= 1 && pageint <= 9){
                if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
                else tikpageid += pitaka+book+pageint
            }
            else if(pageint == 10) tikpageid = ''
            else if(pageint == 11) tikpageid += pitaka+book+'10'
            else if(pageint == 12) tikpageid = ''
            else if(pageint >= 13) {
                pageint = pageint - 2
                tikpageid += pitaka+book+pageint
            }
        }
        else if(book == '02duk'){
            if(pageint == 19) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '03tik') {
            if(pageint === 15) tikpageid = ''
            else if(pageint === 16) tikpageid += pitaka+book+"15"
            else if(pageint === 17 || pageint === 18) tikpageid += pitaka+book+"16"
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '04cat'){
            if(pageint === 22 || pageint === 27 || pageint === 28) tikpageid = ''
            else if(pageint >= 23 && pageint <= 26) {
                pageint = pageint - 1
                tikpageid += pitaka+book+pageint
            }
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '05pan' ) {
            if(pageint >= 24) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '06cha' ) {
            if(pageint >= 11) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '07sat' || book === '08att' ) {
            if(pageint >= 9) tikpageid = ''
            else tikpageid += pitaka+book+'0'+pageint
        }
        else if(book === '09nav' ) {
            if(pageint >= 6) tikpageid = ''
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '10das' ) {
            if((pageint >= 13 && pageint <= 20) || pageint === 22 || pageint === 23) tikpageid = ''
            else if(pageint == 21) tikpageid += pitaka+book+'13'
            else if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else if(book === '11eka' ) {
            if(pageint >= 3) tikpageid = ''
            else tikpageid += pitaka+book+'0'+pageint
        }
    }
    
    else if(pitaka === '6k') {
        if(book === '23net' ){
            book = '01npt'
            if(pageint < 10) tikpageid += pitaka+book+'0'+pageint
            else tikpageid += pitaka+book+pageint
        }
        else tikpageid = ''
    }

    return tikpageid
}
function get_tikabhid_for_att(book, page){
    let tikpageid = 'tik7a' 
    let pageint = parseInt(page, 10)
    
    if(book === '01dha'){
        book = '01dmt'
        if(pageint >= 1 && pageint <= 5) tikpageid += book +'0'+pageint
        else if(pageint >= 6){
            pageint++
            tikpageid += book +'0'+pageint
        }
    }
    else if(book === '02vib'){
        book = '02vmt'
        tikpageid += book+page
    }
    else if(book === '03dha'){
        book = '03pmt'
        tikpageid += book +'01'
    } 
    else if(book === '04pug'){
        book = '03pmt'
        tikpageid += book +'02'
    } 
    else if(book === '05kat'){
        book = '03pmt'
        tikpageid += book +'03'
    }
    //---------Yamaka-----------------
    else if(book === '06yam'){
        book = '03pmt'
        tikpageid += book +'04'
    }

    //------------Patthana------------
    else if(book === '07pat'){
        book = '03pmt'
        tikpageid += book +'05'
    }

    //output
    return tikpageid
}

//----------------id for Tik--------------------
function get_mulid_for_tik(pitaka, book, page){
    let mulpageid = ''
    
    //selection
    if(pitaka == '1v') mulpageid = get_mulvinid_for_att(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  mulpageid = get_mulsutid_for_att(pitaka, book, page)
    else if(pitaka === '7a') mulpageid = get_mulabhid_for_att(book, page)

    //output
    return mulpageid
}
function get_attid_for_tik(pitaka, book, page){
    let attpageid = ''
    
    //selection
    if(pitaka == '1v') attpageid = get_AttVinid_For_Mul(book, page)
    else if(pitaka === '2d' || pitaka === '3m' || pitaka === '4s' || pitaka === '5a' || pitaka === '6k')  attpageid = get_AttSutid_For_Mul(pitaka, book, page)
    else if(pitaka === '7a') attpageid = get_AttAbhid_For_Mul(book, page)

    //output
    return attpageid
}


function getBooknameFromPageid(pageid){
    let bookid = pageid.slice(0,10)
    if(pageid.length === 14) bookid = pageid.slice(0,12)
    let bookname = getBookname(bookid)
    //console.log('bookid: '+bookid+", bookname: "+bookname)
    return bookname
}

function getShortName(bookid){
    //var id = fileid.substr(0,10);
    var booklist = ['mul1v01par','mul1v02pac','mul1v03mah','mul1v04cul','mul1v05par','mul2d01sil','mul2d02mah','mul2d03pat','mul3m01mul','mul3m02maj','mul3m03upa','mul4s01sag','mul4s02nid','mul4s03kha','mul4s04sal','mul4s05mah','mul5a01eka','mul5a02duk','mul5a03tik','mul5a04cat','mul5a05pan','mul5a06cha','mul5a07sat','mul5a08att','mul5a09nav','mul5a10das','mul5a11eka','mul6k01khu','mul6k02dha','mul6k03uda','mul6k04iti','mul6k05sut','mul6k06vim','mul6k07pet','mul6k08the','mul6k09the','mul6k10apa01','mul6k11apa02','mul6k12bud','mul6k13car','mul6k14jat01','mul6k15jat02','mul6k16mah','mul6k17cul','mul6k18pat','mul6k19net','mul6k20mil','mul6k21pet','mul7a01dha','mul7a02vib','mul7a03dha','mul7a04pug','mul7a05kat','mul7a06yam01','mul7a07yam02','mul7a08yam03','mul7a09pat01','mul7a10pat02','mul7a11pat03','mul7a12pat04','mul7a13pat05','att1v01par','att1v02pac','att1v03mah','att1v04cul','att1v05par','att2d01sil','att2d02mah','att2d03pat','att3m01mul','att3m02maj','att3m03upa','att4s01sag','att4s02nid','att4s03kha','att4s04sal','att4s05mah','att5a01eka','att5a02duk','att5a03tik','att5a04cat','att5a05pan','att5a06cha','att5a07sat','att5a08att','att5a09nav','att5a10das','att5a11eka','att6k01khu','att6k02dha','att6k03uda','att6k04iti','att6k05sut','att6k06vim','att6k07pet','att6k08the','att6k09the','att6k10apa','att6k11bud','att6k12car','att6k13jat01','att6k14jat02','att6k15jat03','att6k16jat04','att6k17jat05','att6k18jat06','att6k19jat07','att6k20mah','att6k21cul','att6k22pat','att6k23net','att7a01dha','att7a02vib','att7a03dha','att7a04pug','att7a05kat','att7a06yam','att7a07pat','tik1v01sar01','tik1v02sar02','tik1v03sar03','tik1v04dve','tik1v05kan','tik1v06vsa','tik1v07vaj','tik1v08vim','tik1v09vlt','tik1v10kap','tik1v11vuv','tik1v12vvt','tik1v13pdi','tik1v14kmu','tik2d01sil','tik2d02mah','tik2d03pat','tik2d04sab','tik3m01mul','tik3m02maj','tik3m03upa','tik4s01sag','tik4s02nid','tik4s03kha','tik4s04sal','tik4s05mah','tik5a01eka','tik5a02duk','tik5a03tik','tik5a04cat','tik5a05pan','tik5a06cha','tik5a07sat','tik5a08att','tik5a09nav','tik5a10das','tik5a11eka','tik6k01npt','tik6k02nvn','tik7a01dmt','tik7a02vmt','tik7a03pmt','tik7a04dat','tik7a05pat','tik7a06anp','tik7a07asn','tik7a08apu','tik7a09ama','ann1v01vis01','ann1v02vis02','ann1v03vmt01','ann1v04vmt02','ann1v05vnk','ann2s01dig','ann2s02maj','ann2s03san','ann2s04ang','ann2s05vin','ann2s06abh','ann2s07att','ann3l01nir','ann3l02par','ann3l03anu','ann3l04pat','ann4b01nam','ann4b02mah','ann4b03lak','ann4b04sut','ann4b05kam','ann4b06jin','ann4b07paj','ann4b08bud','ann5b01cul','ann5b02mah','ann5b03sas','ann6v01kac','ann6v02mog','ann6v03sad','ann6v04pad','ann6v05mpn','ann6v06pay','ann6v07vut','ann6v08adp','ann6v09adt','ann6v10sup','ann6v11sut','ann6v12val','ann7n01lok','ann7n02sut','ann7n03sur','ann7n04mah','ann7n05dha','ann7n06kav','ann7n07nit','ann7n08nar','ann7n09cat','ann7n10can','ann8p01ras','ann8p02sim','ann8p03ves','ann9s01mog','ann9s02thu','ann9s03dat','ann9s04dha','ann9s05dht','ann9s06hat','ann9s07jin','ann9s08jvd','ann9s09tel','ann9s10mil','ann9s11pad','ann9s12psd','ann9s13sad','ann9s14kdm','ann9s15sam'];
    var bookShortnamelist = ['পারা.','পাচি.','মহা.','চুল.','পরি.','দীঘ.০১.','দীঘ.০২.','দীঘ.০৩.','মজ্ঝি.০১.','মজ্ঝি.০২.','মজ্ঝি.০৩.','সং.০১.','সং.০২.','সং.০৩.','সং.০৪.','সং.০৫.','অঙ্গু.০১.','অঙ্গু.০২.','অঙ্গু.০৩.','অঙ্গু.০৪.','অঙ্গু.০৫.','অঙ্গু.০৬.','অঙ্গু.০৭.','অঙ্গু.০৮.','অঙ্গু.০৯.','অঙ্গু.১০.','অঙ্গু.১১.','খুদ্দ.পাঠ.','ধম্মপদ.','উদা.','ইতি.','সুত্তনি.','ৰিমা.','পেত.','থের.','থেরী.','অপ.০১.','অপ.০২.','বুদ্ধ.','চরিযা.','জাতক.১.','জাতক.২.','মহানি.','চূলনি.','পটিস.','নেত্তি.','মিলিন্দ.','পেটকো.','ধম্মস.','ৰিভঙ্গ.','ধাতু.','পুগ্গল.','কথাৰ.','যমক.০১.','যমক.০২.','যমক.০৩.','পট্ঠান.০১.','পট্ঠান.০২.','পট্ঠান.০৩.','পট্ঠান.০৪.','পট্ঠান.০৫.','পারা.অ.','পাচি.অ.','মহা.অ.','চুল.অ.','পরি.অ.','দীঘ.অ.০১.','দীঘ.অ.০২.','দীঘ.অ.০৩.','মজ্ঝি.অ.০১.','মজ্ঝি.অ.০২.','মজ্ঝি.অ.০৩.','সং.অ.০১.','সং.অ.০২.','সং.অ.০৩.','সং.অ.০৪.','সং.অ.০৫.','অঙ্গু.অ.০১.','অঙ্গু.অ.০২.','অঙ্গু.অ.০৩.','অঙ্গু.অ.০৪.','অঙ্গু.অ.০৫.','অঙ্গু.অ.০৬.','অঙ্গু.অ.০৭.','অঙ্গু.অ.০৮.','অঙ্গু.অ.০৯.','অঙ্গু.অ.১০.','অঙ্গু.অ.১১.','খুদ্দ.পাঠ.অ.','ধম্মপদ.অ.','উদা.অ.','ইতি.অ.','সুত্তনি.অ.','ৰিমা.অ.','পেত.অ.','থের.অ.','থেরী.অ.','অপ.অ.','বুদ্ধ.অ.','চরিযা.অ.','জাতক.অ.০১.','জাতক.অ.০২.','জাতক.অ.০৩.','জাতক.অ.০৪.','জাতক.অ.০৫.','জাতক.অ.০৬.','জাতক.অ.০৭.','মহানি.অ.','চূলনি.অ.','পটিস.অ.','নেত্তি.অ.','ধম্মস.অ.','ৰিভঙ্গ.অ.','ধাতু.অ.','পুগ্গল.অ.','কথাৰ.অ.','যমক.অ.','পট্ঠান.অ.','সার.টী.০১.','সার.টী.০২.','সার.টী.০৩.','দ্বেমা.','কঙ্খা.ৰি.অ.','ৰিন.স.অ.','ৰজি.টী.','ৰিম.টী.','বিন.ল.টী.','কঙ্খা.পু.টী.','ৰিন.উত্ত.','ৰিন.ৰি.টী.','পাচিত্যা.','খুদ্দ.মূ.','দীঘ.টী.০১.','দীঘ.টী.০২.','দীঘ.টী.০৩.','সীল.অভি.টী.','মজ্ঝি.টী.০১.','মজ্ঝি.টী.০২.','মজ্ঝি.টী.০৩.','সং.টী.০১.','সং.টী.০২.','সং.টী.০৩.','সং.টী.০৪.','সং.টী..০৫.','অঙ্গু.টী.০১.','অঙ্গু.টী.০২.','অঙ্গু.টী.০৩.','অঙ্গু.টী.০৪.','অঙ্গু.টী.০৫.','অঙ্গু.টী.০৬.','অঙ্গু.টী.০৭.','অঙ্গু.টী.০৮.','অঙ্গু.টী.০৯.','অঙ্গু.টী.১০.','অঙ্গু.টী.১১.','নেত্তি.টী.','নেত্তি.ৰি.','ধম্মস.মূ.টী.','ৰিভ.মূ.টী.','পঞ্চপ.মূ.টী.','ধম্মস.অনুটী.','পঞ্চপ.অনুটী.','অভিধ.নাম.','অভিধ.স.','অভিধ.পু.','অভিধ.মা.','ৰিসু.১.','ৰিসু.২.','ৰিসু.মহা.১.','ৰিসু.মহা.২.','ৰিসু.নিদা.','দীঘ.পুবি.','মজ্ঝি.পুবি.','সং.পুবি.','অঙ্গু.পুবি.','ৰিন.পুবি.','অভি.পুবি.','অট্ঠ.পুবি.','নিরু.দী.','পরম.দী.','অনু.দী.','পট্ঠা.দী.','নম.টী.','মহাপ.পা.','লক্খ.বু.','সুত্ত.ৰ.','কমল.','জিনা.','পজ্জ.','বুদ্ধ.গা.','চূল.গ.','মহাৰং.','সাস.ৰং.','কচ্চা.ব্যা.','মোগ্গ.ব্যা.','সদ্দ.প.','পদ.সি.','মোগ্গ.প.','পযো.সি.','ৰুত্তো.','অভিধা.দী.','অভিধা.দী.টী.','সুবো.','সুৰো.টী.','বালা.','লোক.','সুত্ত.','সূরস্স.','মহার.','ধম্মনী.','কৰিদ.','নীতিম.','নর.দী.','চতু.দী.','চাণক্য.','রস.','সীম.','ৰেস্স.','মোগ্গ.ৰি.','থূপ.','দাঠা.','ধাতুপা.','ধাতুৰ.','হত্থৰ.','জিনচ.','জিনৰ.','তেলক.','মিলিদ.','পদম.','পদসা.','সদ্দৰি.','কচ্চা.ধা.','সামন্ত.'];

    if(booklist.indexOf(bookid) >= 0) {
        var index = booklist.indexOf(bookid);
        return bookShortnamelist[index];
    } else{return ''}  
}

